{
    "Masters": {
        "Examensarbete": {
            "Kurs": "TQXX33",
            "Huvudområde": "se beslutade huvudområden",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": null,
            "Studierektor": null,
            "Undervisningstid": null,
            "Fördjupningsnivå": "A2E",
            "Rekommenderade förkunskaper": null,
            "Lärandemål": null,
            "Kursinnehåll": "<p>Bestäms individuellt för varje student i samråd med examinator och handledare. Arbetet skall utföras inom huvudområdet för examen.</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen utgörs av ett av självständigt arbete. För varje studerande/grupp av studenter utses en handledare och examinator. Examensarbetet utgör det avslutande momentet på utbildningen.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>AUSK</td><td>Tre auskultationer</td><td>0.5 hp</td><td>D</td></tr><tr><td>OPPO</td><td>Opposition</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Planeringsrapport, halvtidskontroll, skriftlig rapport, framläggning samt reflektionsdokument</td><td>28 hp</td><td>U, G</td></tr></tbody></table><div><p>Auskultation får göras fr.o.m. programtermin 7 på civilingenjörsprogrammet och bokförs tills registrering på exjobbet kan göras på kurskoden TEXCIV. Auskultation ska göras på samma eller högre nivå än det egna examensarbetet.</p><p>Opposition ska göras på samma nivå och med samma omfattning som det egna examensarbetet, och görs i samband med genomförandet av det egna examensarbetet. Den studerande skall opponera på minst ett examensarbete.</p><p>Den skriftliga redovisningen innebär att manus färdigt för publicering ska föreligga samt ett individuellt reflektionsdokument över genomfört arbete.</p><p>På kursen ges betygen Underkänd/Godkänd.</p></div>",
            "Betygsskala": "Tvågradig skala, äldre version, U, G",
            "Övrig information": "<p>Följande kurskoder, beroende på huvudområde, baseras på denna kursplan:</p><p>TQIT33 - Informationsteknologi<br>TQKB33 - Kemisk biologi<br>TQPU33 - Produktutveckling<br>TQTB33 - Teknisk biologi&nbsp;<br>TQDV33 - Datavetenskap<br>TQDT33 - Datateknik<br>TQET33 - Elektroteknik<br>TQEM33 - Energi- och miljöteknik<br>TQFT33 - Flygteknik<br>TQIE33 - Industriell ekonomi<br>TQMT33 - Maskinteknik<br>TQMD33 - Medicinsk teknik<br>TQME33 - Medieteknik<br>TQTF33 - Teknisk fysik<br>TQTM33 - Tillämpad matematik<br>TQTS33 - Transportsystem</p>",
            "Påbyggnadskurser": null,
            "Institution": "Tekniska fakultetens kansli",
            "Kurslitteratur": null
        },
        "Mjukvarutekniskt entreprenörskap": {
            "Kurs": "TDDE02",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Aseel Berglund",
            "Studierektor": "Martin Sjölund",
            "Undervisningstid": null,
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "Kursen förutsätter att studenten har avancerade programmeringskunskaper samt goda kunskaper inom något mjukvarurelaterat teknikområde (exempelvis datornät, säkerhet, mobila och sociala applikationer, AI, signalbehandling och datorgrafik). Studenten ska också ha erfarenhet från programmeringsprojekt i grupp. Studenten ska dessutom självständigt kunna söka och strukturera information, samt kommunicera muntligen och skriftligen.",
            "Lärandemål": "<p>Kursen syftar till att studenterna ska tillägna sig kunskaper och förmågor inom områdena entreprenörskap och mjukvaruutveckling, med särskilt fokus på formulering, kvalificering och realisering av idéer till entreprenöriella verksamheter.<br>\n<br>\nEfter avslutad kurs skall den studerande kunna:</p>\n\n<ul>\n\t<li>Kunna använda metodik för utveckling av innovativa mjukvaruprodukter</li>\n\t<li>Kunna använda affärsmodeller för mjukvara</li>\n\t<li>Kunna använda metoder för spridning och marknadsföring av mjukvara</li>\n\t<li>Kunna använda affärsanalysmodeller som kan utvärdera IT-systems påverkan på omgivande ekonomiska, sociala och ekologiska system relaterade&nbsp;till mjukvaruinriktat entreprenörskap</li>\n\t<li>Ha förmåga att kommunicera ett förslag till en mjukvaruorienterad affärsidé skriftligen och muntligen</li>\n\t<li>Ha god kännedom om tjänsteperspektiv på mjukvara</li>\n\t<li>Ha god kännedom om finansiering för realisering av en mjukvaruorienterad affärsidé</li>\n\t<li>Ha god kännedom om immaterialrätt</li>\n\t<li>Ha god kännedom om vad som krävs av en själv och andra för att lyckas som entreprenör.</li>\n</ul>\n\n<p>&nbsp;</p>",
            "Kursinnehåll": "<p></p><ul>\n<li>Metodik för utveckling av innovativa mjukvaruprodukter \n</li><li>Affärsmodeller för mjukvara \n</li><li>Metoder för spridning och marknadsföring av mjukvara \n</li><li>Analysmodeller för mjukvaruinriktat entreprenörskap \n</li><li>Muntlig och skriftlig presentation av mjukvaruorienterade affärsidéer \n</li><li>Tjänsteperspektiv på mjukvara \n</li><li>Bemanning \n</li><li>Finansiering \n</li><li>Immaterialrätt \n</li></ul><p></p>",
            "Undervisnings- och arbetsformer": "<p>Undervisningen består av föreläsningar, seminarier och projektarbete i grupp. Föreläsningar introducerar delar av kursinnehållet. Seminarier används för diskussion av fallstudier och specifika moment i projektarbetet. Projektet mynnar ut i en kundverifierad idé som löser ett äkta problem.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Projektarbete</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för datavetenskap",
            "Kurslitteratur": null
        },
        "Vetenskaplig metod": {
            "Kurs": "TNM107",
            "Huvudområde": "Datateknik, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Niklas Rönnberg",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": null,
            "Fördjupningsnivå": "A1F",
            "Rekommenderade förkunskaper": "<p>30 hp på avancerad nivå inom sitt huvudområde. Erfarenhet av att läsa vetenskapliga, granskade artiklar inom sitt huvudområde.&nbsp;</p>",
            "Lärandemål": "<p>Efter genomgången kurs ska studenten</p>\n\n<ul>\n\t<li>kunna värdera texter med avseende på vetenskaplighet och ingenjörsmässighet.</li>\n\t<li>ha god kännedom om samt kunna välja och utvärdera vetenskapliga och ingenjörsmässiga metoder inom sitt huvudområde.</li>\n\t<li>kunna skriva vetenskaplig text enligt god akademisk standard.</li>\n\t<li>kunna utforma och kritisera en plan för en vetenskaplig studie.</li>\n\t<li>kunna kritisera vetenskapliga arbeten.</li>\n\t<li>kunna söka och kritiskt granska källor inom sitt huvudområde.</li>\n\t<li>kunna sammanställa vetenskaplig information.</li>\n\t<li>kunna bedöma och hantera etiska frågeställningar och samhälleliga aspekter av vetenskapligt arbete.</li>\n</ul>",
            "Kursinnehåll": "<ul>\n\t<li>Vetenskaplig metod: Syftet med vetenskapliga metoder, kvantitativa metoder, kvalitativa metoder.</li>\n\t<li>Ingenjörskonst och vetenskaplighet</li>\n\t<li>Vetenskapligt skrivande</li>\n\t<li>Litteratursökning och sammanställning</li>\n\t<li>Källkritik: reliabilitet och validitet</li>\n\t<li>Referenshantering: specificitet och fullständighet.</li>\n\t<li>Forskningsetik</li>\n\t<li>Samhälleliga aspekter av forskning och teknisk utveckling&nbsp;</li>\n</ul>",
            "Undervisnings- och arbetsformer": "<p>Kursen är organiserad i föreläsningar, seminarier och inlämningsuppgifter. Kursen utförs som en förstudie till ett examensarbete, inklusive formulering av forskningsfrågor, litteratursökning och sammanställning av en teoretisk referensram, samt initial metodbeskrivning. I kursen analyseras också olika vetenskapliga aspekter av examensarbeten i seminarieform. Under kursen presenteras vetenskapliga metoder från huvudområden som är aktuella för studenternas examensarbeten.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG2</td><td>Seminarier</td><td>4 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Inlämningsuppgifter</td><td>2 hp</td><td>U, G</td></tr></tbody></table>",
            "Betygsskala": "Tvågradig skala, äldre version, U, G",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": null,
            "Kurslitteratur": null
        },
        "Design och programmering av datorspel": {
            "Kurs": "TDDD23",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap, Programmering",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Erik Berglund",
            "Studierektor": "Jalal Maleki",
            "Undervisningstid": "Preliminär schemalagd tid: 52 h <br>Rekommenderad självstudietid: 108 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Programmering 10hp (varav minst 6hp objektorienterad programmering), Grundkurs i Användbara/interaktiva system eller liknande.</p>",
            "Lärandemål": "<p>Målet med kursen är att du ska förvärva kunskaper i hur datorspel är uppbyggda, vilka designparametrar som finns och hur dessa påverkar spelbarheten, samt principer för hur datorspel programmeras. \n</p><ul>\n<li>Beskriva designparameterar i spel som game play, progression och variation, förmedling av spelets mekanismer, tempo, och perfektionism \n</li><li>Analysera, välja och använda högnivåspråk/högnivåverktyg för spelutveckling\n</li><li>Värdera högnivåverktyg för programmering av datorspel med avseende på utvecklingseffektivitet\n</li><li>Implementera en fungerande spelprototyp\n</li><li>Analysera och diskutera spelupplevelser\n</li></ul><p></p>",
            "Kursinnehåll": "<p></p><ul>\n<li>Vad som kännetecknar spel\n</li><li>Olika typer av spelupplevelser\n</li><li>Drivkrafter i spel\n</li><li>Designparametrar\n</li><li>Spelanalys\n</li><li>Högnivåverktyg och programmeringstekniker för datorspel\n</li></ul><p></p>",
            "Undervisnings- och arbetsformer": "<p>Kursen innehåller en föreläsningsserie om designparametrar och tekniska frågeställningar om design och programmering av datorspel. I främsta hand fokuserar designdelen på progression, variation och utlärning av spelmekanismer genom spelet. Grafisk form eller ljud är i denna mening inte del av design utan det är själva game play vi behandlar. I övrigt handleds studenterna i ett eget utvecklingsprojekt med en spelprototyp, inklusive eget val av högnivåverktyg för spelutveckling. En analys av grundläggande spelidé och testning av prototyp samt reflektion och återkoppling på implementerat spel genomförs och ligger till grund för den slutliga reflektionen över spelets designparametrar samt värdering av den valda tekniska plattformen.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA2</td><td>Projekt</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för datavetenskap",
            "Kurslitteratur": null
        },
        "Deep Learning för medieteknik": {
            "Kurs": "TNM112",
            "Huvudområde": "Datateknik, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Gabriel Eilertsen",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": null,
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Sannolikhetslära och statistik, matematisk analys, linjär algebra och grundläggande programmering. Grunder i maskininlärning är fördelaktigt, men inte ett krav.</p>",
            "Lärandemål": "<p>Kursens mål är att lära ut grunderna i djupinlärning, såväl teoretiska som praktiska, samt att ge övergripande kunskaper om moderna tekniker och tillämpningar relaterade till djupinlärning för bild, grafik och ljud.</p><p>Efter avslutad kurs ska deltagaren kunna:</p><ul><li>redogöra för grunderna i hur artificiella neuronnät konstrueras och optimeras, samt visa tydlig förståelse för hur teoretiska begrepp knyter an till praktiska situationer,</li><li>demonstrera kunskap om moderna metoder för hur neuronnät kan konstrueras, optimeras och användas i olika sammanhang inom datorseende, bildbehandling, datorgrafik, språkförståelse och visualisering,</li><li>använda existerande verktyg för att med djupinlärning lösa väldefinierade klassificerings- och regressionsproblem inom digital media,</li><li>använda tekniker för att testa och förbättra prestanda i neuronnät, inklusive koncept såsom detektion av överpassning och tekniker för att öka generaliseringsförmåga,</li><li>formulera och lösa enklare problem från grunden, inklusive datainsamling, val av teknik, samt analys av resultat,</li><li>reflektera kring konsekvenserna av en ökande användning av djupinlärning i samhället, såväl möjligheter som potentiella problematiska frågeställningar.</li></ul>",
            "Kursinnehåll": "<p>Översikt av maskininlärning. Artificiella neuronnät (ANN) och begreppet djupinlärning. Inlärningsparadigm (övervakad/oövervakad/semiövervakad/självövervakad/förstärkt inlärning). Optimering av ANN (back-propagation, stochastic gradient descent, momentum, batch normalization). Regularisering (augmentation, drop-out, early-stopping). Data (bilder/video/ljud/3D, representation, träning/test, bias, adversarial examples). Arkitekturer (faltningsnät, auto-encoders, återkopplade nät, residual-nät). Generativ djupinlärning. Tillämpningar (datorseende, bildbehandling, datorgrafik, språkförståelse, visualisering) och omvärld (inverkan på samhälle, etik, bias).</p>",
            "Undervisnings- och arbetsformer": "<p>Undervisningen består av föreläsningar, lektioner och laborationer. Föreläsningarna lär ut teori och förklarar delar av den intensiva forskning som ägt rum inom djupinlärning det senaste årtiondet. Lektionerna behandlar de praktiska aspekterna kring användning av verktyg för att lösa problem med djupinlärning; kunskap som sedan används i laborationerna för att konstruera och optimera neuronnät.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationskurs</td><td>3 hp</td><td>U, G</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Multicore- och GPU-Programmering": {
            "Kurs": "TDDD56",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Christoph Kessler",
            "Studierektor": "Martin Sjölund",
            "Undervisningstid": "Preliminär schemalagd tid: 60 h <br>Rekommenderad självstudietid: 100 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Datorteknik. Datastrukturer och algoritmer. Processprogrammering och operativsystem. Programmering i C, viss kunskap i C++ rekommenderas.</p>",
            "Lärandemål": "<p>Moderna datorer har processorer med flera kärnor och kraftfulla flerkärniga hårdvaruacceleratorer t ex Graphics Processing Unit (GPU) som kan användas för allmänna beräkningar (GPGPU eller GPU Computing). Prestandapotentialen hos sådana arkitekturer kan bara utnyttjas fullt ut om koden är ordentligt parallelliserad och omskriven för att utnyttja särskilda arkitektoniska detaljer.<br>\nEfter kursen ska studenten:</p>\n\n<ul>\n\t<li>kunna skriva ny kod och skriva om kod för flerkärniga och GPGPU arkitekturer</li>\n\t<li>förstå parallella algoritmer och datastrukturer, och kunna analysera dem</li>\n\t<li>känna till allmänna principer för parallell databehandling och tekniker för parallellisering.</li>\n</ul>\n\n<p>&nbsp;</p>",
            "Kursinnehåll": "<p>Introduktion till multicore-, mångkärnig- och GPU-arkitektur.Teori för parallella beräkningar. Teori för parallellisering. Design och analys av parallella algoritmer. Översikt av parallella programmeringsspråk. Trådprogrammering för flerkärniga datorer. SIMD-programmering och data-parallell programmering. GPU-programmering med OpenCL och / eller CUDA. Icke-blockerande synkronisering och transaktionsminne. Schemaläggning för multicore- och operativsystem. Introduktion till heterogena multicore och parallell-DSP arkitekturkoncept och programmering av sådana.</p>",
            "Undervisnings- och arbetsformer": "<p>En föreläsningsserie introducerar teorin och ger en överblick på arkitektoniska koncept och programmeringstekniker. En labbserie innehåller programmeringsuppgifter i multi-core trådprogrammering och GPU-programmering. På lektionerna introduceras programmeringsplattformarna som används för laborationerna.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Datorlabbar</td><td>3 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>Skriftlig examination</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div>Frågorna i tentamen kontrollerar hur väl kursdeltagaren har uppfyllt lärandemål för kursen. För godkänt tentamen kan brister i uppfyllandet av vissa delmål uppvägas av  bättre uppfyllda andra delmål.</div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": "<p>Påbyggnadskurser: Programmering av parallelldatorer - metoder och verktyg är en kompletterande kurs. Båda tar upp parallellprogrammering men där fokus i denna kurs ligger på trådprogrammering och GPU-programmering. I den kompletterande kursen fokuseras på OpenMP och meddelandeutbyte vilket krävs vid programmering av större datorkluster.</p>",
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för datavetenskap",
            "Kurslitteratur": null
        },
        "Interaktionsprogrammering": {
            "Kurs": "TDDC73",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Anders Fröberg",
            "Studierektor": "Jalal Maleki",
            "Undervisningstid": "Preliminär schemalagd tid: 40 h <br>Rekommenderad självstudietid: 120 h",
            "Fördjupningsnivå": "G2F",
            "Rekommenderade förkunskaper": "Programmering 15hp, varav minst 6hp objektorienterad programmering",
            "Lärandemål": "<p>Kursen går ut på att du ska lära dig principer och programmeringstekniker för avancerade grafiska användargränssnitt. Vi kallar detta för interaktionsprogrammering.</p><p><br>Mål för Kunskap och förståelse:</p><ul><li>Redogöra för arkitekturen hos ett händelsebaserat fönstersystem med grafiska komponenter (widgets).</li><li>Redogöra för olika designprinciper för grafiska användargränssnitt</li><li>Redogöra för hur interaktionsprogrammering ingår i utvecklingsarbete med användbara system.</li></ul><p><br>Mål för Färdighet och förmåga:</p><ul><li>Använda ett aktuellt programmeringsspråk och klassbibliotek för interaktionsprogrammering, t ex Flutter, React-Native och Kotlin.</li><li>Skapa egna komponenter (widgets) som en utökning av ett befintligt klassbibliotek.</li><li>Modellera och implementera ett enkelt fönstersystem.</li><li>Tillämpa designmönster för interaktionstekniker.</li><li>Arbeta med interaktionsprogrammering i kontexten av användbarhetsproblem.</li></ul><p>&nbsp;</p><p>Mål för Värderingsförmåga och förhållningssätt:</p><ul><li>Redogöra för kopplingen mellan klassbibliotek för interaktionsprogramming och principer för design av användargränssnitt.</li></ul><p>&nbsp;</p>",
            "Kursinnehåll": "<p>&nbsp;</p>\n\n<ul>\n\t<li>Arkitektur för händelsebaserade fönstersystem med widgets.</li>\n\t<li>Designmönster för interaktionsprogrammering (t.ex. MVC, Observer, Command, Decorator).</li>\n\t<li>Klassbibliotek för grafiska användargränssnitt.</li>\n\t<li>Programmering av egna widgets i Android.</li>\n\t<li>Omdesign och implementation av grafiska användargränssnitt baserat på kända användbarhetsproblem.</li>\n\t<li>Interaktionsprogrammering och designprinciper för grafiska användargränssnitt, t.ex. hur klassbibliotek kan stödja konventioner och interaktionsparadigm.</li>\n</ul>\n\n<p>&nbsp;</p>",
            "Undervisnings- och arbetsformer": "<p>Undervisningen består av laborationer och projektarbete (i grupp och individuellt).</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projektarbete</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för datavetenskap",
            "Kurslitteratur": null
        },
        "Teknik för avancerade datorspel": {
            "Kurs": "TSBK03",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Ingemar Ragnemalm",
            "Studierektor": "Lasse Alfredsson",
            "Undervisningstid": null,
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "Programmeringskunskaper. Datorgrafik. Linjär algebra. Grundkurs i fysik.",
            "Lärandemål": "<p>När du har gått kursen skall du kunna</p><p>Mål 1: redogöra för aktuella metoder för avancerad datorgrafik, animation, fysik och artificiell intelligens relevant för spel och liknande tillämpningar</p><p>Mål 2: redogör för grunderna i parallellprogrammering med GPU</p><p>Mål 3: implementera ett urval av ovanstående metoder</p><p>Mål 4: formulera och genomföra ett kursrelevant projekt på en avancerad nivå, som skall kunna relateras till signifikanta publikationer, och för högsta betyg bör vara baserat på aktuell forskning</p>",
            "Kursinnehåll": "<p>Kursen avser att ge kunskap om den teknik som krävs för att göra tekniskt avancerade datorspel, interaktiva utbildningssystem och simulatorer. Studenterna lär sig de viktigaste algoritmerna samt får genom projektet spetskunskap i något valt delområde.</p><p>Datorgrafik: Stencilbuffer. Skuggor. HDR. Bump mapping. Stereoskopiska grafiksystem.&nbsp;<br>Fysik: Kinetik och kinematik. Stela kroppar. Deformerbara kroppar. Animation. Skinning.&nbsp;<br>AI: Sökning, beteenden, tillståndsmaskiner.&nbsp;<br>Nätverk: Principer för spelnätverk. Netlag.&nbsp;<br>Övrigt: Kvaternjoner för rotation. GPU computing.</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen är uppdelad i en föreläsningsserie, en laborationskurs och en projektuppgift som utförs i grupper om 2-3 personer.\n<br>Kursen pågår två perioder, varav den första ägnas åt föreläsningar och laborationer, och den andra till projektarbete.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projektuppgift</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationskurs med duggor</td><td>3 hp</td><td>U, G</td></tr></tbody></table><div>Teoristoff från föreläsningarna examineras med duggor på laborationerna.</div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för systemteknik",
            "Kurslitteratur": null
        },
        "Artificiell intelligens för interaktiv media, projektkurs": {
            "Kurs": "TNM114",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Pierangelo Dellacqua",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 12 h <br>Rekommenderad självstudietid: 148 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Artificiell intelligens</p>",
            "Lärandemål": "<p>Kursen fokuserar på att beskriva artificiell intelligens -tekniker som kan användas för metaverse och interaktiv media. Efter kursen kommer studenten kunna&nbsp;</p><ul><li>förklara och diskutera begrepp inom artificiell intelligens för interaktiva medieapplikationer på ett kritiskt sätt och</li><li>välja, tillämpa och utvärdera några av de presenterade artificiella intelligensteknikerna i ett projektarbete</li></ul>",
            "Kursinnehåll": "<ul><li>Intelligenta metoder för att utforska virtuella världar</li><li>Artificiellt liv för virtuella världar</li><li>AI-tekniker för att bygga virtuella världar</li><li>Behavioral animering</li><li>Maskininlärning: reinforcement learning, decision trees</li><li>Djupinlärning</li><li>Språkteknologi</li><li>Virtuella assistenter - Chatbots</li><li>Genetiska algoritmer</li><li>Swarm Intelligence</li><li>Känslo- och kommunikationsapekter för Metaverse</li><li>Gestigenkänning</li><li>Ansvarsfull AI, maskin-etik</li><li>Känslobaserat beslutsfattande</li></ul>",
            "Undervisnings- och arbetsformer": "<p>Föreläsningarna ägnas åt teorigenomgång av kursinnehållet. Studenterna kommer, enskilt eller i små grupper, att gå djupare i vissa utvalda moduler genom att genomföra en litteraturstudie och genom att implementera det inlärda konceptet i ett projektarbete. Studenterna ska presentera de inlärda koncepten (muntligt och skriftligt) på ett kritiskt sätt.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projektarbete</td><td>6 hp</td><td>U, G</td></tr></tbody></table><div><p>Anskaffningen av de färdigheter som förutses i denna kurs kommer att bedömas via projektarbetet och den muntliga och skriftliga presentationen då det verifierar att studenten kan designa och implementera ett AI-baserat projekt, och att studenten på ett kritiskt sätt förstår, presenterar och diskuterar de utmanande frågorna som uppstår under projektet. Det krävs också att studenterna aktivt deltar i de andra studenternas muntliga presentationer.</p><p>Projektet innehåller utveckling, presentation och skriftlig rapport.</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Tvågradig skala, U, G",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Bildteknik": {
            "Kurs": "TNM089",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Daniel Nyström",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": null,
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Linjär algebra, Matematisk statistik, Transformteori, Bildbehandling och bildanalys, Matlabprogrammering. Kunskaper om färgsystem och färgrymder, samt kännedom om objektiva kvalitetsmått för bildkvalitet.</p>",
            "Lärandemål": "<p>Kursen introducerar metoder inom “Computational Photography” som ligger i gränslandet mellan datorgrafik, datorseende och optik. Detta ämnesområde behandlar algoritmer och metoder som kombinerar traditionell signal- och bildbehandling med optiska system. Efter en fullgjord kurs förväntas studenten kunna:</p><ul><li>förklara och implementera tekniker och metoder för traditionellt digitalt foto.</li><li>redogöra för grundläggande metoder för signal- och bildbehandling av färg.</li><li>redogöra för faktorer som används för att beskriva och definiera bildkvalitet.</li><li>beskriva och implementera grundläggande multimodala bildmetoder, som t.ex. high-dynamic-range (HDR) tekniker.</li></ul>",
            "Kursinnehåll": "<p>Konventionella kameror, optik och sensorer. Signalbehandling nära sensorn: t.ex. “denoising”, ”demosaicing” och kvantisering. Digital representation av färg: vitpunktskorrigering och gamma-mapping. Multispektrala bilder och multikanalsbilder. Kalibrering och karakterisering av kameror och bildsystem. Multimodala bilder: “exposure bracketing” och “high dynamic range imaging” (HDR). Nya kameror och sensorer: överblick av nya och experimentella mätmetoder och tekniker för bildinfångning.</p>",
            "Undervisnings- och arbetsformer": "<p>Föreläsningar och laborationer, följt av en projektuppgift med muntlig och skriftlig redovisning. Projektuppgiften väljs av studenterna och syftar till att djupare studera, implementera och utvärdera metoder och tekniker inom något av kursens huvudområden.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projektarbete med muntlig och skriftlig redovisning</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Avancerad programvarudesign": {
            "Kurs": "TDDE45",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Adrian Pop",
            "Studierektor": "Martin Sjölund",
            "Undervisningstid": "Preliminär schemalagd tid: 40 h <br>Rekommenderad självstudietid: 120 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<ul>\n\t<li>Programutvecklingsmetodik (inkl. UML)</li>\n\t<li>Kunskaper i programmering i flera språk (inkl. objektorienterad programmering och hantering av pekare)</li>\n\t<li>Datastrukturer</li>\n\t<li>Kunna läsa forskningsartiklar inom programvarukonstruktion (software engineering) och söka information i nya ämnesområden självständigt och kritiskt</li>\n</ul>",
            "Lärandemål": "<p>Efter kursen ska studenten kunna:</p>\n\n<ul>\n\t<li>analysera struktur och organisation i ett större program</li>\n\t<li>kritiskt utvärdera designprinciper och -mönster i relation till önskvärda egenskaper hos program och gränssnitt</li>\n\t<li>konstruera program som hanterar internationalisering och lokalisering</li>\n\t<li>använda verktyg som hjälper användaren omstrukturera eller generera källkod</li>\n\t<li>tillämpa olika former av metaprogrammering</li>\n\t<li>tillämpa metoder och verktyg som hittar olika sorters problem i källkod både före och under körning av program, med till exempel parallel exekvering eller minnesläckor</li>\n</ul>",
            "Kursinnehåll": "<p>Designmönsters historia. Designmönster. Refactoring. Utvecklingsmiljöer. Generering av kod. Testbarhet. Domänspecifika språk. Metaprogrammering. Dependency injection. Ramverk och programmeringsgränssnitt. Felsöknings&nbsp;av minnesallokering och parallella program. Profilering.</p>",
            "Undervisnings- och arbetsformer": "<p>Studenterna behandlar föreläsningsmaterial på nätet och studerar kurslitteraturen som förberedelse för laborationer i par och seminarier i grupp, där frågor kring kurslitteraturen behandlas.</p>\n\n<p>Laborationerna har olika djup för de olika övningarna där vissa laborationer lär ut grundläggande kunskap eller teknik i&nbsp;en färdighet med viss handledning&nbsp;och andra laborationer används för att utveckla ett&nbsp;större program med mindre handledning.</p>\n\n<p>&nbsp;</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>DAT1</td><td>Datortentamen</td><td>2 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationer</td><td>3 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Uppgift</td><td>1 hp</td><td>U, G</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för datavetenskap",
            "Kurslitteratur": null
        },
        "Procedurell ljuddesign för användargränssnitt": {
            "Kurs": "TNM113",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Niklas Rönnberg",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 0 h <br>Rekommenderad självstudietid: 160 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Grundläggande kunskaper från kurser inom användargränssnitt, visualisering, och programmering, såväl som grundläggande ljudteknik och signalbehandling.</p>",
            "Lärandemål": "<p>Efter avslutad kurs ska studenten kunna:</p><ul><li>utförligt kunna redogöra för hur ljud bör användas i interaktionsdesign samt i relation till visualisering utifrån utifrån sonifierings- och kommunikationsteorier.</li><li>applicera kontemporära teorier för sonifiering och interaktionsdesign för att analysera och värdera ljud i användargränssnitt, visualisering och spel.</li><li>skapa och implementera procedurell ljuddesign för att effektivt förmedla ett budskap/intryck</li></ul>",
            "Kursinnehåll": "<p>Kursen syftar till att ge studenterna kunskap om ljud som kommunikationsform, principerna för att använda ljud i interaktionsdesign samt metoder för designa och skapa procedurellt ljud. Kortfattat är kursinnehållet: Ljud- och kommunikationsteori, ljuddesign, spelljud, sonifiering, ljudteknik, samt metoder för procedurellt ljud.</p>",
            "Undervisnings- och arbetsformer": "<p>Föreläsningar, laborationer, seminarier, projektarbete i par samt muntlig presentation</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationer</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPG1</td><td>Projektuppgift</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Slutbetyg på kursen är medelvärdet av LAB1 och UPG1.</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Avancerad visuell dataanalys": {
            "Kurs": "TNM098",
            "Huvudområde": "Datateknik, Datavetenskap, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Katerina Vrotsou",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": "Preliminär schemalagd tid: 48 h <br>Rekommenderad självstudietid: 112 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Färdigheter i matematik, programmering och webbprogrammering.&nbsp;</p><p>Kunskaper i informationsvisualisering via kursen Informationsvisualisering eller motsvarande.</p><p>Kunskaper och/eller intresse för data mining / maskininlärning är fördelaktigt men inte ett krav.</p>",
            "Lärandemål": "<p>Studenten skall efter avslutad kurs kunna</p><ul><li>Undersöka nya, komplexa datamängder och identifiera relevanta egenskaper som kan extraheras</li><li>Välja och tillämpa avancerade algoritmiska metoder för analys av stora komplexa datamängder för att bestämma värdefulla resultat</li><li>Visuellt presentera extraherad relevant information från sådana datamängder genom att använda state-of-the-art visualiseringsmetoder</li><li>Föreslå dataanalysmetoder som kombinerar interaktiv visualiseringsteknik med algoritmiska metoder.</li><li>Definiera och förklara visualiseringstekniker (avseende interaktion och visuell representation) och exempelverktyg för speciella datatyper och applikationsdomäner som diskuteras i kursen.</li><li>Göra välgrundade designval med hänsyn till givna uppgifter och databegränsningar.</li></ul><p>&nbsp;</p>",
            "Kursinnehåll": "<p>Kursen bygger vidare på kursen Informationsvisualisering, med fokus på datamodellering, utvinning och analystekniker vilka är grunden för den moderna visuella dataanalysmetodiken. Sådana metoder håller på att bli mycket viktiga eftersom omfattningen av tillgängliga data för analys expanderar, vilket leder till så kallade ”big data”-problem som påverkar företag, sjukvård, vetenskap och industri.</p><p>Ämnen som behandlas:</p><ul><li>Introduktion till området visuell dataanalys och relevanta begrepp, såsom visual analytics (VA), kunskapsgenereringsmodell för VA, human-in-the-loop och människocentrerad analys.</li><li>Dataaspekter som påverkar analys.</li><li>Visualiseringstekniker för rumslig, temporal, träd/nätverk, textdata och kombinationer av dessa.</li><li>Interaktionskoncept som främjar människocentrerad analys.</li><li>Översikt över tekniker för automatiskt analysstöd, såsom tekniker för abstraktion, jämförelse, mönsterupptäckt, dimensionsreduktion, textmining.</li></ul>",
            "Undervisnings- och arbetsformer": "<p>Kursen består av föreläsningar, laborationer, seminarietillfällen och ett omfattande projektarbete.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB2</td><td>Laborationer</td><td>1 hp</td><td>U, G</td></tr><tr><td>PRA1</td><td>Projektarbete</td><td>5 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Artificiell intelligens - principer och tekniker": {
            "Kurs": "TNM096",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Pierangelo Dellacqua",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 34 h <br>Rekommenderad självstudietid: 126 h",
            "Fördjupningsnivå": "G2F",
            "Rekommenderade förkunskaper": "<p>Programmering i ett imperativt programspråk. Kunskaper om datastrukturer och algoritmer.</p>",
            "Lärandemål": "<p>Kursen ska ge studenterna grundläggande kunskaper i artificiell intelligens. Kursen ska ge praktiska färdigheter i att designa och implementera intelligenta applikationer. Efter kursen ska studenten kunna:\n</p><ul>\n<li>förklara och diskutera begrepp inom artificiell intelligens\n</li><li>tillämpa välkända tekniker inom artificiell intelligens.\n</li></ul><p></p>",
            "Kursinnehåll": "<p>Översikt av artificiell intelligens. Oinformerad och informerad sökning och problem med begränsningstillfredsställelse. Kunskapsrepresentation och resonemang. Intelligenta agenter. Resonera med ofullständig kunskap och beslutsfattande under osäkerhet. Handlingsplanering.</p>",
            "Undervisnings- och arbetsformer": "<p>Föreläsningar och laborationer i Java eller i ett annat imperativt programspråk.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationer</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Modellering och animering": {
            "Kurs": "TNM079",
            "Huvudområde": "Datateknik, Datavetenskap, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Mark E Dieckmann",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 58 h <br>Rekommenderad självstudietid: 102 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "Datorgrafik, 3-D Datorgrafik och animering, Linjär algebra, Flervariabelanalys, Programmering",
            "Lärandemål": "<p>Kursen avser att ge kunskaper om aktuella och avancerade metoder inom datorgrafik för modellering och animering av virtuella objekt. Studenter lär sig:</p>\n\n<ul>\n\t<li>matematiska modeller vilka beskriva ytor i 3D.</li>\n\t<li>datastrukturer för ytor vilka består av triangler och hur man kan decimera den.</li>\n\t<li>metoder med vilka man kan förfina ytor.</li>\n\t<li>modellera ytor med level sets.</li>\n\t<li>\n\t<p>vätskemodeller</p>\n\t</li>\n</ul>",
            "Kursinnehåll": "<p>Modeller för ytor i 3D. Triangelnäta och deras förfining. Modellering av ytor med en implicit funktion. Level-set metoder. Indelningsytor. Vätskemodellering.</p>\n\n<p>&nbsp;</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen inleds med en föreläsningsserie som ger en överblick över området och belyser den aktuella teorin. Parallellt med föreläsningarna ges en laborationskurs med inlämningsuppgifter där teorin omsätts i praktik. Kursen avslutats med en skriftlig tentamen.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB4</td><td>Laborationer</td><td>4 hp</td><td>U, 3, 4, 5</td></tr><tr><td>TEN3</td><td>Skriftlig tentamen</td><td>2 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Avancerad webbprogrammering": {
            "Kurs": "TDDD27",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Erik Berglund",
            "Studierektor": "Jalal Maleki",
            "Undervisningstid": "Preliminär schemalagd tid: 40 h <br>Rekommenderad självstudietid: 120 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>God programmeringsförmåga och förmåga att arbeta med ramverk.&nbsp;<br>\nGod förståelse för hur HTML/CSS/Javascript utgör grunden för systemutveckling i webbläsaren.&nbsp;&nbsp;<br>\nGoda JavaScript kunskaper och kunskap om asynkron kommunikation med server och användning av ROUTS och JSON.&nbsp;&nbsp;<br>\nGod förståelse för webbens tekniker REST, microramverk som Flask och Express.js, integration av externa tjänster via REST-API.&nbsp;<br>\nFörmåga att bygga större webbaserade interaktiva system och till att självständig driva mjukvaruprojekt.</p>",
            "Lärandemål": "<p>Kursen syftar till att ge kunskaper om praktiska och begreppsmässiga aspekter av att skapa avancerade webbapplikationer. Efter genomgången kurs ska studenten kunna:</p><ul><li>Använda programmeringsteknologier och system relaterade till webbapplikationer och fleranvändarapplikationer</li><li>Planera och implementera ett medelstort programmeringsprojekt för 1-2 personer.</li><li>Redovisa projekt på webben</li></ul><p>&nbsp;</p>",
            "Kursinnehåll": "<p>Kursen omfattar utveckling av avancerade multianvändarsystem över webben<br>\nmed ett fokus på återanvädning av systemkomponenter och<br>\nprogrameringsbibliotek.</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen består av seminarier och projektarbete.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Seminarier och projekt</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för datavetenskap",
            "Kurslitteratur": null
        },
        "Bild- och ljudkompression": {
            "Kurs": "TSBK38",
            "Huvudområde": "Elektroteknik, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Harald Nautsch",
            "Studierektor": "Lasse Alfredsson",
            "Undervisningstid": "Preliminär schemalagd tid: 52 h <br>Rekommenderad självstudietid: 108 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Sannolikhetslära, grundläggande signalbehandling, grundläggande transformteori.</p>",
            "Lärandemål": "<p>Kursen ska ge kunskap om metoder för komprimering av data, samt hur dessa metoder tillämpas på ljud-, stillbilds- och videosignaler. Efter genomförd kurs förväntas studenten kunna</p><ul><li>Sätta upp stokastiska modeller för källor</li><li>Analysera stokastiska källmodeller</li><li>Förstå källkodningsmetoder som huffmankodning och aritmetisk kodning.</li><li>Förstå kvantisering.</li><li>Förstå linjär prediktiv kodning.</li><li>Förstå transformkodning.</li><li>Förstå delbandskodning.</li><li>Kunna beräkna prestanda för olika kodningsmetoder, givet stokastiska modeller för källorna.</li><li>Känna till hur olika kodningsmetoder används för komprimering av stillbilds-, video- och ljuddata.</li><li>Känna till vilka metoder som används i olika standarder (GIF, PNG, JPEG, MPEG, mp3, AAC, talkodning).</li></ul>",
            "Kursinnehåll": null,
            "Undervisnings- och arbetsformer": "<p>Undervisningen sker i form av föreläsningar, övningslektioner och laborationer. Alla föreläsningar är tillgängliga som förinspelade videor.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>4 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>En laborationskurs</td><td>2 hp</td><td>U, G</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": "<p>Kursen ges VT1 i Norrköping och VT2 i Linköping. Fyra tentamenstillfällen om året.</p>",
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för systemteknik",
            "Kurslitteratur": null
        },
        "Informationsvisualisering": {
            "Kurs": "TNM111",
            "Huvudområde": "Datateknik, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Andreas Kerren",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 51 h <br>Rekommenderad självstudietid: 109 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Programmering.&nbsp;</p><p>Kursen “Tillämpad visualisering och virtuell verklighet” samt färdigheter i visuell perception, webbprogrammering och datorgrafik rekommenderas men är inget krav.</p>",
            "Lärandemål": "<p>Studenten skall efter avslutad kurs kunna:</p><ul><li>Klassificera typiska uppgifter vid användning av visualiseringar inom olika domäner och sammanhang.</li><li>Definiera och förklara visualiseringstekniker (angående interaktion och visuell representation) och typiska verktyg som diskuteras i kursen.</li><li>Förklara validerings­ och utvärderingsmetoder för visualiseringsverktyg och metoder.</li><li>Representera data genom uttrycksfulla och effektiva visualiseringar med hjälp av metoder, programvara och verktyg.</li><li>Kritiskt reflektera över visualisering och interaktionsstrategier mot bakgrund av aktuella teorier och forskning.</li><li>Göra välgrundade designval baserat på olika aspekter och databegränsningar.</li></ul>",
            "Kursinnehåll": "<p>Informationsvisualisering fokuserar på abstrakt information som i de flesta fall inte kan kartläggas i den fysiska världen. Exempel på sådana abstrakta data är symboliska, tabulära, nätverksbaserade, hierarkiska eller textuella informationskällor. Kursen ger en översikt över de viktigaste informationsvisualiseringsteknikerna och applikationerna. Följande moment behandlas:</p><ul><li>Definition av området informationsvisualisering och hur det relaterar till områden som människa­datorinteraktion (HCI)&nbsp;och vetenskaplig visualisering</li><li>Grunderna i visualisering&nbsp;och data&nbsp;samt hur de kan bearbetas</li><li>Abstraktioner av data och taxonomier</li><li>Interaktionskoncept och tekniker (t.ex. dynamiska frågor, zoom och panorering</li><li>eller fokus och sammanhang)</li><li>Visualiseringstekniker för 1D, 2D, 3D och multidimensionella data</li><li>Visualiseringstekniker och ritkonventioner för träd/hierarkier, generella nätverksdata (grafer) och multivariata/dynamiska nätverk</li><li>Validera och utvärdera visualiseringar</li><li>Översikt över aktuella system och verktyg för informationsvisualisering&nbsp;</li></ul>",
            "Undervisnings- och arbetsformer": "<p>Kursen omfattar föreläsningar, teoretiska och praktiska (programmerings)uppgifter samt seminarietillfällen där inlämningsrapporter presenteras och diskuteras. Dessutom kommer vetenskapliga artiklar inom området att inkluderas som självstudiematerial.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Inlämningsuppgifter med muntlig och skriftlig presentation</td><td>3 hp</td><td>U, G</td></tr><tr><td>MUN1</td><td>Muntlig examination</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": "<p>Avancerad visuell dataanlys</p>",
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Strukturerade metoder för användarupplevelse (UX)": {
            "Kurs": "TNM100",
            "Huvudområde": "Datateknik, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Camilla Forsell",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": null,
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Kommunikation och användargränssnitt eller motsvarande.</p>",
            "Lärandemål": "<p>Kursen avser att ge kunskaper om och färdigheter i tekniker och metoder för att strukturerat modellera, specificera och analysera egenskaper hos system, samt verktyg och metoder för att säkerställa att systemegenskaper relaterade till användarupplevelse implementeras och bevaras under utvecklingsprocessen.<br>Efter avslutad kurs ska studenten kunna:</p><ul><li>Applicera strukturerade metoder och tekniker för att specificera, analysera, designa och utvärdera användarupplevelse (UX) i ett komplext system.</li><li>Följa samt redogöra för typiska processer och aktiviteter inom användarcentrerad systemutveckling (UCD).</li><li>Argumentera för val av metoder, tekniker och design samt presentera muntligt och skriftligt.</li><li>Kritiskt granska tillämpningar av teorier, metoder och tekniker vid design av användarupplevelse och kunna identifiera och analysera vetenskapligt underbyggda resultat.</li></ul><p>&nbsp;</p>",
            "Kursinnehåll": "<ul><li>Aspekter på användarupplevelser inom systemutveckling</li><li>Strukturerade&nbsp;metoder inom människa-datorinteraktion</li><li>Interaktionsdesign av komplexa system</li><li>Användbarhet, användarcentrerad design (UCD), användarupplevelse och design (UXD)</li></ul><p>&nbsp;</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen omfattar föreläsningar (vissa i seminarieform), övningar/laborationer samt tre inlämningsuppgifter. Inlämningsuppgifterna bestäms i samråd med lärare och&nbsp;rapporteras skriftligt.<br>&nbsp;</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG4</td><td>Grupparbete</td><td>2 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPG5</td><td>Grupparbete</td><td>2 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPG7</td><td>Grupparbete</td><td>2 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p><br>\nKursbetyg sätts genom sammanvägning av de tre betygsgrundande examinationsmomenten</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Bildreproduktion och bildkvalitet": {
            "Kurs": "TNM097",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Sasan Gooran",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": null,
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Kurser i Grafisk teknik&nbsp;och&nbsp;Bildbehandling och bildanalys. Grundläggande programmeringskunskaper i Matlab.</p>",
            "Lärandemål": "<p>Studenten skall efter genomgången kurs kunna:</p><ul><li>Redogöra för skillnader och egenskaper hos olika färgsystem och färgrymder, samt identifiera och motivera optimala val för olika tillämningar samt&nbsp;implementera de viktigaste modellerna (matematiska och fysikaliska) för färgprediktion.</li><li>Utföra kalibrering samt karakterisering av bildreproduktionsenheter för att säkerställa repeterbar och kontrollerbar färgreproduktion.</li><li>Beskriva och implementera matematiska och fysikalisk modeller för bildreproduktion, färgprediktion och färgseparation.</li><li>Identifiera och redogöra för de olika attribut som påverkar upplevd bildkvalitet samt utvärdera bildkvalitet hos reproducerade bilder genom att applicera modeller, inkl. modeller&nbsp;som inkluderar egenskaper hos vårt synsinne, för&nbsp;att beräkna&nbsp;objektiva kvalitetsmått.</li></ul>",
            "Kursinnehåll": "<ul><li>Bildreproduktion: Tekniska förutsättningar, begränsningar och möjligheter för olika tekniker inom modern bildreproduktion, för både elektroniska och konventionella medier. Översikt av det aktuella forskningsläget, inklusive exempelvis multikanalsdisplayer, flerkanalstryck och spektral bildreproduktion.</li><li>Bildkvalitet: Attribut som påverkar upplevd bildkvalitet hos olika reproduktionsmetoder. Modeller, baserade på det mänskliga synsinnet, för att beräkna objektiva kvalitetsmått.</li><li>Färgstyrning: Färgmätning, kalibrering och karakterisering av olika bildreproduktionsenheter.&nbsp;Färgrymder och färgsystem. Fysikaliska och matematiska modeller för färgprediktion och färgseparation.</li></ul>",
            "Undervisnings- och arbetsformer": "<p>Kursen består av föreläsningar och laborationer, följt av en större projektuppgift med muntlig och skriftlig redovisning.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>MUN1</td><td>Frivillig muntlig tentamen för högre betyg</td><td>0 hp</td><td>U, 3, 4, 5</td></tr><tr><td>PRA1</td><td>Projektarbete</td><td>4.5 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationer</td><td>1.5 hp</td><td>U, G</td></tr></tbody></table><div><p>För att erhålla betyget 5 krävs, förutom en väl godkänd projektuppgift, en enskild muntlig tentamen där studenten diskuterar sin projektlösning i kontext av kursens teoretiska innehåll.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": null,
            "Kurslitteratur": null
        },
        "Retorik i tal, text och bild": {
            "Kurs": "TNKA10",
            "Huvudområde": "Grafisk design och kommunikation",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Maria Thunborg",
            "Studierektor": "Birgitte Saxtrup Hermansson",
            "Undervisningstid": null,
            "Fördjupningsnivå": "G1F",
            "Rekommenderade förkunskaper": null,
            "Lärandemål": "<p>Efter avslutad kurs ska den studerande kunna:</p>\n\n<p>- tillämpa olika former av retoriska grepp och färdigheter i givna scenarier.</p>\n\n<p>- muntligt och skriftligt beskriva och analysera retorik med ett visst syfte och i en given kontext.</p>\n\n<p>- muntligt presentera och motivera val av språklig form och framställningssätt ur ett retoriskt perspektiv.</p>\n\n<p>- redogöra för olika bildmedias visuella retorik.</p>\n\n<p>- kunna presentera och argumentera för olika retoriska grepp inom visuell argumentation.</p>",
            "Kursinnehåll": "<p>Kursen består av två delar, en del som behandlar grunderna i praktisk muntlig retorik och en del som behandlar det visuella.&nbsp;</p>\n\n<p>Delkurs ett behandlar grunderna i retorik i olika former, med särskilt fokus på presentation och argumentation i arbetslivskontext. I denna del ingår också muntlig presentation med analys.</p>\n\n<p>Delkurs två behandlar historiska och teoretiska perspektiv på visuell kommunikation utifrån ett bildretoriskt perspektiv.</p>",
            "Undervisnings- och arbetsformer": "<p>Föreläsningar, seminarier, individuellt arbete samt grupparbete.</p>\n\n<p>För GDK är sista&nbsp;delen av kursen på heltid under de två första veckorna i VT2. För övriga program gäller vanlig schemaläggning i VT2.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG2</td><td>Seminarier och skriftlig uppgift</td><td>3 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Muntliga presentationer och skriftlig utvärdering</td><td>3 hp</td><td>U, G</td></tr></tbody></table><div><p>På kursen ges betyget Godkänd och Underkänd.</p>\n\n<p>Kursen examineras genom skriftliga och muntliga uppgifter samt aktivt deltagande vid seminarier.</p>\n\n<p>&nbsp;</p>\n <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Tvågradig skala, äldre version, U, G",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för kultur och samhälle",
            "Kurslitteratur": null
        },
        "Interkulturell kompetens och interkulturell kommunikation, fortsättningskurs": {
            "Kurs": "TINT02",
            "Huvudområde": "Inget huvudområde",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": null,
            "Examinator": "Christoph Röcklinsberg",
            "Studierektor": "Olle Linge",
            "Undervisningstid": null,
            "Fördjupningsnivå": "G2F",
            "Rekommenderade förkunskaper": null,
            "Lärandemål": "<ul><li>Redogöra för kulturella, kommunikativa och kontrastiva studier inom interkulturell kommunikation</li><li>Kritisk analysera kulturella skillnader från olika kulturella regioner i världen</li><li>Redogöra och kritisk analysera kulturella och språkliga skillnader i olika språk- och kulturområden utifrån teoretiska modeller</li><li>Analysera utifrån det antropologiska kulturbegreppet konkreta utformningar på t.ex. organisationer, reklam eller andra konkreta och praktiska exempel.</li></ul>",
            "Kursinnehåll": "<ul><li>Teorier och begrepp inom olika kulturella och kommunikativa teorier och modeller</li><li>Enkla och multidimensionella modeller för kulturell analys</li><li>Fördjupning och reflektion över olika språk- och kulturområden runtom i världen</li><li>Analys av de egna erfarenheterna från utlandsåret</li><li>Kulturens struktur och effekt på kommunikation</li><li>Kulturens inverkan inom olika affärsområden samt t ex på organisationer och marknadsföring, m.m.</li><li>Olika exempel och belysning av olika kulturella mönster inom olika regioner i världen ur ett kulturkontrastivt perspektiv</li></ul>",
            "Undervisnings- och arbetsformer": "<p>Undervisning sker genom föreläsningar och seminarier på plats på campus. Enstaka föreläsningar kan dock hållas på distans. De grundläggande teoretiska föreläsningarna om kultur och kommunikation exemplifieras och intensifieras med olika experter från olika kulturområden (Native Speaker) som föreläser och leder grupparbeten.</p><p>Projektarbetet väljs och skrivs individuellt eller i par utifrån ett kultur- och/eller kommunikationsteoretiskt perspektiv (etnocentrism, olika kulturmodeller, interaktionsmodeller eller en kombination av dessa) eller ur ett kulturkontrastivt perspektiv. Projektarbeten kan även skrivas ur ett tillämpad perspektiv där den kulturella påverkan såsom i organisationer, marknadsföring, företagskulturen etc. behandlas och analyseras.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projektarbete med muntlig presentation och opposition</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPG1</td><td>Individuell skriftlig analys samt ventilation i grupp</td><td>2 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPG2</td><td>Inlämningsuppgifter samt aktivt deltagande i seminarier</td><td>1 hp</td><td>U, G</td></tr></tbody></table><div><p>För slutbetyg på kursen krävs att samtliga moment är godkända. Kursbetyget baseras på genomsnittet på betygen på PRA1 och UPG1. Medelvärdet av betygen avrundas uppåt.&nbsp;</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för ekonomisk och industriell utveckling",
            "Kurslitteratur": null
        },
        "Industriell ekonomi": {
            "Kurs": "TEIE53",
            "Huvudområde": "Industriell ekonomi",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Harald Brege",
            "Studierektor": "Daniel Ellström",
            "Undervisningstid": null,
            "Fördjupningsnivå": "G1N",
            "Rekommenderade förkunskaper": "<p>Matematisk grundkurs För FL, SL: Matematik</p>",
            "Lärandemål": "<p>Kursen syftar till att ge studenterna en helhetssyn av hur företag fungerar och styrs. Mer specifikt skall deltagaren efter genomgången kurs kunna:</p><ul><li>Förklara&nbsp;och tillämpa&nbsp;centrala begrepp och verktyg inom industriell ekonomi</li><li>Analysera&nbsp;industriföretag och deras omvärld ur ett företagsekonomiskt perspektiv</li><li>Diskutera kring grundläggande analyser av företag och deras ekonomi</li></ul><p>&nbsp;</p>",
            "Kursinnehåll": "<p>Kursens syfte är att ge studenterna kunskap och förståelse om hur företag fungerar och fattar beslut, med speciellt fokus på industriella företag (företag som ofta tillverkar produkter och säljer till andra företag). Kursen ger studenterna en orientering i de sammanhang företag verkar, hur företag sätter priser, hur företag bokför och redovisar, och hur företag kan analyseras från perspektiv såsom nyckeltal eller hållbarhet.&nbsp;</p><ul><li>Företaget och dess omvärld&nbsp;</li><li>Kostnads- och intäktsbegrepp</li><li>Produktkalkylering</li><li>Investeringskalkylering&nbsp;</li><li>Affärs- och hållbarhetsredovisning&nbsp;</li><li>Budgetering</li><li>Kassaflödesanalys</li><li>Räkenskapsanalys</li></ul>",
            "Undervisnings- och arbetsformer": "<p>Föreläsningarna ger bakgrund till ekonomiska villkor för både företag och samhälle. Lektioner och seminarium ägnas åt problemlösning och praktikfallsdiskussioner. I kursen ingår ett projektarbete som utgör en analys av ett existerande företag alt. analys ur ett samhällsekonomiskt perspektiv.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationer</td><td>1 hp</td><td>U, G</td></tr><tr><td>PRA2</td><td>Projektuppgift som genomförs i grupp</td><td>2 hp</td><td>U, G</td></tr><tr><td>TEN2</td><td>Skriftlig tentamen</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för ekonomisk och industriell utveckling",
            "Kurslitteratur": null
        },
        "Medieproduktion för immersiva miljöer": {
            "Kurs": "TNM091",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Karljohan Lundin Palmerius",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 42 h <br>Rekommenderad självstudietid: 118 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Programmeringskunskaper i C++. Linjär algebra. Erfarenhet av 3D datorgrafik.</p><p>Fördelaktigt men inte ett krav: grundläggande ljudfysik och videoproduktion.</p>",
            "Lärandemål": "<p>Efter genomgången kurs ska studenten:</p><ul><li>&nbsp;kunna använda verktyg för att producera och hantera immersiva bilder, video och ljud samt programmera immersiv realtidsrendering,</li><li>&nbsp;kunna självständigt eller i grupp planera, producera och presentera immersiva medieproduktioner där tekniken utnyttjas på ett effektivt sätt för att framföra ett budskap, samt</li><li>&nbsp;kunna kritiskt såväl som professionellt analysera och reflektera över existerande teknik och praxis för produktion inom området</li></ul><p>&nbsp;</p>",
            "Kursinnehåll": "<p>I kursen studerar och utforskar vi de tekniska och artistiska villkoren vid medieproduktion för immersiva miljöer som VR-glasögon, domdisplayer, VR-kuber och krökta panoramadisplayer. Sådana miljöer erbjuder stora möjligheter att skapa spännande och ovanliga medieformer, men det innebär också både krav på speciella tekniska lösningar och ställer särskilda utmaningar för att designa och skapa innehållet.</p>\n\n<p>Kursen baseras på konkret användning av tekniskt avancerad medieteknik, så som kombinationer av (stereo)video, datorgrafik (interaktiv och förrenderad), immersivt ljud samt eventuella andra medier som är lämpliga för presentationen.</p>",
            "Undervisnings- och arbetsformer": "<p>Några föreläsningar ges för att presentera principer och teknik för immersiva medier och produktion, samt att föreslå inriktning och angreppssätt för medieproduktionen. Några laborationer&nbsp; ges för att bekanta deltagarna med utrustningen och några grundläggande produktionstekniker. Kursens huvudsakliga fokus ligger dock på studentens egen inlärning och projektarbete i grupp.</p>\n\n<p>&nbsp;</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projekt</td><td>5 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationer</td><td>1 hp</td><td>U, G</td></tr></tbody></table><div><p>Examinationen baseras på deltagande i de olika stegen i produktionsprocessen och studentens individuella bidrag, samt en bedömning av slutresultatet av projektet.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": "<p>Kurser i VR-teknik och&nbsp;Struktuerade metoder för användarupplevelse (UX) kompletterar denna kurs.</p>\n\n<p>&nbsp;</p>",
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Utvidgad verklighet (XR) - principer och programmering": {
            "Kurs": "TNM116",
            "Huvudområde": "Informationsteknologi, Datateknik, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Karljohan Lundin Palmerius",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 0 h <br>Rekommenderad självstudietid: 160 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>3D-datorgrafik, linjär algebra, programmering C++</p>",
            "Lärandemål": "<p>Målet med kursen är att studenterna skall få insikt om XR, VR, AR och andra relaterade principer, hur det används och hur det kan implementeras och utnyttjas. De skall även lära sig analysera behov och utmaningar, och lära sig att tillämpa teorier och principer för att realisera effektiva immersiva gränssnitt och interaktion.</p><p>Efter avslutad kurs ska studenten kunna</p><ul><li>redogöra för principer för XR med avseende på<ul><li>mänskliga faktorer såsom perception, sociala aspekter och genus</li><li>visuella och multisensoriska display-system, tracking och annan interaktionsutrustning</li><li>egocentrisk interaktion och haptik</li><li>ljud och ljudinteraktion</li></ul></li><li>skapa interaktiva, immersiva tillämpningar<br>&nbsp;</li></ul>",
            "Kursinnehåll": "<p>Kursen täcker ett brett område med olika aspekter associerade med utvidgad verklighet (eXtended Reality - XR), en samlingsterm för immersiva tillämpningar med virtuellt innehåll, såsom virtuell verklighet (Virtual Reality - VR), förstärkt verklighet (Augmented Reality - AR), blandad verklighet (Mixed Reality - MR) samt förstärkt virtualitet (Augmented Virtuality). Vi går igenom displaysystem och dess principer, från desktop till storskaliga VR-teatrar och domer, principer för effektiv implementation, metoder för interaktion och hur ljud och känsel används för att skapa en övertygande och användbar immersiv miljö för en rad olika tillämpningar.</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen ges på Campus Norrköping men stora delar kan vid behov läsas på distans. Närvaro krävs för laboration med VR-utrustning samt examination av laboration med VR-utrustning.</p><p>Teoretisk genomgång sker via föreläsningar som kompletteras med vetenskapliga publikationer för ytterligare fördjupning. Substantiellt med laboratoriearbete inkluderas också, där teorin omvandlas till praktik. Studenter som läser kursen ges tillgång till VR-laboratoriet och dess utrustning.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>MUN1</td><td>Muntlig examination</td><td>2 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationer</td><td>4 hp</td><td>U, G</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": null,
            "Kurslitteratur": null
        },
        "Grafisk design och kommunikation": {
            "Kurs": "TNM110",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Cory Robinson",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": null,
            "Fördjupningsnivå": "G2F",
            "Rekommenderade förkunskaper": "<p>Kommunikation och användargränssnitt, Grafisk teknik</p>",
            "Lärandemål": "<p>Kursens syfte är att fördjupa förståelsen för den kreativa designprocessen i tryckta och digitala medier samt betydelsen av målgruppsanpassad kommunikation. Studenten skall efter avslutad kurs:</p><ul><li>Förstå processen vid framtagande av trycksaker</li><li>Känna till hur målgrupper definieras</li><li>Förstå betydelsen av målgruppsanpassad kommunikation</li><li>Ha kunskap om varumärkeskommunikation</li><li>Kunna producera trycksaker för ett givet varumärke mot en given målgrupp</li></ul>",
            "Kursinnehåll": "<p>Marknadskommunikation. Visuell kommunikation i ett marknadsperspektiv. Inlämningsuppgift i form av att producera en trycksak för marknadskommunikation.</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen består av föreläsningar, laborationer och en inlämningsuppgift i projektform.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN1</td><td>Skriftlig tentamen för höjning av slutbetyget med ett steg</td><td>0 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPG2</td><td>Inlämningsuppgifter, kan ge betyg 3 eller 4</td><td>4.5 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB2</td><td>Laborationskurs</td><td>1.5 hp</td><td>U, G</td></tr></tbody></table><div><p>För höjning av betyg från projektinlämning krävs även skriftlig tenta</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Procedurella metoder för bilder": {
            "Kurs": "TNM084",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Ingemar Ragnemalm",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": "Preliminär schemalagd tid: 44 h <br>Rekommenderad självstudietid: 116 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "En- och flervariabelanalys samt linjär algebra. Goda kunskaper i datorgrafik. Programmeringskunskaper, objektorienterad\nprogrammering, datastrukturer och algoritmer. Kunskaper  i bildbehandling och bildanalys är önskvärt och nyttigt, men inte ett krav.",
            "Lärandemål": "<p>Studenten skall efter genomgången kurs kunna:</p><ul><li>Mål 1: redogöra för bilder och geometrier som verktyg inom modern datorgrafik.</li><li>Mål 2: redogöra för klassiska och moderna metoder för procedurell generering av bilder, speciellt texturer som avser att efterlikna komplicerade och visuellt detaljerade fenomen i naturen.</li><li>Mål 3: kunna använda generella och speciella programspråk för att generera bilder och vissa typer av geometri</li><li>Mål 4: kunna beskriva och implementera ett urval av klassiska metoder för procedurell generering av mönster.</li><li>Mål 5: utföra ett projekt som löser ett verkligt problem som är formulerat i termer av önskat visuellt resultat, där studenten skall kunna välja, motivera, genomföra, beskriva och i någon mån utvärdera en egen lösning baserad på existerande, publicerade metoder.</li></ul>",
            "Kursinnehåll": "<p>Principen för procedurella bilder, deras användning, fördelar och nackdelar vid texturering. Texturer i 2, 3 och 4 dimensioner. Regelbundna och oregelbundna mönster. Slumptalsgenerering. Brusfunktioner, speciellt \"Perlin noise\" och dess släktingar (lattice noises). Multifraktal syntes och simulering av turbulens. Metoder för animerade bilder. Fraktaler. Splines. Fractal Brownian Motion. Direkt Fouriersyntes.<br>Programmering i generella programspråk för procedurella bilder. Shadingspråk. Funktioner för textursyntes och geometrisyntes i modern grafikhårdvara.</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen omfattar föreläsningar, programmeringsinriktade laborationer samt en projektuppgift. Projektuppgiften väljs relativt fritt i samråd med examinator. Den utförs individuellt eller i grupp beroende på antal kursdeltagare och kursdeltagarens preferens. Detta görs självständigt med viss handledning, samt avrapporteras skriftligt och muntligt för bedömning.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationskurs</td><td>3 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Individuell projektuppgift</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Avancerad bildbehandling": {
            "Kurs": "TNM034",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Daniel Nyström",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": "Preliminär schemalagd tid: 34 h <br>Rekommenderad självstudietid: 126 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Bildbehandling och bildanalys. Programmeringskunskaper i Matlab.</p>",
            "Lärandemål": "<p>Kursen avser att ge de studerande avancerade kunskaper i bildbehandling och bildanalys, med koppling till forskning inom området. Efter genomgången kurs ska studenterna kunna:</p><ul><li>tillgodogöra sig innehållet i forskningsartiklar inom bildbehandling och bildanalys och applicera kunskapen i relevanta tillämpningar.</li><li>identifiera och implementera relevanta lösningsmetoder i ett projekt av forskningskaraktär.</li><li>använda matematiska uttryck och modern terminologi inom bildbehandling och bildanalys genom skriftlig presentation av teori, metoder och implementation i en rapport.</li></ul><p>&nbsp;</p>",
            "Kursinnehåll": "<p>Avancerade metoder för bildbehandling och bildanalys som ansluter till den aktuella projektuppgiften, vilken varierar mellan olika kursomgångar.</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen består av inledande föreläsningar, följt av en större projektuppgift. Projektarbetet består i att lösa en given uppgift inom bildbehandling och bildanalys, i grupper om 2 till 4 studenter. Tillfällen som schemaläggs som laboration avser regelbunden projekthandledning.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Projektarbete</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Projektet dokumenteras i en rapport innehållande teori, metod och beskrivning av implementation och resultat. Kravet för betyg 3 är: godkänd projektrapport samt fungerande projektlösning i enklare tester, enligt kriterier som meddelas vid kursstart. För betyg 4 krävs fungerande lösning i mer avancerade tester, enligt givna kriterier. För att erhålla betyg 5 krävs, utöver kriterierna för betyg 4, en enskild muntlig tentamen där studenten redogör för sin projektlösning och relaterar den till alternativa lösningar.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": "<p>Kurser i Bildreproduktion och bildkvalitet och Bildteknik kompletterar denna kurs.</p>",
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Matrismetoder för AI": {
            "Kurs": "TNA010",
            "Huvudområde": "Matematik, Tillämpad matematik",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Berkant Savas",
            "Studierektor": "George Baravdish",
            "Undervisningstid": "Preliminär schemalagd tid: 40 h <br>Rekommenderad självstudietid: 120 h",
            "Fördjupningsnivå": "G2F",
            "Rekommenderade förkunskaper": "<p>Linjär algebra, flervariabelanalys, matematisk statistik, tillämpad matematik, grundläggande kunskaper i MATLAB.</p>",
            "Lärandemål": "<p>Kursen syftar till att ge praktiska och teoretiska kunskaper om matrismetoder som används för att lösa problem inom artificiell intelligens. En viktig aspekt av kursen är att behandla ett flertal specifika tillämpningsproblem i projektform och därigenom motivera, belysa och introducera matematisk teori kopplat till matriser och matrisberäkningar. Efter avslutat kurs skall kursdeltagaren uppnått följande mål.</p><ul><li>Ha kunskap om hur vektorer och matriser används inom AI-tillämpningar.</li><li>Känna till viktiga koncept vid lösning av linjära ekvationssystem och minstakvadratproblem.&nbsp;</li><li>Använda olika matrisfaktoriseringar (LU-, QR- och SVD-faktorisering) för att lösa praktiska och teoretiska problem.</li><li>Känna till principerna för klustring och grafpartitionering, samt använda sådana metoder för att lösa praktiska problem.</li><li>Ha kunskap om tensorer och tensorfaktoriseringar, samt använda sådana metoder för att lösa praktiska problem.</li><li>Ha kunskap om icke-negativa matrisfaktoriseringar, samt använda sådana metoder för att lösa praktiska problem.&nbsp;</li><li>Ha kunskap om felkällor i datorberäkningar, hur fel propagerar i beräkningar.</li><li>Känna till kancellation och hur den kan undvikas.</li><li>Kunna resonera kring, tolka och genomföra enkel känslighetsanalys.</li><li>Ha kunskap om datoraritmetik och hur hårdvara och minneshierarki påverkar effektiviteten i datorprogram.<br><br>&nbsp;</li></ul>",
            "Kursinnehåll": "<p>Vektorer och matriser inom AI-tillämpningar, matristeori och matrisberäkningar, lösning av linjära ekvationssystem och minstakvadratproblem, matrisfaktoriseringar, LU-faktorisering, QR-faktorisering, egenvärden och egenvektorer, singulärvärdesfaktorisering (SVD), singulära värden och singulära vektorer, tensorer, klustring och grafpartitionering, icke-negativa matrisfaktoriseringar. Projektarbete i grupp där metod och teori används för att lösa ett tillämpningsproblem inom informationsteknologi, t.ex., klassificering av handskrivna siffror, text-mining för dokumentsökning, Page Rank för sökning i webbsidor, automatisk extrahering av nyckelord och nyckelmeningar, ansiktsigenkänning. Kursen introducerar även felanalys, känslighetsanalys, konditionstal, minneshierarki, design av programvara för beräkningar.</p>",
            "Undervisnings- och arbetsformer": "<p>Undervisningen består av föreläsningar, datorlaborationer, och öppna seminarier. På föreläsningarna presenteras valda delar från kurslitteraturen. På datorlaborationerna ges handledning kopplat till implementering av tillämpningsprojekt. På de öppna seminarierna diskuteras frågor som studenterna förbereder och tar upp. Inlämningsuppgifter görs individuellt.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Implementering och redovisning av tillämpningsprojekt</td><td>4 hp</td><td>U, G</td></tr><tr><td>UPG2</td><td>Inlämningsuppgifter</td><td>2 hp</td><td>U, G</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Tvågradig skala, U, G",
            "Övrig information": null,
            "Påbyggnadskurser": "<p>Artificiell intelligens för interaktiv media</p>",
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Immaterialrätt": {
            "Kurs": "TEAE11",
            "Huvudområde": "Inget huvudområde",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Kalle Ahlqvist",
            "Studierektor": "Johannes Lerm",
            "Undervisningstid": null,
            "Fördjupningsnivå": "G1N",
            "Rekommenderade förkunskaper": null,
            "Lärandemål": "<p>Kursen syftar till att den studerande skall tillägna sig goda kunskaper om immaterialrätt och marknadsrätt. Den studerande skall erhålla goda kunskaper om vad som krävs för att lagligt skyddad ensamrätt skall uppnås/föreligga samt skapa sig förståelse för immaterialrättsliga reglers roll i en marknadsekonomi. Den studerande skall även förvärva god förmåga att identifiera, analysera och lösa praktiskt inriktade problemställningar inom de angivna rättsområdena.<br>\nEfter slutförd kurs skall den studerande kunna</p>\n\n<ul>\n\t<li>visa övergripande kännedom om immaterialrätt och marknadsförings- samt konkurrensrätt på nationell och EU-rättslig nivå, samt hur reglerna samverkar och påverkar relationen mellan marknadens aktörer och deras handlingsutrymme,</li>\n\t<li>visa övergripande färdighet i lagtolkning, rättsfallsanalys och rättstillämpning avseende ovan nämnda rättsområden,</li>\n\t<li>identifiera, analysera och lösa praktiskt inriktade juridiska problem inom de angivna rättsområden,</li>\n\t<li>reflektera över slutsatser avseende resultat från såväl lagtolkning och rättsfallsanalys som rättstillämpning, samt reflektera över nämnda reglers samspel.&nbsp;</li>\n</ul>",
            "Kursinnehåll": "<p>Kursens tyngdpunkt kommer att ligga på just immaterialrätten, men även marknadsrättsliga regler som avser att förhindra otillbörlig konkurrens samt konkurrensrätt kommer att behandlas.<br>\nImmateriella rättigheter är bl.a. upphovs-, mönster-, varumärkes- och patenträtt. Immaterialrätten är till sin natur internationell varför framförallt EU-rättslig men även viss internationell reglering kommer att behandlas. Vidare görs en översikt över problemen med internationella tvister och jurisdiktionsfrågor.</p>",
            "Undervisnings- och arbetsformer": "<p>Undervisningen sker i form av föreläsningar och övningar.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>DIT1</td><td>Digital salstentamen</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för ekonomisk och industriell utveckling",
            "Kurslitteratur": null
        },
        "Maskininlärning för sociala medier": {
            "Kurs": "TNM108",
            "Huvudområde": "Datateknik, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Pierangelo Dellacqua",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": "Preliminär schemalagd tid: 0 h <br>Rekommenderad självstudietid: 160 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Sannolikhetslära och statistik, matematisk analys, linjär algebra och grundläggande programmering.</p>",
            "Lärandemål": "<p>Kursens övergripande mål är att ge kunskap om maskininlärning i en kontext av analys av data från sociala medier.</p><p>Efter avslutad kurs skall den studerande kunna:</p><ul><li>använda maskininlärningstekniker för att formulera och lösa praktiska problem</li><li>utvärdera och välja mellan maskininlärningsmodeller</li><li>använda maskininlärningsmodeller för prediktion och beslutsfattande</li><li>implementera maskininlärningsmodeller och algoritmer i ett programmeringsspråk</li><li>använda grundläggande metoder för att extrahera information and hämta textbaserad social data</li><li>använda tekniker för textbearbetning och förbereda dokument för statistisk modellering</li><li>använda relevanta använda maskininlärningsmodeller&nbsp; för analys av textuell data och korrekt tolkning av resultat</li><li>grundläggande concept och mer avancerade tekniker för att producera rekommendationer</li><li>demonstrera kunskap av grundläggande koncept i grafteori och informationsflöde</li></ul>",
            "Kursinnehåll": "<p>Översikt av maskininlärningsområdet och dess tillämpningsområden. Maskininlärningsalgoritmer som används inom sociala medier. Textutvinning, natural language processing&nbsp;, sentiment analysis, recommender systems, aspekter inom sociologi (graf teori, informationsflöde)</p>",
            "Undervisnings- och arbetsformer": "<p>Undervisningen består av föreläsningar och datorlaborationer. Föreläsningar används för att introducera begrepp och teori som studenterna sedan använder i praktisk problemlösning vid datorlaborationer. Under kursens gång genomförs också ett projektarbete.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projektarbete</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationer</td><td>3 hp</td><td>U, G</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": null,
            "Kurslitteratur": null
        },
        "Ljudteknik": {
            "Kurs": "TNM103",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Niklas Rönnberg",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": null,
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Kunskaper från kurser som Signaler och system, Tillämpad transformteori, Ljudfysik, eller motsvarande. Programmeringskunskaper, motsvarande Programmering grk.</p>",
            "Lärandemål": "<p>Ljudteknik av analog och digital karaktär är idag en viktig del i många olika medieproduktioner, från datorspel och immersiv medieproduktion via användargränssnitt till renodlad ljud- och musikredigering. Kursen syftar till att ge studenterna fördjupade kunskaper om metoder för ljudteknik, audioeffekter och signalbehandling, samt bearbetning, analys och syntes av ljud och vågformer. Studenten ska efter genomgången kurs kunna tillämpa kunskaper om design av analoga och digitala signalbehandlingstillämpningar för exempelvis professionell audio, musikproduktion, film, spel och virtuella miljöer, samt visualisering och forensiskt arbete.</p>",
            "Kursinnehåll": "<p>Introduktion till digital audio, ljud- och musikbearbetning. Översikt över tekniker för signalbehandling och audioeffekter. Förändring av dynamiskt innehåll i en signal som kompression respektive expansion. Filtrering och utjämning av signaler, olika användningsområden för filter, olika typer av filter. Digitala fördröjningsledningar samt analoga alternativ för simulering av rumsakustik och eko. Digitala och analoga audioeffekter (som exempelvis wha-wha, phaser, flanger). Fas-vocodning för tonhöjds- och tempoförändring av en signal. Additiv och subtraktiv syntes, samt analoga och digitala syntesmetoder. Amplitud- och frekvensmodulering av signaler.</p>\n\n<p>&nbsp;</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen omfattar föreläsningar, föreläsningar/seminarier givna av studenten själv, samt programmeringsinriktade och praktiskt ljudtekniska laborationer. En skriftlig tentamen i form av en hemtentamen, som utförs under begränsad mängd tid och går ut på att i skrift redogöra för hur en specifik signalbehandlingsuppgift skulle kunna lösas.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationer</td><td>3 hp</td><td>U, G</td></tr><tr><td>HEM1</td><td>Hemtentamen</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Vetenskaplig visualisering": {
            "Kurs": "TNM067",
            "Huvudområde": "Informationsteknologi, Datateknik, Datavetenskap, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Ingrid Hotz",
            "Studierektor": "Camilla Forsell",
            "Undervisningstid": "Preliminär schemalagd tid: 48 h <br>Rekommenderad självstudietid: 112 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "<p>Datorgrafik, Fysikaliska modeller</p>",
            "Lärandemål": "<p>Kursen syftar till att ge fördjupade insikter i metoder för visualisering av vetenskapliga data från experiment och beräkningar samt genom programmeringsövningar belysa dessa metoders möjligheter och begränsningar. Kunskaperna som inhämtas är användbara i en rad existerande och nya tillämpningar inom näringsliv och samhälle, men kan också ligga till grund för forsknings- och utvecklingsarbete inom vetenskaplig visualisering både inom universitet och specialiserade företag.<br>\nEfter kursen skall studenten kunna:</p>\n\n<ul>\n\t<li>Utifrån ett dataset välja en lämplig visualiseringsmetod.</li>\n\t<li>Med hjälp av tillgängliga mjukvarubibliotek implementera den valda metoden i ett användbart visualiseringsverktyg.</li>\n\t<li>Läsa och redogöra för innehåll i vetenskapliga artiklar inom området.</li>\n</ul>\n\n<p>&nbsp;</p>",
            "Kursinnehåll": "<ul>\n\t<li>\n\t<p>Introduktion till visualisering: visualisering som forskningsfält, applikationer, uppgifter</p>\n\t</li>\n\t<li>Visualiseringspipeline</li>\n\t<li>Datarepresentation och interpolation:\n\t<ul>\n\t\t<li>Grundläggande datatyper: skalär-, vektor- och tensordata</li>\n\t\t<li>Strukturerade och ostrukturerade data</li>\n\t</ul>\n\t</li>\n\t<li>Grundläggande visualiseringsalgoritmer\n\t<ul>\n\t\t<li>för skalärfält, exempelvis avbildning via färg, konturlinjer och ytor</li>\n\t\t<li>för vektorfält, exempelvis flödeslinjer och flödesytor samt tidsanimationer av dessa</li>\n\t\t<li>för tensorfält, exempelvis glyfer, tensorlinjer</li>\n\t</ul>\n\t</li>\n\t<li>Översikt över tekniker för volymsrendrering&nbsp;</li>\n\t<li>Introduktion till koncept för mer avancerad dataanalys\n\t<ul>\n\t\t<li>datautforskning</li>\n\t\t<li>detektion och avbildning av egenskaper</li>\n\t\t<li>topologiska metoder</li>\n\t</ul>\n\t</li>\n\t<li>Exempel på applikationsspecifika visualiseringstekniker</li>\n</ul>",
            "Undervisnings- och arbetsformer": "<p>Kursen omfattar föreläsningar och laborationer. Dessutom kommer vetenskapliga artiklar inom området att inkluderas som självstudiematerial.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>MUN1</td><td>Muntlig examination</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationskurs</td><td>3 hp</td><td>U, G</td></tr></tbody></table>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Nätverksprogrammering och säkerhet": {
            "Kurs": "TNM031",
            "Huvudområde": "Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Pierangelo Dellacqua",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 44 h <br>Rekommenderad självstudietid: 116 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "Internetteknik och digitala bilder, algoritmer och datastrukturer",
            "Lärandemål": "<p>Kursen ska ge studenterna grundläggande men ändå fundamentala kunskaper i nätverk och säkerhet. Kursen ska ge praktisks färdigheter i att designa, analysera och implementera säkra applikationer.\nEfter kursen ska studenten kunna: \n</p><ul>\n<li>diskutera olika typer av attacker och försvar.\n</li><li>redogöra för internetprotokollen IP, TCP, UDP och ICMP, och deras säkerhets implikationer.\n</li><li>beskriva typiska steg i inbrottsattacker, denial-of-service (DoS) attacker och malwareattacker.\n</li><li>formulera grundläggande kryptografiska begrepp såsom symmetriska och offentliga key encryption, digitala certifikat för verifiering av meddelande och offentlig nyckel infrastruktur.\n</li><li>redogöra för det kryptograpfiska systemet SSL/TLS och Javas secure-socket extension (JSSE).\n</li><li>beskriva de grundläggande filtreringsoperationer hos brandvägar och vanliga brandvägsarkitekturer.\n</li></ul><p></p>",
            "Kursinnehåll": "<p>Översikt över datornät och Internet. Protokoll och nivåer. Klient-server-modellen. Översikt över nätnivåer och routing. Brandväggar, autenticering och moment inom kryptografi: kryptering och tekniker för dataintegritet. Översikt över applikationers säkerhetsfrågor, speciellt web-service and e-handelsäkerhet.</p>",
            "Undervisnings- och arbetsformer": "<p>Föreläsningar, laborationer, projektuppgift och enskild fördjupningsuppgift</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>MUN1</td><td>Frivillig muntlig tentamen för högre betyg</td><td>0 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB2</td><td>Laborationskurs</td><td>4 hp</td><td>U, G</td></tr><tr><td>UPG2</td><td>Enskild uppgift</td><td>2 hp</td><td>U, G</td></tr></tbody></table><div>Högre betyg än 3 kan uppnås via resultat på muntlig tentamen.</div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Advanced Global Illumination and Rendering": {
            "Kurs": "TNCG15",
            "Huvudområde": "Datateknik, Datavetenskap, Medieteknik",
            "Utbildningsnivå": "Avancerad nivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Mark E Dieckmann",
            "Studierektor": "Daniel Nyström",
            "Undervisningstid": "Preliminär schemalagd tid: 36 h <br>Rekommenderad självstudietid: 124 h",
            "Fördjupningsnivå": "A1N",
            "Rekommenderade förkunskaper": "Datorgrafik, 3D datorgrafik och animering.",
            "Lärandemål": "<p>Kursen ger en omfattande översikt av avancerad metoder i datorbildsyntes. Kursens fokus är på globala belysningsmodeller, på simulering av indirekt belysning i tredimensionella scener, som består av diffus eller perfekt reflekterande&nbsp;ytor.&nbsp;</p>",
            "Kursinnehåll": "<p>Kursens innehåll är: optik och ljus, algoritmer för \"raytracing\" och \"radiosity\", Monte Carlo sampling och integration, metoder för att lösa en renderingsekvation, stokastisk \"path tracing\". Studenter läser och presentera ett vetenskåplig artikel. De implementera ett renderer och skriva ett projektrapport</p>",
            "Undervisnings- och arbetsformer": "<p>Förläsningar, en studentpresentation av en vetenskaplig artikel och ett programmeringsprojekt.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Projektarbete med muntlig och skriftlig presentation</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div>För godkänd kurs krävs en presentation av en vetenskaplig artikel i mitten av kursperioden och ett programmeringsprojekt med en skriftlig projektrapport. Kursbetyget baseras på programmeringsprojektet och projektrapporten.</div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för teknik och naturvetenskap",
            "Kurslitteratur": null
        },
        "Advanced English": {
            "Kurs": "THEN09",
            "Huvudområde": "Inget huvudområde",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Nandita Mishra",
            "Studierektor": "Olle Linge",
            "Undervisningstid": null,
            "Fördjupningsnivå": "G2F",
            "Rekommenderade förkunskaper": "En grundläggande  kurs i engelska",
            "Lärandemål": "<p>Syftet med kursen är att hjälpa eleverna att utveckla sina språkkunskaper i engelska, både skriftligt och muntligt och kunna tillämpa dem på interkulturella sammanhang, både akademiskt och professionellt. Efter genomgången kurs förväntas studenten ha ökat sin språkliga och kulturella medvetenhet,  sitt ordförråd och bli mer exakt i både tal och skrift. Studenten ska kunna: \n</p><ul>\n<li> Känna igen, använda och definiera olika termer inom ekonomi, vetenskap och teknik \n</li><li> Kunna förklara det politiska systemet och beskriva olika kulturinstitutioner i landet \n</li><li> Identifiera och sammanfatta de viktigaste punkterna i en längre text \n</li><li> Granska, rapportera och diskutera artiklar och texter som berör företagen och ekonomi, vetenskap och teknik samt mer allmänna områden \n</li><li> Fungera effektivt i ett team \n</li><li> Visa kulturell medvetenhet \n</li><li> Formulera tankar och idéer på ett korrekt och professionellt sätt \n</li><li> Organisera skriftligt arbete och presentationer effektivt och på ett lämpligt professionellt sätt \n</li><li> Välja och tillämpa den korrekta terminologin i olika sammanhang \n</li><li> Bedöma hans / hennes eget språk styrkor och svagheter och kunna planera och genomföra korrigerande åtgärder \n</li></ul><p></p>",
            "Kursinnehåll": "<p>Alla deltagare kommer att: \n</p><li> Läsa, granska och presentera en roman av eget val, skriven på engelska \n</li><li> Delta i möten och diskussioner \n</li><li> Skriva protokoll från affärsmöten \n</li><li> Använda olika former av skriftlig form: affärsbrev, rapporter och uppsatser \n</li><li> Delta i en debatt \n</li><li> Kritiskt graska ett arbete som andra studenter  har gjort\n</li><li> Skriva en reflekterande analys av sitt eget språksprestanda i debatten \n</li><li> Göra presentationer på en rad olika ämnen till både mindre och större grupper \n<p></p>",
            "Undervisnings- och arbetsformer": "<p>Lektioner eller seminarieform, och aktivt deltagande på den del av varje enskild student krävs. \n<br>Kursen pågår hela höstterminen.</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG2</td><td>Muntliga och skriftliga uppgifter</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för ekonomisk och industriell utveckling",
            "Kurslitteratur": null
        },
        "Teknik och etik": {
            "Kurs": "TGTU94",
            "Huvudområde": "Inget huvudområde",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Elin Palm",
            "Studierektor": "Martin Berzell",
            "Undervisningstid": null,
            "Fördjupningsnivå": "G1F",
            "Rekommenderade förkunskaper": null,
            "Lärandemål": "<p>Kursens övergripande mål är att den studerande ska utveckla sin förmåga till etisk reflektion med hjälp av etikämnets olika analysverktyg och med särskilt fokus på teknik- och ingenjörsetiska utmaningar. \nEfter fullgjord kurs ska deltagaren kunna:\n</p><ul>\n<li>Beskriva och förklara centrala normativa etiska teorier, principer och begrepp.\n</li><li>Beskriva och förklara etiska utmaningar kopplade till ingenjörsyrket och till teknisk utveckling och tillämpning.\n</li><li>Muntligt diskutera, analysera och ta ställning till olika etiska synsätt.\n</li><li>Tillämpa etiska teorier, principer och begrepp på konkreta fall och situationer.\n</li><li>Kunna ta ställning i etiska frågor på ett konstruktivt och argumentbaserat sätt.\n</li><li>I samarbete med andra skriftligt utreda, analysera och problematisera en etisk fråga i form av ett kortare papperarbete.\n</li></ul><p></p>",
            "Kursinnehåll": "<p>Föreläsningar och seminarier behandlar dels generell etisk teori, dels specifika teknik- och ingenjörsetiska områden. Urval av fall för diskussion och analys varierar delvis efter aktuell kurslitteratur. Områden som behandlas: \n</p><ul>\n<li> Att arbeta med etiska problem: metodfrågor, analysverktyg och grundbegrepp.\n</li><li>Centrala normativa etiska teorier, principer och begrepp: ansvar, rättvisa, rättigheter, konsekvensetik, deontologi, människovärde.\n</li><li>Teknik och etik: teknisk utveckling och moraliskt ansvar, teknikvärdering, övervakning och integritet, risk\n</li><li>Yrkesetik och ingenjörsetik: konkreta fall och problem, yrkesetiska koder.\n</li></ul><p></p>",
            "Undervisnings- och arbetsformer": "<p>Kursens schemalagda moment består av föreläsningar, seminarier, handledning för papperarbete samt seminarium för papperarbete.<br>&nbsp;</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Mindre uppsats, seminarie</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>TEN2</td><td>Skriftlig tentamen</td><td>4.5 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div>75% närvaro på kursen krävs. <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": null,
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för kultur och samhälle",
            "Kurslitteratur": null
        },
        "Projektledning": {
            "Kurs": "TEIO87",
            "Huvudområde": "Industriell ekonomi",
            "Utbildningsnivå": "Grundnivå",
            "Kurstyp": "Programkurs",
            "Examinator": "Dzamila Bienkowska",
            "Studierektor": "Dzamila Bienkowska",
            "Undervisningstid": null,
            "Fördjupningsnivå": "G2F",
            "Rekommenderade förkunskaper": "<p>Grundkurs i industriell ekonomi eller genomfört större projekt.</p>",
            "Lärandemål": "<p>Efter genomgången kurs ska studenten:</p><ul><li>kunna redogöra för&nbsp;och förklara begrepp, modeller och teorier relaterade till planering och utvärdering av projekt</li><li>kunna redogöra för&nbsp;och förklara begrepp, modeller och teorier relaterade till ledarskap och grupputveckling i projekt​</li><li>uppvisa förmåga att&nbsp;analysera beteende och ledarskap&nbsp;i projekt genom att tillämpa teorier och modeller</li><li>uppvisa förmåga att reflektera över beteende och ledarskap&nbsp;i projekt</li></ul>",
            "Kursinnehåll": "<ul><li>grundläggande verktyg för projektplanering och analys</li><li>organisation och roller i projekt</li><li>grupputveckling och gruppsykologi</li><li>ledarskap med beteendefokus - teorier och praktiska verktyg</li><li>coachande ledarskap</li><li>hantering av svåra samtal och konflikter</li><li>utvärdering och uppföljning av projekt</li></ul><p>&nbsp;</p>",
            "Undervisnings- och arbetsformer": "<p>Kursen är organiserad i: föreläsningar, projektarbete i grupp, samt handledningsmöten.<br>&nbsp;</p>",
            "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Uppgift</td><td>3 hp</td><td>U, G</td></tr><tr><td>KTR1</td><td>Kontrollskrivning</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Inom UPG1 ingår aktiv närvaro vid vissa moment. Utebliven eller ej aktiv närvaro gäldas med kompletteringsuppgifter.</p><p>Slutbetyg = betyg på KTR1</p><p>Både UPG1 och KTR1 måste vara genomförda och&nbsp;godkända för att slutbetyg på kursen ska ges.&nbsp;</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
            "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
            "Övrig information": "<p>Påbyggnadskurser: Avancerad projektverksamhet</p>",
            "Påbyggnadskurser": null,
            "Institution": "Institutionen för ekonomisk och industriell utveckling",
            "Kurslitteratur": null
        }
    },
    "Termin 6": {
        "Period 4": {
            "Praktik": {
                "Kurs": "TPTE06",
                "Huvudområde": "Inget huvudområde",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Nämndspecifikt",
                "Studierektor": null,
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": null,
                "Lärandemål": "<p>Målet med praktiken är att studenten skall få praktisk erfarenhet av arbete på en arbetsplats som bedöms som relevant för en individ med utbildning inom det tekniska eller naturvetenskapliga området. Efter praktikperiodens slut skall studenten vara förtrogen med arbetsmiljön i en verksamhet som utbildningen syftar till samt erhållit erfarenhet från samverkan på en arbetsplats. Vidare skall praktiken öka studentens förmåga att ta personligt ansvar och även ge erfarenhet av andra kompetenser som värdesätts utöver den tekniska/naturvetenskapliga ämneskunskapen.&nbsp;</p><p>Efter genomgången kurs ska studenten kunna:&nbsp;</p><ul><li>redogöra för de krav som yrkeslivet ställer på ämneskunskaper</li><li>reflektera över de generiska färdigheter som yrkesrollen kräver</li><li>reflektera över på vilket sätt arbetsplatsens verksamhet påverkar samhället utifrån relevanta hållbarhetsperspektiv</li><li>skriva en sammanfattande praktikrapport i enlighet med instruktion</li></ul>",
                "Kursinnehåll": "<p>Kursen genomförs som en individuell praktik i en från universitets- och högskolesektorn extern organisation.</p><p>Studenten ansvarar för att finna en praktikplats inom ett område som har anknytning till teknik/naturvetenskap. Praktikuppgifterna skall vara av relevant och teknisk/natur-vetenskaplig karaktär och på förhand definierade i en praktikplan. För att godkännas på kursen skall studenten vistas minst 3 veckor sammanhängande heltid på arbetsplatsen och därefter skriva en praktikrapport. För att studenten ska kunna redogöra för och reflektera över det som krävs enligt lärandemålen behöver arbetsplatsen erbjuda kontinuerlig kontakt med kollegor, dvs enbart ensamarbete är inte lämpligt.</p>",
                "Undervisnings- och arbetsformer": "<p>När studenten funnit en lämplig praktikplats och en namngiven handledare vid den organisation där praktiken ska genomföras, kontaktas studievägledningen samt programnämndens ordförande (som fungerar som examinator alternativt delegerar uppdraget). Studievägledningen kontrollerar behörigheten och examinator godkänner praktikplanen. Praktikplanen ska vara formulerad enligt fastställd mall och undertecknad av handledaren och studenten. Studenten antas på praktikkursen via studievägledningen, som även kontrollerar behörigheten.</p><p>Efter genomförd praktikperiod ska studenten dokumentera uppgiften i en skriftlig praktikrapport. Rapporten ska vara utförlig och professionellt skriven och väl spegla kursens mål. Det ska finnas en presentation av arbetsplatsen, en frågeställning i en yrkeslivskontext och en redogörelse för hur uppgifterna i praktikplanen angripits. Diskussionen ska vara omfattande och visa på den studerandes erhållna insikter av de krav som yrkesrollen kräver på såväl ämnesmässiga som generiska färdigheter. Rapporten ska innehålla god källhantering.</p><p>Efter genomförd praktikperiod ska handledaren på arbetsplatsen styrka studentens närvaro samt aktiva medverkan i tilldelade praktikuppgifter i ett handledarintyg enligt fastställd mall.</p><p>Ytterligare instruktioner samt mall för praktikplan och handledarintyg finns i bilaga, se fliken \"Övriga dokument\".</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Projektuppgift</td><td>6 hp</td><td>U, G</td></tr></tbody></table><div><p>På kursen ges betygen Underkänd/Godkänd.</p>\n <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Tvågradig skala, äldre version, U, G",
                "Övrig information": "<p>Antagning till praktikkursen sker via studievägledningen, som även kontrollerar behörigheten.</p>",
                "Påbyggnadskurser": null,
                "Institution": "Tekniska fakultetens kansli",
                "Kurslitteratur": null
            },
            "Datastrukturer": {
                "Kurs": "TND004",
                "Huvudområde": "Datateknik, Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Aida Nordman",
                "Studierektor": "Camilla Forsell",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "<p>Programmering i C++, matematiska koncept, tex numeriska serier ur Analys II</p>",
                "Lärandemål": "<p>Målet med kursen är att ge studenten redskap att självständigt kunna skapa program som löser praktiska problem med stora mängder data, med hänsyn taget till effektivt utnyttjande av tid och minne. För att bli godkänd på kursen ska studenten ha uppnått följande lärandemål.</p><ol><li>Att förstå grundläggande datastrukturkoncept.</li><li>Att tillämpa datastrukturer för att lösa praktiska problem med hänsyn till givna krav.</li><li>Att analysera och utvärdera olika datastrukturer vid lösning av praktiska problem med avseende på effektivitet och ändamålsenlighet.</li><li>Att implementera och använda datastrukturer och algoritmer i applikationsprogram.</li></ol><p>&nbsp;</p>",
                "Kursinnehåll": "<p>Algoritmanalys. Rekursion. Listor, stackar och köer.<br>Träd och trädtraversering. Binära sökträd och balanserade träd.<br>Hashing och hashtabeller. Prioritetsköer och binära heapar.<br>Sortering och sökning.<br>Grafer och graftraversering. Fundamentala grafalgoritmer.</p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar, lektioner, och laborationer.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Frivilliga uppgift</td><td>0 hp</td><td>U, G</td></tr><tr><td>LAB1</td><td>Laborationskurs</td><td>3 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Den frivilliga uppgiften består av två quizzes. Dessa quizzes är bonusgrundande på alla ordinarie tentamina och omtentamina t.o.m. nästkommande januari efter avslutad kursomgång.</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Introduktionskurs i interkulturell kompetens": {
                "Kurs": "TINT01",
                "Huvudområde": "Inget huvudområde",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Christoph Röcklinsberg",
                "Studierektor": "Olle Linge",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1N",
                "Rekommenderade förkunskaper": null,
                "Lärandemål": "<p>Efter kursen skall studenterna kunna:</p><ul><li>Redogöra för grundläggande begrepp och teorier inom interkulturell kommunikation och det antropologiska kulturbegreppet&nbsp;</li><li>Identifiera och beskriva specifika kulturella och kommunikativa mönster i Sverige</li><li>Övergripande beskriva och kontrastera dessa kulturella mönster och prioriteringar med andra kultur- och språkområden i världen</li></ul>",
                "Kursinnehåll": "<ul><li>Grundläggande koncept inom interkulturell kommunikation, etnocentrism och stereotyper samt olika faser i det interkulturella mötet</li><li>Introducera och reflektera över konceptet av ”Cultural Embeddedness” i människors sociala agerande</li><li>Introducera och reflektera över konceptet av ”Doing Culture” i interaktiva kommunikationssituationer</li><li>Introducera och reflektera över konceptet av ”Swedishness” och dess särdrag ur ett kontrastivt perspektiv</li><li>Reflektera över det individuella beteendet vs. de kollektiva och kulturella förväntningarna</li></ul>",
                "Undervisnings- och arbetsformer": "<p>Undervisning sker genom föreläsningar och seminarier. Stor vikt läggs på reflektioner och diskussion i grupp över kulturens inverkan generellt men även specifikt över de kulturella mönstren i Sverige för att kunna relatera till och vara förberedd på möten med andra kulturer. I dessa delar är undervisningsspråket svenska. Föreläsningar ger vid sidan om introduktioner i kultur och interkulturella modeller även grundläggande inblick om olika kulturella värderingar i olika regioner i världen.</p><p>Kursen ges vid flera tillfällen under året, varav kurstillfället under sommaren är på distans.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Digital inlämningsuppgift</td><td>0.5 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPG2</td><td>Digital inlämningsuppgift</td><td>0.5 hp</td><td>U, 3, 4, 5</td></tr><tr><td>MOM1</td><td>Aktivt deltagande i seminarier och gruppdiskussioner</td><td>1 hp</td><td>U, G</td></tr></tbody></table><div><p>För slutbetyg på kursen krävs att samtliga moment är godkända. Slutbetyget ges som ett medelvärde av betygen på UPG1 och UPG2 avrundat uppåt.</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för ekonomisk och industriell utveckling",
                "Kurslitteratur": null
            }
        },
        "Period 3": {
            "Introduktion till artificiell intelligens": {
                "Kurs": "TNM119",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Elmira Zohrevandi",
                "Studierektor": "Camilla Forsell",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "<p>Multivariabelanalys, linjär algebra, statistik, programmering</p>",
                "Lärandemål": "<p>Målet med kursen är att studenten ska få insikter i artificiell intelligens, inklusive klassiska maskininlärningstekniker, djupinlärning och generativa modeller.</p><p>Efter avslutad kurs ska studenten kunna</p><ul><li>resonera om olika maskininlärningstekniker,</li><li>resonera om skillnader mellan klassiska maskininlärningstekniker, djupinlärning och generativa modeller,</li><li>identifiera lämplig teknik för att lösa olika AI-relaterade problem,</li><li>tillämpa vanliga AI-tekniker för att lösa problem relaterade till perception, resonemang och handlingar,</li><li>resonera om utmaningarna med att hålla människor i loopen med autonoma system,</li><li>beskriva vanliga etiska och samhälleliga utmaningar med artificiell intelligens.</li></ul>",
                "Kursinnehåll": "<p>Grundläggande begrepp om AI:s historia och dess betydelse, optimeringstekniker för tillämpningar av AI, funktionsextraktion, probabilistiska resonemang, regelbaserade system, förstärkningsinlärning, övervakat och oövervakat lärande, Bayesianska och regressionsmodeller.</p>",
                "Undervisnings- och arbetsformer": "<p>Närvaro är nödvändig för projektpresentation och examination av laborationer.</p><p>Teorier och praktisk användning av dessa teorier presenteras genom föreläsningar. Betydande laborationsarbete ingår, där teorier omvandlas till praktisk kunskap.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laboration</td><td>3.5 hp</td><td>U, 3, 4, 5</td></tr><tr><td>PRA1</td><td>Projekt</td><td>2 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Inlämningsuppgift</td><td>0.5 hp</td><td>U, G</td></tr></tbody></table><div><p>Laborationsmodulen innehåller förberedande material, uppgifter att avsluta i datorsal och examination genom både muntlig presentation för handledare. I inlämningsuppgiften ingår självstudier, en självskriven analys och inlämning via Lisam. Ett projekt genomfört i par eller individuellt med presentation vid ett avslutande seminarium där personlig närvaro krävs.</p><p>Slutbetyget på kursen baseras på uppnått betyg på labbmodulen, förutsatt att godkänt har uppnåtts på övriga delkurser.</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": null,
                "Kurslitteratur": null
            }
        },
        "Period 3,4": {
            "Medietekniskt kandidatprojekt": {
                "Kurs": "TNM094",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Daniel Jönsson",
                "Studierektor": "Camilla Forsell",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2E",
                "Rekommenderade förkunskaper": null,
                "Lärandemål": "<p>För att få godkänt på kursen måste studenten visa förmåga att&nbsp;</p><ul><li>skapa och analysera tekniska lösningar för att lösa ett givet problem inom området medieteknik (exempelvis publicering, ljud- och bildteknik, datorgrafik och visualisering).</li><li>söka och tillgodogöra sig innehållet i relevant facklitteratur för att lösa eller reflektera över lösningen på ett givet problem</li><li>formulera frågeställningar samt avgränsa dessa inom givna tidsramar</li><li>i grupp planera, genomföra och redovisa ett arbete</li><li>professionellt uttrycka sig skriftligt och muntligt</li><li>kritiskt granska och diskutera ett framlagt arbete</li><li>relatera sitt arbete till relevanta samhälleliga och etiska aspekter</li><li>tillämpa etablerade protokoll för utvecklingsprojekt (projektstyrning, kravhantering, systemarkitektur, programdesign, implementation, dokumentation, test, underhåll)</li><li>utnyttja relevanta verktyg för programvaruutveckling för att utveckla lösningar på ett givet problem.</li></ul>",
                "Kursinnehåll": "<p></p><ul>\n<li>Grundprinciper i programvaruutveckling\n</li><li>Utvecklingsmetodik\n</li><li>Designmönster\n</li><li>Modelleringsnotation\n</li></ul><p></p>",
                "Undervisnings- och arbetsformer": "<p>&nbsp;</p><p>Kursen introducerar teorier och principer för programvaruutveckling och utvecklingsmetodik genom föreläsningar, som examineras genom individuella rapporter. I laborationer får studenterna prova på praktiskt användande av vertyg och öva upp färdigheter. Teorier och färdigheter används sedan i ett omfattande utvecklingsprojekt i grupper om 4-8 studenter. Studentens förståelse och färdigheter examineras genom projektmöten samt en avslutande presentation av projektets resultat.</p><p>Projektet är kopplat till Svenska-strimman där studenterna får både skrivhjälp och återkoppling på rapporter.</p><p>&nbsp;</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG2</td><td>Opponering</td><td>0.5 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Uppsats</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>PRA1</td><td>Projekt</td><td>14 hp</td><td>U, G</td></tr><tr><td>LAB1</td><td>Laborationer</td><td>2 hp</td><td>U, G</td></tr></tbody></table><div>I PRA1 ingår obligatoriska seminarier där projektets progression diskuteras, en gemensam rapport och en presentation som ligger till grund för projektets godkännande. I UPG1 skrivs en individuell uppsats som reflekterar över projektets genomförande med utgångspunkt från och kopplingar till genomgången utvecklingsteori.\n<br>På kursens ges betyg Underkänd/Godkänd. <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Tvågradig skala, äldre version, U, G",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        }
    },
    "Termin 5": {
        "Period 2": {
            "Bildbehandling och bildanalys": {
                "Kurs": "TNM087",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Daniel Nyström",
                "Studierektor": "Camilla Forsell",
                "Undervisningstid": "Preliminär schemalagd tid: 50 h <br>Rekommenderad självstudietid: 110 h",
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "<p>Linjär algebra, Flervariabelanalys, Signaler och system, Matlabprogrammering, Grafisk teknik, Tillämpad transformteori</p>",
                "Lärandemål": "<p>Kursens syfte är att ge en teoretisk och praktisk grund för datoriserad bearbetning och analys av digitala bilder. Efter genomgången kurs ska studenten kunna:</p><ul><li>beskriva principen för bildinfångning, samt förklara och tolka grundläggande operationer på digitala bilder, såsom gråskaletransformationer och histogramanalys.</li><li>konstruera och använda filter i spatial- och frekvensdomänen, samt förklara och tolka kopplingen mellan digitala bilder och deras Fourierspektrum.</li><li>beskriva och implementera metoder för segmentering och bildrestaurering, samt förklara och utföra morfologiska operationer.</li><li>beskriva olika metoder att representera regioner och konturer i bilder, samt principerna för mönsterigenkänning baserad på beslutsfunktioner.</li></ul>",
                "Kursinnehåll": "<p>Bildinfångning och grundläggande egenskaper för kameror och bildsensorer. Gråskaletransformationer och histogram. Filtrering i spatialdomänen. Fouriertransformen och filtrering i frekvensdomänen. Bildrestaurering och bildåterskapande. Morfologiska operationer. Segmentering. Representation av regioner i digitala bilder. Mönsterigenkänning.</p>",
                "Undervisnings- och arbetsformer": "<p>Kursen består av föreläsningar, lektioner samt laborationer.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationskurs</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>4.5 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Modellbygge och simulering": {
                "Kurs": "TNG022",
                "Huvudområde": "Elektroteknik, Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Anna Lombardi",
                "Studierektor": "Kjell Karlsson",
                "Undervisningstid": "Preliminär schemalagd tid: 48 h <br>Rekommenderad självstudietid: 112 h",
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "Statistisk och sannolikhetslära grundkurs, Reglerteknik grundkurs, Grundläggande teknisk engelska.",
                "Lärandemål": "<p>Kursen skall ge kunskaper om metoder och principer att bygga matematiska modeller för dynamiska system. Kursen skall också ge kunskaper om hur modellernas egenskaper studeras genom simulering. Efter avslutad kurs förväntas studenten kunna:</p><ul><li>utifrån fysikaliska samband modellera mekaniska, elektriska och flödessystem, och kombinationer av dessa, genom att ställa upp bindningsgrafer, blockdiagram och DAE-modeller</li><li>identifiera linjära modeller för verkliga system och analysera asymptotiska bias- och variansegenskaper</li><li>analysera numeriska metoder och deras egenskaper</li><li>Modellera och simulera mekaniska och elektriska system med hjälp av datorverktygen Simulink och OpenModelica<strong>&nbsp;</strong></li><li>Identifiera en modell för ett verkligt system genom lämpligt val av experimentdesign, efterbehandling av data, modellstruktur och validering</li><li>Ha förmåga att på engelska skriva en analyserande teknisk rapport.</li></ul><p>&nbsp;</p>",
                "Kursinnehåll": "<p>Del I:<br>Modeller och modell begreppet<br>Differentialekvationer, differensekvationer<br>Statiska och dynamiska förlopp<br>Principer för modellbygget<br>Bindningsgrafer<br>Blockschema<br>Differentialalgebraiska ekvationer</p><p>Del II:<br>Metoder att konstruera modeller baserat på mätdata från processer<br>“Black-box”-modeller<br>Parameterskattning i linjära dynamiska modeller<br>Modellvalidering</p><p>Del III:<br>Numeriska metoder<br>Numerisk noggrannhet och stabilitet<br>Simuleringsspråk: Simulink och Modelica</p><p>Kommunikation på engelska<br>Rapportskrivning på engelska av analyserande text knuten till kursinnehållet.&nbsp;</p>",
                "Undervisnings- och arbetsformer": "<p>Undervisningen förmedlas i form av föreläsningar, lektioner, laborationer samt språkseminarier med aktiv medverkan.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB2</td><td>Laboration</td><td>1 hp</td><td>U, G</td></tr><tr><td>TEN2</td><td>Skriftlig tentamen</td><td>4 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPGA</td><td>Aktiv medverkan med inlämning på språkseminarier</td><td>0.5 hp</td><td>U, G</td></tr><tr><td>UPGB</td><td>Rapportskrivning på engelska</td><td>0.5 hp</td><td>U, G</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 1,2": {
            "Tillämpad visualisering och virtuell verklighet": {
                "Kurs": "TNM093",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Kostiantyn Kucher",
                "Studierektor": "Camilla Forsell",
                "Undervisningstid": "Preliminär schemalagd tid: 34 h <br>Rekommenderad självstudietid: 126 h",
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "Linjär algebra och analys, Programmering C++, Objektorientering och algoritmer,  3D Datorgrafik",
                "Lärandemål": "<p>Studenten skall efter avslutad kurs kunna:<br>&nbsp;</p><ul><li>Förklara förhållandet mellan principer för interaktiv visualisering och virtuell verklighet med mänsklig perception&nbsp;</li><li>Beskriva vanliga pipelines som finns i&nbsp;områdena interaktiv visualisering och virtuell verklighet</li><li>Använda vanliga tekniker för datautforskning och -analys, samt virtuell verklighet för att implementera tillämpningar inom visualisering och datorgrafik</li><li>Använda tracking och korrekt grafisk projektion för att implementera ett-till-ett-mappning mellan verkliga och virtuella koordinater</li><li>Använda vanliga programvaror och system för att implementera grundläggande visualiseringar och multi-sensoriska interaktioner</li><li>Reflektera över etiska risker med visualisering</li></ul>",
                "Kursinnehåll": "<ul><li>Visualiseringspipeline</li><li>Visualiseringstekniker</li><li>Tracking och VR-vyer</li><li>Interaktionstekniker</li><li>Perception</li><li>Tillämpningar</li></ul>",
                "Undervisnings- och arbetsformer": "<p>Kursen introducerar teorier och praktiska exempel genom föreläsningar. I laborationer ska studenterna testa den praktiska användningen av olika verktyg och på så sätt skaffa sig de kunskaper som krävs för att använda programvara för visualisering. Vidare kommer principer inom VR att tillämpas för att korrigera den grafiska vyn.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationer</td><td>6 hp</td><td>U, G</td></tr></tbody></table><div>På kursen ges betyg Underkänd/Godkänd. <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Tvågradig skala, äldre version, U, G",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 1": {
            "Reglerteknik": {
                "Kurs": "TNG028",
                "Huvudområde": "Elektroteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Anna Lombardi",
                "Studierektor": "Kjell Karlsson",
                "Undervisningstid": "Preliminär schemalagd tid: 60 h <br>Rekommenderad självstudietid: 100 h",
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "Signaler och system, transformmetoder",
                "Lärandemål": "<p>Kursen skall ge förståelse för dynamiska system och kunskaper om grundläggande metoder för att analysera och dimensionera återkopplade reglersystem. Efter genomförd kurs skall studenten kunna</p><ul><li>Analysera modeller av dynamiska system på in-utsignalform samt konstruera och analysera reglersystem baserade på PID-regulatorer. &nbsp;Beskriva de grundläggande förutsättningarna, möjligheterna och begränsningarna för återkopplad reglering.</li><li>Analysera reglersystem utgående från modeller av dynamiska system givna på frekvensfunktionsform samt dimensionera regulatorer i frekvensdomän för att erhålla önskad systemprestanda.</li><li>Genomföra systemanalys och konstruera reglersystem baserat på tillståndsmodeller.&nbsp;</li><li>Modellera, konstruera och verifiera ett reglersystem för en labprocess.</li></ul><p>&nbsp;</p>",
                "Kursinnehåll": "<p><strong>Del I:</strong><br>Differentialekvationer, överföringsfunktioner, poler och nollställen<br>Stabilitet, specifikationer, samband mellan dynamiska egenskaper och poler<br>Återkopplingsprincipen, blockschema, framkoppling<br>PID-regulatorn, uppbyggnad och funktion<br>Tolkning av systemegenskaper m h a rotort</p><p><strong>Del II:</strong><br>Bodediagram, Nyquistdiagram, fas- och amplitudmarginal<br>Regulatorer i frekvensdomän i form av högpass- och lågpass- filter för att erhålla önskad systemprestanda<br>Samband mellan frekvens- och tidssvar<br>Tidsfördröjningar<br>Fundamentala begränsningar vid återkoppling, robusthetskriteriet</p><p><strong>Del III:</strong><br>Tillståndsmodeller, stabilitet, styr- och observerbarhet<br>Tillståndsåterkoppling, tillståndsskattning, återkoppling från skattade tillstånd</p>",
                "Undervisnings- och arbetsformer": "<p>Kursen består av föreläsningar, lektioner, MATLAB-övningar och laborationer.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laboration</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>4.5 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser:&nbsp;Modellbygge och simulering</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Ljudfysik": {
                "Kurs": "TFYA65",
                "Huvudområde": "Teknisk fysik, Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Per Sandström",
                "Studierektor": "Magnus Boman",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "<p>Signaler och system, Mekanik och vågfysik</p>",
                "Lärandemål": "<p>Kursen syftar till att ge studenterna kunskaper om ljud och akustik. Efter kursen ska studenten kunna:</p><ul><li>Använda begrepp och metoder samt lösa problem inom ljudområdet.</li><li>Redogöra för olika akustiska och ljudtekniska fenomen.</li><li>Utföra mätningar, analys och signalbehandling av ljudsignaler.</li><li>Utforma och implementera en teknisk applikation eller utföra en litteraturstudie relaterad till ljud samt kommunicera resultat och slutsatser muntligt och skriftligt.</li></ul><p>&nbsp;</p>",
                "Kursinnehåll": "<ul><li>Grundläggande beskrivning av ljudvågor och fysikaliska fenomen relaterade till dessa, tex. vågutbredning, resonans, interferensfenomen, ljudintensitet, ljudintensitetsnivå och ljudtrycksnivå.</li><li>Ljudutbredning och rumsakustik tex. absorption, diffusion, kamfilter, efterklangtid och rumsmoder.</li><li>Psykoakustik: människans uppfattning av ljud&nbsp;och dess tillämpningar.&nbsp;</li><li>Egenskaper hos några olika ljudalstrare, tex akustiska instrument och högtalare.</li><li>Ljudmätteknik och utrustning relaterade till ljudinspelning och ljudåtergivning.&nbsp;</li><li>Introduktion till digitalt ljud, digitala ljudformat, signalbehandling, analys av ljud samt taligenkänning.&nbsp;</li><li>Ljudupptagning, ljudåtergivning, ljudbearbetning och ljudeffekter</li></ul>",
                "Undervisnings- och arbetsformer": "<p>Kursen ges i form av föreläsningar, laborationer och ett projektarbete.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projektarbete</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>LAB1</td><td>Laborationer</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser: Ljudteknik</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för fysik, kemi och biologi",
                "Kurslitteratur": null
            }
        }
    },
    "Termin 4": {
        "Period 4": {
            "Signaler och system": {
                "Kurs": "TNG015",
                "Huvudområde": "Elektroteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Naveen Kumar Dasanadoddi Venkategowda",
                "Studierektor": "Kjell Karlsson",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "Linjär algebra, Flervariabelanalys, Transformteori",
                "Lärandemål": "<p>Efter avslutad kurs ska studenten kunna:</p><ul><li>Hantera tidskontinuerliga signaler och system i tids- och frekvensdomänen (TEN6)</li><li>Hantera tidsdiskreta signaler och system i tids- och frekvensdomänen (TEN7)</li><li>Tillämpa Fourier-, Laplace- och Z-transformen för beräkningar och analys (LAB2)</li></ul><p>&nbsp;</p>",
                "Kursinnehåll": "<p>&nbsp;</p>\n\n<ul>\n\t<li>Grundläggande signaler och deras egenskaper</li>\n\t<li>LTI-system</li>\n\t<li>Fouriertransformen och frekvensanalys</li>\n\t<li>Samplingsvillkor och tidsdiskreta signaler</li>\n\t<li>Laplacetransformen och systemanalys</li>\n\t<li>Z-transformen för samplade signaler och system</li>\n\t<li>Digitala filter (FIR och IIR)</li>\n\t<li>Adaptiva filter</li>\n\t<li>Individuell rapportskrivning (för högre betyg)</li>\n</ul>\n\n<p>&nbsp;</p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar, lektioner och laborationer.&nbsp;</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN7</td><td>Skriftlig tentamen</td><td>2 hp</td><td>U, 3, 4, 5</td></tr><tr><td>TEN6</td><td>Skriftlig tentamen</td><td>2 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB2</td><td>En obligatorisk laborationskurs</td><td>2 hp</td><td>U, G</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Matematisk statistik": {
                "Kurs": "TNG006",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Tomas Johansson",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "Flervariabelanalys",
                "Lärandemål": "<p>Kursen avser att lära den studerande förstå och utnyttja grundläggande sannolikhetslära och statistik, dvs teorin för försök som påverkas av slumpmässiga faktorer. Kursen inriktas speciellt på sådana grundläggande kunskaper som krävs för tillämpningar inom teknik, ekonomi och naturvetenskap. Efter fullgjord kurs skall studenten  kunna:\n</p><ul> \n<li>Teckna och använda händelser samt stokastiska variabler i olika problemformuleringar\n</li><li>Använda betingad sannolikhet\n</li><li>Använda multiplikationsprincipen samt kombinatorik\n</li><li>Ha god förståelse för härledning och användning av de olika fördelningsfunktionerna, se kursinnehåll nedan\n</li><li>Avgöra om det föreligger oberoende för givna variabler\n</li><li>Vid behov räkna ut väntevärde och varians för stokastiska variabler, summor och andra funktioner av dessa\n</li><li>Använda centrala gränsvärdessatsen\n</li><li>Punktskatta t.ex. med metoder såsom maximum-likelihood, momentskattningar och minsta kvadratskattningar\n</li><li>Bestämma konfidensintervall för väntevärde och varians\n</li><li>Ställa upp en nollhypotes och en mothypotes och bestämma ett förkastelseområde\n</li><li>Använda regressionsanalys\n</li></ul><p></p>",
                "Kursinnehåll": "<p></p><ul>\n<li>Sannolikhetslära: Händelser och sannolikheter i utfallsrum. Stokastiska variabler, sannolikhetsfördelningar, väntevärden och standardavvikelser. Bl a behandlas likformig, exponential-, normal-, binomial-, Poission- och hypergeometrisk fördelning. Kombinatorik. Beroende och oberoende variabler, något om beroendemått. Summor och andra funktioner av stokastiska variabler. Centrala gränsvärdessatsen och stora talens lag. Betingning. \n</li><li>Statistik: Punktskattningar och deras osäkerhet, maximum-likelihood -skattningar, momentskattningar och minsta kvadratskattningar. Chi-två- och t-fördelning. Intervallskattning. Hypotestestning med och utan parametriska förutsättningar.  Regressionsanalys. Problemlösning inriktad på problemställningar från teknik, naturvetenskap, kvalitetskontroll mm. \n</li></ul><p></p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar och lektionsundervisning.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>KTR1</td><td>Frivillig dugga</td><td>0 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>En skriftlig tentamen</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 3,4": {
            "3D Datorgrafik": {
                "Kurs": "TNM061",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Martin Falk",
                "Studierektor": "Daniel Nyström",
                "Undervisningstid": "Preliminär schemalagd tid: 52 h <br>Rekommenderad självstudietid: 108 h",
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "<p>Datorgrafik</p>",
                "Lärandemål": "<p>Den här kursen ger en översikt över koncept och tekniker som ofta används för att skapa 3D-datorgrafik.</p><p>Studenten skall efter genomgången kurs kunna</p><ul><li>redogöra för, beskriva och använda vanliga metoder och tekniker inom 3D-datorgrafik</li><li>välja och motivera metoder och tekniker för att lösa vanliga problem på området</li><li>använda sig av programvara för 3D-datorgrafik för att modellera, animera och rendera enkla scener</li></ul>",
                "Kursinnehåll": "<ul><li>3D-grafik: scengrafer, transformationer, datastrukturer</li><li>realtidsgrafik: rendereringspipeline, grafikhårdvara, shading</li><li>modellering: polygonnät, parametriska kurvor och ytor</li><li>material: interaktion mellan ljus och objekt, texturering</li><li>global belysning: strålspårning (ray tracing), radiosity</li><li>animering med keyframes, invers kinematik, fysikbaserade simuleringar</li></ul>",
                "Undervisnings- och arbetsformer": "<p>Kursen omfattar föreläsningar, laborationer samt en större projektuppgift. Föreläsningarna är inriktade på grundläggande koncepter medan laborationerna och projektmomentet ger möjlighet att omsätta dessa i praktiken.<br>Kursen pågår hela vårterminen och kombinerar teori och praktik.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Projektuppgift i grupp</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>En obligatorisk laborationskurs</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>En skriftlig tentamen</td><td>1.5 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div>Slutbetyget är ett medelvärde av betygen på momenten TEN1 och UPG1, där båda ges lika vikt och eventuell avrundning sker uppåt. <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": null,
                "Kurslitteratur": null
            }
        },
        "Period 3": {
            "Grafisk teknik": {
                "Kurs": "TNM059",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Sasan Gooran",
                "Studierektor": "Daniel Nyström",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "<p>Matematisk grundkurs</p>",
                "Lärandemål": "<p>Efter genomgången kurs ska studenten kunna:</p><ul><li>Utförligt redogöra för hur ett foto digitaliseras och lagras samt för återgivning av digitala bilder i tryck</li><li>Implementera, utvärdera samt genomföra beräkningar för olika rastreringstekniker</li><li>Redogöra för enkla objektiva kvalitetsmått för rasterbilder</li><li>Utförligt redogöra för färgseendet och olika färgsystem samt principer för olika metoder för mätning och representation av färg</li><li>Genomföra beräkningar av färgstimuli (sensorer och observatörer) samt färgreproduktion i tryck</li></ul>",
                "Kursinnehåll": "<p>Grundläggande kunskaper om tryck. &nbsp;Återgivning av monokroma bilder i tryck - rastrering. Digitala raster. Optisk och mekanisk punktförstoring. Objektiva kvalitetsmått för rasterbilder. Färglära: synsinnets färguppfattning, färgrepresentation, färgstandarder, färgåtergivning. Färgrastrering. Digitalisering av färgbilder. Tonomfång, färgomfång, gråbalans, färgkorrektion och färghantering (color management).</p>",
                "Undervisnings- och arbetsformer": "<p>Kursen består av föreläsningar, lektioner och laborationer.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationskurs</td><td>1.5 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>4.5 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser:<br>Bildreproduktion och bildkvalitet, Bildteknik</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Tillämpad transformteori": {
                "Kurs": "TNG032",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Lukás Malý",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "Envariabelanalys, Linjär algebra och Flervariabelanalys",
                "Lärandemål": "<p>Kursen skall ge de matematiska grunderna för de transformmetoder som används i kretsteori, reglerteori, signaler och system, bildbehandling och produktionsekonomi. Studenten ska efter genomgången kurs:</p><ul><li>kunna använda och bestämma Fourierserier, tillämpa Parsevals formel, känna till konvergensresultat</li><li>transformera funktioner och talföljder, med Fourier-, Laplace- och Z-transformen</li><li>ha kunskap om vilka funktioner och serier som kan transformeras</li><li>använda transformer och Fourierserier för att lösa t.ex. ordinära differentialekvationer, partiella differentialekvationer, differensekvationer, integralekvationer</li></ul>",
                "Kursinnehåll": "<p>Några viktiga linjära transformationer studeras, med hjälp av vilka linjära problem, givna av differential-, integral-, differensekvationer kan översättas till mer hanterbara linjära algebraiska problem. Följande moment kommer att studeras: Fourierserier, Parsevals relation, Fouriertransformer, Inversionsformeln, Faltningsformeln, Laplacetransformen, z-transformen.</p>",
                "Undervisnings- och arbetsformer": "<p>Undervisningen sker i form av föreläsningar, lektioner och laborationer.&nbsp;</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN3</td><td>En skriftlig tentamen</td><td>4 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB4</td><td>En laborationskurs</td><td>2 hp</td><td>U, G</td></tr><tr><td>KTR2</td><td>Frivillig dugga</td><td>0 hp</td><td>U, G</td></tr></tbody></table><div><p>Laborationskursen består av laborationer hämtade från bildbehandling, reglerteknik och signalbehandling. Programmeringsspråket i laborationskursen är Matlab.&nbsp;</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        }
    },
    "Termin 3": {
        "Period 2": {
            "Programmering i C++": {
                "Kurs": "TNG033",
                "Huvudområde": "Datateknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Aida Nordman",
                "Studierektor": "Camilla Forsell",
                "Undervisningstid": "Preliminär schemalagd tid: 54 h <br>Rekommenderad självstudietid: 106 h",
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "En grundläggande kurs i programmering samt en kurs i objektorienterad programmering.",
                "Lärandemål": "<p>Kursens syfte är att ge kunskaper i att använda programspråket C++ för att utveckla program. För att bli godkänd på kursen ska studenten ha uppnått följande lärandemål.</p><ul><li>Skriva program som använder dynamisk minnesallokering.</li><li>Definiera klasser med överlagrade operatorer.</li><li>Bygga klasshierarkier.</li><li>Använda containerklasser, algoritmer, och iteratorer från standardbiblioteket.&nbsp;</li></ul><p>&nbsp;</p>",
                "Kursinnehåll": "<p>Minneshantering: stack och heap, dynamisk minnesallokering, vanliga minneshanteringsfällor. Pekare och referenser. Enkellänkade listor. Klasser och arv. Konstruktörer och destruktörer. Operatoröverlagring. Statiska medlemmar. Vänner. Virtuella funktioner. Abstrakta klasser. Statisk och dynamisk bindning. Polymorfism. Objektskärning. Lambdafunktioner och funktionsobjekt. Mallar. C++ standardmallbibliotek (STL): containerklasser, iteratorer och algoritmer.</p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar och laborationer.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Obligatorisk laborationskurs</td><td>3 hp</td><td>U, G</td></tr><tr><td>DAT1</td><td>Datortentamen</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser: Datastrukturer, Programvaruutveckling, Designmönster</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Vektoranalys": {
                "Kurs": "TNA007",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Olof Svensson",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "Analys I-III och Linjär algebra",
                "Lärandemål": "<p>Kursen bygger på kursen i flervariabelanalys. Följaktligen är målen likartade: \natt ge de studerande förståelse för matematiska begrepp och förtrogenhet \nmed matematiska metoder för vektorfält som uppstår i alla grenar av fysik \noch teknik. Efter kursen ska studenterna kunna\n</p><ul>\n<li> söka potential och vektorpotential till ett vektorfält\n</li><li> söka fältlinjer till ett vektorfält\n</li><li> beräkna linje- och ytintegraler\n</li><li> använda Gauss och Stokes satser för beräkningar av flödes- och linjeintegraler\n</li><li> använda sfäriska och cylindriska koordinater i beräkningar. \n</li></ul><p></p>",
                "Kursinnehåll": "<p>Skalär- och vektorfält. Gradient, divergens och rotation. Kurvintegraler samt yt- och flödesintegraler. Gauss sats och Stokes sats. Kroklinjiga koordinatsystem. Partiella differentialekvationer.</p>",
                "Undervisnings- och arbetsformer": "<p>Kursen ges i form av föreläsningar, lektioner, kontrollskrivningar och sluttentamen.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>6 hp</td><td>U, 3, 4, 5</td></tr><tr><td>KTR4</td><td>Frivillig kontrollskrivning</td><td>0 hp</td><td>U, G</td></tr><tr><td>KTR5</td><td>Frivillig kontrollskrivning</td><td>0 hp</td><td>U, G</td></tr></tbody></table><div>Kontrollskrivningarna kan ge bonuspoäng på den skriftliga tentamen under läsåret (dvs på förstagångstentamen samt två omtentamina under läsåret). <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser:&nbsp;Ellära och elektromagnetism</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 1,2": {
            "Kommunikation och användargränssnitt": {
                "Kurs": "TNM040",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Camilla Forsell",
                "Studierektor": "Daniel Nyström",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "<p>Javaprogrammering. Internetteknik.</p>",
                "Lärandemål": "<p>Kursen syftar till att ge studenterna grundläggande teoretisk och praktisk kunskap inom människa-datorinteraktion och användarcentrerad systemutveckling av digitala interaktiva användargränssnitt.&nbsp;</p><p>Efter genomgången kurs ska studenter kunna:</p><ul><li>Kritiskt granska och värdera digitala användargränssnitt utifrån teoretiska kunskaper och begrepp inom människa-datorinteraktion</li><li>Kritiskt granska och värdera digitala användargränssnitt i relation till inkluderande design&nbsp;</li><li>Planera, implementera och redogöra för digitala interaktiva användargränssnitt utifrån teoretiska och praktiska kunskaper och begrepp inom människa-datorinteraktion, inkluderande design och programmering&nbsp;</li><li>Utveckla och presentera prototyper av interaktiva användargränssnitt&nbsp;</li><li>Planera, genomföra och redogöra för användarcentrerade utvärderingar&nbsp;</li></ul><p>&nbsp;</p>",
                "Kursinnehåll": "<p>Grundläggande teorier och begrepp inom området människa-datorinteraktion och användarcentrerad systemutveckling. Användbarhet och användarupplevelse. Designprinciper och riktlinjer för design och utveckling av interaktiva digitala användargränssnitt. Inkluderande design och systemutveckling. Metoder för utvärdering av användbarhet och användarupplevelse. Prototypning från skiss till digitala prototyper, programmering och implementation.&nbsp;</p><p>&nbsp;</p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar, seminarium, programmeringsuppgifter, individuell inlämningsuppgift, projektarbete i grupp, samt muntlig presentation.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>PRA1</td><td>Projektuppgift</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>UPG4</td><td>Grupprogrammeringsuppgifter</td><td>1 hp</td><td>U, G</td></tr><tr><td>UPG3</td><td>Individuell inlämningsuppgift</td><td>2 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div>Kursbetyg sätts genom viktning av de två betygsgrundande examinationsmomenten. <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": "<p>Strukturella metoder för användarupplevelse</p>",
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 1": {
            "Mekanik och vågfysik": {
                "Kurs": "TNE043",
                "Huvudområde": "Teknisk fysik, Fysik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Isak Engquist",
                "Studierektor": "Kjell Karlsson",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G2F",
                "Rekommenderade förkunskaper": "Väl inhämtade kurser i analys och linjär algebra, centrala moment är grundläggande vektorlära, derivering och integrering av elementära funktioner, linjära differentialekvationer med konstanta koefficienter.",
                "Lärandemål": "<p>Efter genomgången kurs ska studenten kunna:&nbsp;</p><p>tillämpa fysikaliska modeller och begrepp som ingår i kursen för att analysera och lösa fysikaliska problem, samt redovisa lösningarna på ett strukturerat sätt.</p><p>bedöma om beräknade och uppmätta resultat vid laborationer är rimliga, och utföra dimensionsanalys av fysikaliska formler.</p><p>skriva en vetenskaplig rapport med ett akademiskt språk samt muntligt presentera resultat och opponera på andra studenters presentation.</p>",
                "Kursinnehåll": "<p>Experimentell problemlösning,dimensionsanalys,mätvärdesbehandling</p><p>Individuell rapportskrivning med ökade krav på akademiskt språk samt muntlig presentation och opposition</p><p>Mekanik: Kinematik,dynamik,energi och arbete,stöt, svängningar</p><p>Vågfysik: Mekaniska vågor,superposition,vågekvationen, akustik,elektromagnetiska vågor,geometrisk optik,vågoptik</p>",
                "Undervisnings- och arbetsformer": "<p>Kursen består av föreläsningar, lektioner och laborationer. En skriftlig tentamen ges efter kursens slut. I laborationskursen ingår en individuellt skriven rapport på svenska, presentation samt opposition.\n<br>I kursen ingår en del av kommunikationsstrimman i svenska för ED, KTS och MT.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG3</td><td>Rapportskrivn. på svenska, muntlig presentation o opposition</td><td>1 hp</td><td>U, G</td></tr><tr><td>KTR1</td><td>Frivillig dugga</td><td>0 hp</td><td>U, G</td></tr><tr><td>LAB2</td><td>En obligatorisk laborationskurs</td><td>1 hp</td><td>U, G</td></tr><tr><td>TEN2</td><td>En skriftlig tentamen</td><td>4 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div>Granskning och återkoppling sker av språklärare i samband med rapportskrivning. En frivillig dugga ges som kan ge bonus på den skriftliga tentamen. Bonus gäller vid tentamenstillfällena till och med närmast följande augustiperiod. <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Analys III": {
                "Kurs": "TNA006",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Olof Svensson",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "Analys I-II och Linjär algebra",
                "Lärandemål": "<p>Kursen bygger på kursen i Analys I-II. Följaktligen är målen likartade: att ge de studerande förståelse för matematiska begrepp och förtrogenhet med matematiska metoder för funktioner av flera variabler som uppstår i alla grenar av fysik och teknik. Studenten ska efter genomgången kurs kunna: \n</p><ul>\n<li> hantera funktioner av flera variabler, t.ex. att kunna bestämma gränsvärden, avgöra om funktioner är kontinuerliga och differentierbara, bestämma partiella derivator, samt använda kedjeregeln för att transformera och lösa partiella differentialekvationer \n</li><li>lösa globala och lokala maximi- och minimiproblem, med och utan bivillkor. \n</li><li>citera och förklara definitioner av begrepp såsom lokalt extremvärde, gränsvärde, kontinuitet, partiell derivata, differntierbarhet, gradient, tangentplan, dubbel- och trippelintegraler.\n</li><li>förklara och använda centrala satser såsom implicita funktionssatsen. \n</li><li> beräkna dubbel- och trippelintegraler och  teckna uttryck för area och volymer med hjälp av dubbel- och trippelintegraler.\n</li></ul><p></p>",
                "Kursinnehåll": "<p>Funktioner av flera variabler. Gränsvärden och kontinuitet. Partiell derivata, gradient, riktingsderivata och differential. Tangentplan och linearisering. Kedjeregeln. Taylors formel. Vektorvärda funktioner, Jacobis matris och Jacobian. Implicit derivering och implicita funktioner. Lokala och globala maxima och minima. Maximi- och minimiproblem med och utan bivillkor. Dubbel- och trippelintegraler. Itererad integration. Variabelbyte. Rymdkurvor.</p>",
                "Undervisnings- och arbetsformer": "<p>Kursen ges i form av föreläsningar, lektioner, kontrollskrivningar och sluttentamen.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>KTR1</td><td>Frivillig dugga</td><td>0 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>6 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser:&nbsp;Vektoranalys, Tillämpad transformteori, Optimeringslära, Statistik och sannolikhetslära, Ellära och elektromagnetism, Akustik</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        }
    },
    "Termin 2": {
        "Period 4": {
            "Datorgrafik": {
                "Kurs": "TNM046",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Sasan Gooran",
                "Studierektor": "Daniel Nyström",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "Linjär algebra,  Programkonstruktion, Objektorienterad programmering",
                "Lärandemål": "<p>Studenten skall efter genomgången kurs kunna:</p><ul><li>Definiera 3D-objekt och genomföra olika transformationer på dem, inklusive koordinatsystemtransformationer.&nbsp;</li><li>Utveckla matriser för parallell- och perspektivprojektion, applicera dem och klippa delar av det projicerade objektet som ligger utanför vy-fönstret.&nbsp;</li><li>Redogöra för och tillämpa olika ljusmodeller och shading-metoder för att beräkna ljusintensitet vid rendering.</li><li>Redogöra för olika texturmappningsmodeller och fastställa texturkoordinaterna för vertex-punkterna genom dessa metoder.</li><li>Implementera egna programkodslösningar för verkliga problem inom området.</li></ul>",
                "Kursinnehåll": "<p>Definiera 3D-objekt med hjälp av trianglar, 2D- och 3D-&nbsp;transformationer, koordinatsystemstransformationer, rendering, parallell- och&nbsp;perspektivprojektion, klippning av projicerade objekt utanför vy-fönstret, gömda ytor, lokala ljusmodeller, olika shading-metoder, texturmappning, enklare grafikprogrammering.</p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar för teori samt laborationer för tillämpning och fördjupning. Kursboken och övrigt kursmaterial är på engelska.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationskurs</td><td>3 hp</td><td>U, G</td></tr><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser: 3-D Datorgrafik och animering</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Analys II": {
                "Kurs": "TNA004",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Lukás Malý",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "Analys I",
                "Lärandemål": "<p>Att du som student skall tillägna dig den förtrogenhet med matematiska begrepp, resonemang och samband som ryms inom envariabelsanalys samt den färdighet i kalkyl och problemlösning som behövs för de fortsatta studierna. Efter fullgjord kurs skall du kunna \n</p><ul> \n<li> läsa och tolka matematisk text </li><li> förklara Taylors formel och begreppen numerisk serie, potensserie och konvergens av serie\n</li><li> teckna uttryck för, och beräkna, geometriska storheter såsom plan area, kurvlängd, rotationsvolym och rotationsarea\n</li><li> hantera differentialekvationer (1:a ordingens linjära, separabla och högre ordningens linjära med konstanta koefficienter) samt integralekvationer och serielösningar\n</li><li> använda Taylorutvecklingar för att approximera funktioner med polynom, undersöka gränsvärden, beräkna närmevärden och avgöra lokala egenskaper \n</li><li> genomföra konvergensundersökningar av generaliserade integraler, numeriska serier och potensserier\n</li><li> utföra kontroller av resultat och delresultat, för att verifiera att dessa är korrekta eller rimliga\n</li></ul><p></p>",
                "Kursinnehåll": "<p>Tillämpningar av integraler - Generaliserade integraler: definition och beräkningar, uppskattning av summor, area av plana ytor, kurvlängd, volym av rotationskroppar, area av rotationsytor, massa och tyngdpunkt. Taylors och Maclaurins formler. Maclaurinutveckling av elementära funktioner. Olika former på resttermen: Lagrange och ordo. Tillämpningar bl a på feluppskattning vid approximationer och beräkning av gränsvärden. Ordinära differentialekvationer. Första ordningens linjära och separabla ekvationer. Integralekvationer. Linjära ekvationer av högre ordning med konstanta koefficienter. Generaliserade integraler: konvergensundersökning, absolutkonvergens. Numeriska serier: konvergensundersökning, absolutkonvergens, Leibniz kriterium. Potensserier, serielösning till differentialekvationer.</p>",
                "Undervisnings- och arbetsformer": "<p>Undervisningen ges i form av föreläsningar och lektioner.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN1</td><td>En skriftlig tentamen</td><td>6 hp</td><td>U, 3, 4, 5</td></tr><tr><td>KTR1</td><td>Frivilliga duggor</td><td>0 hp</td><td>U, G</td></tr></tbody></table><div><p>Godkänt på de frivilliga duggorna ger bounuspoäng på TEN1 enligt information på kurshemsidan.</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 3": {
            "Introduktion till webbprogrammering och -publicering": {
                "Kurs": "TNM115",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Nico Reski",
                "Studierektor": "Camilla Forsell",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "<p>Grundläggande kurs i programmering.</p>",
                "Lärandemål": "<p>Studenten ska efter genomgången kurs kunna:</p>\n\n<ul>\n\t<li>utforma effektiv information</li>\n\t<li>använda de olika teknikerna och formaten som finns för att presentera text och bild elektroniskt</li>\n\t<li>särskilja mellan verktyg och teknik och kunna avgöra vilken teknik/standard som är mest lämpad för ett givet problem</li>\n\t<li>utvärdera en befintlig publikation med avseende på teknik genomgången i kursen</li>\n\t<li>analysera möjligheter och risker med användandet av digitala medier från ett socialt och ekonomiskt perspektiv</li>\n\t<li>använda en agil utvecklingsmetodik för att i grupp om 4-5 personer genomföra ett programmeringsprojekt för elektronisk publicering</li>\n</ul>\n\n<p>&nbsp;</p>",
                "Kursinnehåll": "<p>Fokus på tekniker för innehållsutformning inom elektronisk publicering. Grundläggande märkspråk för innehållsutformning. Introduktion till klient-servermodellen och skriptspråk. Introduktion till layout och form inom elektronisk publicering, exempelvis formatmallar. Introduktion till logik och funktion inom elektronisk publicering och distribuerade tjänster, exempelvis dynamisk information. Kort introduktion till databaser och dessas använding för lagring och presentation av dynamisk information. Sociala och ekonomiska aspekter på användandet av digitala medier.</p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar, laborationer och projektarbete. Laborationer omfattar även inlämningsuppgifter. Projekt utförs i grupper om fyra eller fem personer.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Utvärderingsuppgift</td><td>3 hp</td><td>U, 3, 4, 5</td></tr><tr><td>LAB1</td><td>Laborationskurs inklusive inlämningsuppgifter</td><td>3 hp</td><td>U, G</td></tr></tbody></table><div><p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Analys I": {
                "Kurs": "TNA003",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Olof Svensson",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "Matematisk grundkurs",
                "Lärandemål": "<p>Att du som student skall tillägna dig den förtrogenhet med matematiska begrepp, resonemang och samband som ryms inom envariabelanalys samt den färdighet i kalkyl och problemlösning som behövs för de fortsatta studierna. Efter fullgjord kurs skall du kunna \n</p><ul>\n<li> läsa och tolka matematisk text \n</li><li> citera och förklara definitioner av begrepp såsom lokalt extremvärde, gränsvärde, kontinuitet, derivata, primitiv funktion och integral\n</li><li>citera, förklara och använda centrala satser såsom huvudsatsen, insättningsformeln, medelvärdessatserna, satsen om mellanliggande värde samt satsen om största och minsta värde\n</li><li> använda räknelagar för gränsvärden, derivator, primitiva funktioner och integraler \n</li><li> genomföra funktionsundersökningar, t ex med hjälp av derivator, gränsvärden och egenskaper hos elementära funktioner, och därigenom kunna dra slutsatser om funktioners egenskaper \n</li><li> använda standardtekniker för att bestämma primitiva funktioner och bestämda integraler\n</li><li> göra undersökning av generaliserade integraler med hjälp av primitiv funktion\n</li><li> göra jämförelser mellan summor och integraler  \n</li><li> utföra kontroller av resultat och delresultat, för att verifiera att dessa är korrekta eller rimliga \n</li></ul><p></p>",
                "Kursinnehåll": "<p>Funktioner av en reell variabel. Gränsvärde och kontinuitet. Derivator. Deriveringsregler. De elementära funktionernas derivator. Egenskaper hos deriverbara funktioner. Derivatans betydelse för monotonicitet. Kurvritning, tangent och normal, asymptoter. Lokala och globala maxima och minima. Derivator av högre ordning. Bestämning av primitiva funktioner. Partiell integration, variabelbyte. Primitiver till rationella funktioner, funktioner innehållande vissa rotuttryck och trigonometriska funktioner. Riemannintegralen: definition och egenskaper. Integration av kontinuerliga funktioner. Samband mellan bestämd integral och primitiv funktion. Integrationsmetoder. Generaliserade integraler. Jämförelser mellan summor och integraler.</p>",
                "Undervisnings- och arbetsformer": "<p>Undervisningen ges i form av föreläsningar och lektioner eller enbart lektioner.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN1</td><td>En skriftlig tentamen</td><td>6 hp</td><td>U, 3, 4, 5</td></tr><tr><td>KTR2</td><td>Frivillig kontrollskrivning</td><td>0 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Frivillig nätbaserat kursmoment</td><td>0 hp</td><td>U, G</td></tr><tr><td>KTR3</td><td>Frivillig kontrollskrivning</td><td>0 hp</td><td>U, G</td></tr></tbody></table><div><p>Frivilliga kontrollskrivningar och kursmoment är bonusgrundande på alla ordinarie tentamen och omtentamina t.o.m. nästkommande augusti.</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser: Analys II</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 3,4": {
            "Tillämpad matematik i teknik och naturvetenskap": {
                "Kurs": "TNA005",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Berkant Savas",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "Matematisk grundkurs, Linjär algebra, Programkonstruktion. Förutsättes även att Analys I och Analys II (envariabelanalys), läses parallellt med denna kurs eller har inhämtats tidigare.",
                "Lärandemål": "<p>Kursen avser att utgöra en brygga mellan de grundläggande matematikkurserna och kurser inom teknik och naturvetenskap. Studenterna skall vänja sig vid att använda matematiska resultat och beräkningsprogram, som MATLAB, för att studera, analysera, och till viss del lösa realistiska problem från tillämpningar. Efter avslutad kurs skall studenten kunna:</p><ul><li>matematiskt modellera vissa problemställningar inom informationsteknologiska och fysikaliska tillämpningar;</li><li>reflektera över en matematisk modells förtjänster och begränsningar;</li><li>använda MATLAB som ett naturligt redskap för att lösa beräkningsproblem, däribland: behandla matriser och linjära ekvationssystem, teckna och lösa minstakvadratproblem, lösa ordinära differentialekvationer, utföra numerisk integrering;</li><li>välja lämpliga metoder för att studera matematiska frågeställningar som uppstår i olika sammanhang inom teknik och naturvetenskap;</li><li>strukturera och presentera en bärande matematisk idé såväl muntligt som skriftligt;</li><li>hålla en kort presentation och ge återkoppling på annan presentation</li><li>kritiskt konstruktivt granska andras skriftliga framställan och föra en diskussion om innehållet.</li></ul>",
                "Kursinnehåll": "<p>Introduktion till MATLAB och enklare programmering. Matematisk modellering. Numeriska beräkningar: linjär algebra, avbildningar, ekvationssystem, minsta kvadratproblem, beräkningar med matriser, matrisfaktorisering, kvadratur och ordinära differentialekvationer. Behandling av tillämpningsproblem inom datorgrafik, informationsteknologi, och fysik. Rapportskrivning på svenska. Muntliga redovisningar och återkoppling.&nbsp;</p>",
                "Undervisnings- och arbetsformer": "<p>Undervisningen förmedlas i form av föreläsningar, datorlaborationer, språkseminarier, redovisningar med återkoppling, och resurstillfällen. Ett antal miniprojekt utgör kärnan i kursen. Dessa skall utföras med hjälp av MATLAB, och en rapport skall lämnas in för varje uppgift samt redovisas muntligt. Miniprojekten görs i grupper om två till tre studenter, förutom den sista uppgiften som görs individuellt. Till grupparbetena skall även en skriftlig och muntlig opposition genomföras. Kursen pågår hela vårterminen.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPGC</td><td>Miniprojekt i grupp, skriftlig och muntlig redovisning och opponering</td><td>2 hp</td><td>U, G</td></tr><tr><td>UPGD</td><td>Individuellt miniprojekt, skriftlig och muntlig redovisning</td><td>2 hp</td><td>U, G</td></tr><tr><td>DAK1</td><td>Dugga i datorsal, introduktion till Matlab</td><td>1 hp</td><td>U, G</td></tr><tr><td>DAK2</td><td>Dugga i datorsal, matematik inom AI</td><td>1 hp</td><td>U, G</td></tr></tbody></table><div>Extra examinationstillfälle ges endast i augusti.\n<br>På kursen ges betygen Underkänd/Godkänd. <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Tvågradig skala, U, G",
                "Övrig information": "<p>Påbyggnadskurser:&nbsp;Samtliga kurser inom civilingenjörsutbildningen med ett matematiskt innehåll.&nbsp;</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        }
    },
    "Termin 1": {
        "Period 2": {
            "Objektorienterad programmering": {
                "Kurs": "TND002",
                "Huvudområde": "Datateknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Mark E Dieckmann",
                "Studierektor": "Daniel Nyström",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1N",
                "Rekommenderade förkunskaper": "En grundläggande kurs i programmering",
                "Lärandemål": "<p>Kursen ska ge kunskaper om objektorienterad programutveckling \noch programmering i ett objektorienterat programspråk, Java. Efter kursen ska deltagaren kunna:\n</p><ul>\n<li>skriva enkla program för in- och utmatning av tal och text dels för kommandofönster och dels med dialogrutor.\n</li><li>förklara skillnaden mellan inbyggda typer och klasstyper/objekt  samt skillanden mellan enkla variabler och referensvariabler.\n</li><li>förklara skillnaden mellan instansvariabler och klassvariabler samt skillnaden mellan instansmetoder och klassmetoder.\n</li><li>designa och implementera egna klasser samt använda dem.\n</li><li>använda vanliga standardklasser från Java API.\n</li><li>skriva program för filhantering, särskilt för textfiler.\n</li><li>förklara begreppen arv, polymorfism och dynamisk bindning samt begreppen abstrakt klass och interface.\n</li><li>designa och implementera egna klasshierarkier samt använda dem.\n</li><li>skriva program med enkla grafiska gränssnitt. \n</li><li>förklara begreppet händelsestyrda program. \n</li><li>för ett givet problem utveckla ett objektorienterat program bestående av ett antal klasser samt dokumentera detta i UML.\n</li></ul><p></p>",
                "Kursinnehåll": "<p>Programspråket Java, variabler och datatyper,  in- och utmatning, styrsatser. <br>Klasser och objekt,  instansvariabler och instansmetoder, klassvariabler och klassmetoder. Objektorienterad programutveckling, klassdiagram och UML.<br>Standardklasser och Java API.  Ärvning, subklasser och superklasser, polymorfism och dynamisk bindning, abstrakta klasser och interface.<br>Strömmar och filer, felhantering. Program med grafiska användargränssnitt, grafiska komponenter och layouthanterare, händelsestyrda program.</p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar, lektioner och laborationer.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>LAB1</td><td>Laborationskurs</td><td>3 hp</td><td>U, G</td></tr><tr><td>DAT1</td><td>Tentamen med datorstöd</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser: Programmering i C++</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Linjär algebra": {
                "Kurs": "TNA002",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "George Baravdish",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1F",
                "Rekommenderade förkunskaper": "Matematisk grundkurs",
                "Lärandemål": "<p>Att ge sammanhållen begreppsram för geometrisk och algebraisk teknik med tillämpningar inom analys, datorgrafik, elektroteknik, reglerteknik, linjär optimering m fl. ämnen. Vidare ingår att utveckla förmågan att använda det matematiska språket, skriftligt och muntligt. Därför är det nödvändigt för deltagaren att kunna\n</p><ul>\n<li> lösa ekvationssystem\n</li><li> arbeta med skalärprodukt och vektorprodukt för geometriska vektorer\n</li><li> räkna med matriser och determinanter\n</li><li> räkna med vektorer och koordinater i ett vektorrum\n</li><li> bestämma matrisen för en linjär avbildning samt beräkna nollrum och värderum\n</li><li> bestämma ON-baser i euklidiska rum\n</li><li> projicera ortogonalt på underrum och använda minstakvadrat-metoden\n</li><li> använda basbyte för att lösa problem\n</li><li> bestämma och använda egenvärden och egenvektorer i olika problem\n</li><li> använda spektralsatsen i olika situationer\n</li><li> bestämma kanoniska baser till kvadratiska former och utnyttja detta för att lösa geometriska problem\n</li><li> lösa system av linjära ordinära differentialekvationer\n</li><li>utvärdera resultat och delresultat, för att verifiera att dessa är korrekta eller rimliga \n</li></ul><p></p>",
                "Kursinnehåll": "<p>Linjära ekvationssystem.Vektorgeometri. Räta linjer och plan. Matriser. Determinanter. Vektorrum och underrum. Euklidiska rum. Bas och dimension. Gram-schmidts ortogonaliserigsprocess. Avstånd och approximation. Linjära avbildningar. Matrisframställning. Basbyte. Bas- och koordinatsamband. Samband mellan avbildningsmatriser. Egenvärden och egenvektorer. Spektralsatsen. Diagonalisering av matriser med tillämpningar på kvadratiska former. System av linjära ordinära differentialekvationer.</p>",
                "Undervisnings- och arbetsformer": "<p>Undervisningen ges i form av föreläsningar och lektioner.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>6 hp</td><td>U, 3, 4, 5</td></tr><tr><td>KTR3</td><td>Kontrollskrivning, bonuspoäng</td><td>0 hp</td><td>U, G</td></tr><tr><td>KTR4</td><td>Kontrollskrivning, bonuspoäng</td><td>0 hp</td><td>U, G</td></tr><tr><td>UPG3</td><td>Frivilligt nätbaserat kursmoment, bonuspoäng</td><td>0 hp</td><td>U, G</td></tr></tbody></table><div><p>En samlad poängsumma från KTR3 och KTR4 ger graderad bonuspoäng på tentamen.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser:&nbsp;Tillämpad matematik i teknik och naturvetenskap, Analys, Flervariabelanalys, Vektoranalys, Transformteori.</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 1,2": {
            "Digitala medier": {
                "Kurs": "TNM088",
                "Huvudområde": "Medieteknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": null,
                "Examinator": null,
                "Studierektor": null,
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1N",
                "Rekommenderade förkunskaper": null,
                "Lärandemål": "<p>Efter fullgjord kurs ska kursdeltagaren ha fått en inledande kunskap inom området digitala medier. Inom ett område, som studenten själv väljer, erhålls en mer fördjupad kunskap. Efter kursen skall studenten vara bekant med en projektmodell som hjälpmedel och kunna grunderna i enklare rapportskrivning. Vidare skall studenten ha stiftat bekantskap med frågeställningar som rör etik, informationssökning och källkritik. Efter fullgjord kurs ska kursdeltagaren kunna:</p>\n\n<ul>\n\t<li>förklara bildreproduktionens tekniska förutsättningar.</li>\n\t<li>beskriva de tekniska förutsättningarna för ljud- och videoinspelning.</li>\n\t<li>använda verktyg för grundläggande bildbehandling, videoproduktion, publicering och grafik.</li>\n\t<li>tillämpa grundläggande kunskaper inom typografi och grafisk design.</li>\n\t<li>analysera dramaturgins roll i ett filmiskt berättande.</li>\n\t<li>reflektera över etiska frågeställningar i en fallbeskrivning.</li>\n\t<li>planera och genomföra projekt genom att tillämpa projektmodellen som verktyg i ett projektarbete.</li>\n\t<li>tillämpa grunderna för rapportskrivning enligt angivna förutsättningar.</li>\n\t<li>presentera en uppgift muntligt inför publik enligt angivna förutsättningar.</li>\n</ul>",
                "Kursinnehåll": "<p>Kursen bygger på ämnesblocken bild, grafik, film/video, ljud och publicering. Kursen ingår i språkstrimman där övningar i muntlig och skriftlig presentation ingår.</p>",
                "Undervisnings- och arbetsformer": "<p>Under Ht1 består utbildningen av veckovisa teman i form av föreläsningar, seminarier, grupparbeten och laborationer. Under Ht2 består kursen av främst projektarbete i grupper om 4-6 studenter.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG2</td><td>Projektredovisning, språkstrimma</td><td>1 hp</td><td>U, G</td></tr><tr><td>PRA2</td><td>Projektuppgift</td><td>2 hp</td><td>U, G</td></tr><tr><td>UPG1</td><td>Inlämningsuppgift, språkstrimma</td><td>2 hp</td><td>U, G</td></tr><tr><td>KTR1</td><td>Dugga</td><td>1 hp</td><td>U, G</td></tr></tbody></table><div>På kursen ges betygen Underkänd/Godkänd.</div>",
                "Betygsskala": "Tvågradig skala, äldre version, U, G",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        },
        "Period 1": {
            "Programmering grk": {
                "Kurs": "TND012",
                "Huvudområde": "Datateknik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Aida Nordman",
                "Studierektor": "Camilla Forsell",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1N",
                "Rekommenderade förkunskaper": "<p>Förkunskaper: (gäller studerande antagna till program som kursen ges inom, se 'För:' ovan)<br>\n<br>\nOBS! Tillträdeskrav för icke programstudenter omfattar vanligen också tillträdeskrav för programmet och ev. tröskelkrav för progression inom programmet, eller motsvarande.<br>\n&nbsp;</p>",
                "Lärandemål": "<p>Kursen skall ge grundläggande kunskaper om hur man konstruerar program i ett högnivåspråk, C++. For att bli godkänd på kursen ska studenten ha uppnått följande lärandemål.</p><ol><li>Förklara vad som händer då ett program körs utifrån programmets källkod.</li><li>Beskriva begreppen kompilering, källkod, objektkod, exekverbar kod.</li><li>Använda datatyper för heltal, flyttal, och Booleans</li><li>Använda styrsatser för val (selektion)&nbsp;</li><li>Använda styrsatser för upprepning (iteration).</li><li>Använda sekvensdata i egna program.</li><li>Skriva program som använder definierade datatyper.</li><li>Skriva egna underprogram och kunna använda olika parametrar och returvärden.</li><li>Dela upp ett program i lämpliga underprogram, där varje underprogram utför en uppgift.</li><li>Skriva program för enkel filhantering.</li><li>Använda funktionaliteten hos några grundläggande standardbibliotek i C++.</li><li>Utifrån ett problem skriva ett program enligt god programmeringspraxis.</li></ol><p>&nbsp;</p>",
                "Kursinnehåll": "<p>Vad är ett program och hur programmerar man?<br>\nVariabler, deklaration, och aritmetiska uttryck.<br>\nStyrsatser: selektion och iteration.<br>\nSekvenser: sortering och sökning.<br>\nFunktioner. Funktioner som inte returnerar något värde.<br>\nParameteröverföring: call-by-value och call-by-reference.<br>\nFunktionsdeklarationer. Uppdelning av program<br>\nRäckvidd och synlighet.<br>\nPosttyper (struct).<br>\nIn- och utmatning. Enkel filhantering.<br>\nGrundläggande standardbiblioteket i C++.</p>",
                "Undervisnings- och arbetsformer": "<p>Föreläsningar, lektioner och laborationer.</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>UPG1</td><td>Frivillig uppgift</td><td>0 hp</td><td>U, G</td></tr><tr><td>LAB1</td><td>Laborationskurs</td><td>3 hp</td><td>U, G</td></tr><tr><td>DAT1</td><td>Tentamen vid dator</td><td>3 hp</td><td>U, 3, 4, 5</td></tr></tbody></table><div><p>Den frivilliga uppgiften består av tre duggor. Godkänt på samtliga tre duggor tillgodoräknas till den del av datortentan som ger betyg 3. Dessa duggor räknas på alla ordinarie tentamina och omtentamina t.o.m. nästkommande Augusti efter avslutad kursomgång. Datortentan innehåller tre delar. Godkänt på del 1 ger betyg 3. För högre betyg måste således övriga delar på datortentan genomföras med godkänt resultat.</p> <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": "<p>Påbyggnadskurser: Objektorienterad programmering (MT), Fortsättningskurser i programmering (ED, KTS).&nbsp;<br>&nbsp;</p>",
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            },
            "Matematisk grundkurs": {
                "Kurs": "TNA001",
                "Huvudområde": "Matematik, Tillämpad matematik",
                "Utbildningsnivå": "Grundnivå",
                "Kurstyp": "Programkurs",
                "Examinator": "Claes Algström",
                "Studierektor": "George Baravdish",
                "Undervisningstid": null,
                "Fördjupningsnivå": "G1N",
                "Rekommenderade förkunskaper": null,
                "Lärandemål": "<p>Kursen syftar till att bidra till en positiv start på universitetsstudierna, både då det gäller en social tillhörighet samt att få en repetition av matematik från tidigare studier. Dessutom skall några matematiska begrepp, som för många är nya, introduceras. Ett viktigt mål är att systematiskt ge utvecklingsmöjligheter inom vissa områden genom att använda varierat arbetssätt och flera examinationsmoment. Detta skall bl.a. bidra till att förbättra den studerandes förmåga att reflektera över det egna lärandet och ge förtrogenhet med att arbeta i en grupp, som skall ses som en resurs där goda samarbetsformer uppmuntras.\n<br>Inom ramen för kursens innehåll skall den studerande efter genomgången kurs:\n\n</p><li>kunna visa en elementär förmåga att skriva, läsa och tala det matematiska språket.\n</li><li>kunna visa god algebraisk räkneförmåga med reella tal och komplexa tal.\n</li><li>kunna använda grundläggande begrepp inom funktionsläran, såsom definitions- och värdemängd, sammansatta funktioner, inverser och deras viktigaste egenskaper.\n</li><li>kunna elementära funktioners egenskaper samt använda detta i problemlösning.\n</li><li>kunna ställa upp och lösa ekvationer och olikheter.\n</li><li>kunna arbeta med aritmetiska och geometriska talföljder och summor samt binomialsatsen.\n</li><li>visa att man förstått principen för induktionsbevis och/eller genomföra enkla sådana bevis.\n</li><li>ha grundläggande kunskaper i vektorgeometri i två och tre dimensioner och där bl.a. kunna lösa problem som kräver kunskaper i lösning av linjära ekvationssystem, skalärprodukt samt ekvationer för linjer och plan.\n</li><li>kunna redogöra för innehållet i några centrala definitioner och enkla bevis.\n<p></p>",
                "Kursinnehåll": "<p>Räkning med algebraiska uttryck, olikheter, absolutbelopp. Ekvationslösning. Funktioner och funktionskurvor. Definition av de elementära funktionerna: naturliga logaritmfunktionen, exponential- och potensfunktioner, trigonometriska funktioner och arcusfunktionerna, komplexa exponentialfunktionen. Undersökning av de elementära funktionernas egenskaper. Grundläggande principer för logiska resonemang. Induktionsbevis. Koordinatsystem i planet, polära koordinater, ekvationer för räta linjer och cirklar. Komplexa talplanet, komplexa tal i polär form, Eulers formler. Talföljder och summor, binomialsatsen. Grundläggande vektorgeometri, ekvationer för linjer och plan i tre dimensioner.</p>",
                "Undervisnings- och arbetsformer": "<p>Undervisningen och stödet till kursdeltagarna sker i form av föreläsningar, lektioner och handledning av lärare. En stor del av arbetet, inklusive viss examination, kommer att ske i grupper (se nedan).</p>",
                "Examination": "<table class=\"exam-codes-table\"><tbody><tr><td>TEN1</td><td>Skriftlig tentamen</td><td>4.5 hp</td><td>U, 3, 4, 5</td></tr><tr><td>KTR2</td><td>Frivilliga kontrollskrivningar</td><td>0 hp</td><td>U, G</td></tr><tr><td>UPG2</td><td>Inlämningsuppgifter och muntliga redovisningar</td><td>1.5 hp</td><td>U, G</td></tr></tbody></table><div>Kontrollskrivningarna är bonusgrundande på alla ordinarie tentamina och omtentamina t.o.m. nästkommande augusti. <p>Betyg på delmoment/modul beslutas i enlighet med de bedömningskriterier som presenteras vid kursstart.</p></div>",
                "Betygsskala": "Fyrgradig skala, LiU, U, 3, 4, 5",
                "Övrig information": null,
                "Påbyggnadskurser": null,
                "Institution": "Institutionen för teknik och naturvetenskap",
                "Kurslitteratur": null
            }
        }
    }
}