{
    "programs": [
        {
            "name": "Civilingenjörsprogram i kommunikation",
            "credits": "transport och samhälle, 300 hp",
            "url": "https://studieinfo.liu.se/program/6CKTS/5161#curriculum",
            "semesters": [
                {
                    "name": "Termin 1 HT 2022",
                    "courses": [
                        {
                            "name": "Matematisk grundkurs",
                            "course_code": "TNA001",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNA001/ht-2022",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Claes Algström",
                                "study_director": "George Baravdish",
                                "scheduled_hours": "89 h",
                                "self_study_hours": "71 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen syftar till att bidra till en positiv start på universitetsstudierna, både då det gäller en social tillhörighet samt att få en repetition av matematik från tidigare studier. Dessutom skall några matematiska begrepp, som för många är nya, introduceras. Ett viktigt mål är att systematiskt ge utvecklingsmöjligheter inom vissa områden genom att använda varierat arbetssätt och flera examinationsmoment. Detta skall bl.a. bidra till att förbättra den studerandes förmåga att reflektera över det egna lärandet och ge förtrogenhet med att arbeta i en grupp, som skall ses som en resurs där goda samarbetsformer uppmuntras.Inom ramen för kursens innehåll skall den studerande efter genomgången kurs:",
                                "course_content": "Räkning med algebraiska uttryck, olikheter, absolutbelopp. Ekvationslösning. Funktioner och funktionskurvor. Definition av de elementära funktionerna: naturliga logaritmfunktionen, exponential- och potensfunktioner, trigonometriska funktioner och arcusfunktionerna, komplexa exponentialfunktionen. Undersökning av de elementära funktionernas egenskaper. Grundläggande principer för logiska resonemang. Induktionsbevis. Koordinatsystem i planet, polära koordinater, ekvationer för räta linjer och cirklar. Komplexa talplanet, komplexa tal i polär form, Eulers formler. Talföljder och summor, binomialsatsen. Grundläggande vektorgeometri, ekvationer för linjer och plan i tre dimensioner.",
                                "teaching_methods": "Undervisningen och stödet till kursdeltagarna sker i form av föreläsningar, lektioner och handledning av lärare. En stor del av arbetet, inklusive viss examination, kommer att ske i grupper (se nedan).",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "4.5 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "UPG1",
                                    "name": "Inlämningsuppgifter och muntliga redovisningar",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "KTR1",
                                    "name": "Frivilliga kontrollskrivningar",
                                    "credits": "0 hp",
                                    "grading": "D"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Forsling-Neymark",
                                    "title": "Matematisk analys, en variabel",
                                    "edition": "Matematisk analys, en variabel 2",
                                    "chapters": "Kap1-2"
                                },
                                {
                                    "type": "Kompendier",
                                    "title": "Kompletterande material (utges av institutionen)"
                                }
                            ]
                        },
                        {
                            "name": "Programmering grk",
                            "course_code": "TND012",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TND012/ht-2022",
                            "overview": {
                                "main_subject": "Datateknik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Aida Nordman",
                                "study_director": "Camilla Forsell",
                                "scheduled_hours": "68 h",
                                "self_study_hours": "92 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen skall ge grundläggande kunskaper om hur man konstruerar program i ett högnivåspråk, C++. For att bli godkänd på kursen ska studenten ha uppnått följande lärandemål. Förklara vad som händer då ett program körs utifrån programmets källkod. Beskriva begreppen kompilering, källkod, objektkod, exekverbar kod. Använda datatyper för heltal, flyttal, textsträngar, sekvenser och poster uppbyggda av delkomponenterna av olika typ. Använda styrsatser för val (selektion) och upprepning (iteration) i egna program. Skriva egna underprogram och kunna använda olika parametrar och returvärden. Utifrån ett problem skriva ett program. Dela upp ett program i lämpliga underprogram, där varje underprogram utför en uppgift. Använda funktionaliteten hos några grundläggande standardbibliotek i C++. Skriva program för enkel filhantering.",
                                "course_content": "Vad är ett program och hur programmerar man?Variabler, deklaration, och aritmetiska uttryck.Styrsatser: selektion och iteration.Sekvenser: sortering och sökning.Funktioner. Funktioner som inte returnerar något värde.Parameteröverföring: call-by-value och call-by-reference.Funktionsdeklarationer. Uppdelning av programRäckvidd och synlighet.Posttyper (struct).In- och utmatning. Enkel filhantering.Grundläggande standardbiblioteket i C++.",
                                "teaching_methods": "Föreläsningar, lektioner och laborationer.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "DAT1",
                                    "name": "Tentamen vid dator",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laborationskurs",
                                    "credits": "3 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG1",
                                    "name": "Frivillig uppgift",
                                    "credits": "0 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Transportsystem",
                            "course_code": "TNK044",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK044/ht-2022",
                            "overview": {
                                "main_subject": "Transportsystem",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Mats Janné",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "51 h",
                                "self_study_hours": "109 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen avser att ge en introduktion till hela utbildningsprogrammet Kommunikation, transport och samhälle (KTS), genom att både presentera transportsystemets historiska utveckling och nuläget inom branschen, samt ge exempel på frågeställningar som en civilingenjör inom KTS-området kan arbeta med. Särskild vikt läggs vid aspekter kopplade till samhällsutveckling, etik och genus. Kursen introducerar studenten till projektbaserat arbete och behandlar litteratursökning, tekniskt rapportskrivande och muntlig redovisning i projektform. Muntlig och skriftlig argumentation behandlas i en särskild övning.Efter kursen skall studenten kunna: ge exempel på arbetsuppgifter för en civilingenjör inom KTS-området. söka och tillägna sig information om en frågeställning inom KTS-området och förstå olika förhållningssätt. diskutera samhälleliga och etiska aspekter kring såväl transportsystemets utveckling som ingenjörsyrket. presentera en frågeställning inom KTS-området muntligt och skriftligt i grupp. argumentera muntligt och skriftligt för olika ståndpunkter i en aktuell fråga inom KTS-området.",
                                "course_content": "Kursen består av flera integrerade delmoment, som hålls samman av en serie ämnesspecifika föreläsningar, som behandlar olika frågeställningar inom KTS-området. Parallellt med detta genomförs en projektuppgift i grupp, som behandlar en frågeställning inom trafik, transport och/eller logistik. Dessutom genom förs en mindre argumentationsuppgift individuellt.",
                                "teaching_methods": "Undervisningen genomförs i form av föreläsningar, seminarier, arbete i grupp och individuellt arbete. Flera av föreläsningarna ges av gäster som är yrkesverksamma inom KTS-området. Deltagande på gästföreläsningar är obligatoriskt. Under kursen läses en roman med koppling till ingenjörsyrket, och som diskuteras vid ett avslutande litteraturseminarium. Därutöver ges föreläsningar som behandlar språkliga färdigheter. Muntlig presentation och argumentation examineras vid seminarier. Kursen pågår hela höstterminen.",
                                "grade_scale": "Tvågradig skala, äldre version, U, G",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "UPG6",
                                    "name": "Projektuppgift med muntlig och skriftlig redovisning (språkstrimma)",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG2",
                                    "name": "Individuell uppgift med muntlig och skriftlig redovisning",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG7",
                                    "name": "Aktivt deltagande i föreläsningsserie och litteraturseminarium",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG5",
                                    "name": "Projektuppgift med muntlig och skriftlig redovisning (teknikinnehåll)",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Guillou, Jan,  (2011)",
                                    "title": "Brobyggarna",
                                    "edition": "Brobyggarna ISBN: 9789164203199 Stockholm: Piratförlaget, 2011; Det stora århundradet; 1"
                                },
                                {
                                    "type": "Böcker",
                                    "authors": "Merkel, Magnus, Önnegren, Britta, Andersson, Ulrika,  (2011)",
                                    "title": "Lathund för rapportskrivning. [Elektronisk resurs]",
                                    "edition": "Lathund för rapportskrivning. [Elektronisk resurs] Linköping, Linköpings universitet, 2011"
                                },
                                {
                                    "type": "Övrigt",
                                    "title": "Komletterande material delas ut under kursen."
                                }
                            ]
                        },
                        {
                            "name": "Linjär algebra",
                            "course_code": "TNA002",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNA002/ht-2022",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "George Baravdish",
                                "study_director": "George Baravdish",
                                "scheduled_hours": "87 h",
                                "self_study_hours": "73 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Att ge sammanhållen begreppsram för geometrisk och algebraisk teknik med tillämpningar inom analys, datorgrafik, elektroteknik, reglerteknik, linjär optimering m fl. ämnen. Vidare ingår att utveckla förmågan att använda det matematiska språket, skriftligt och muntligt. Därför är det nödvändigt för deltagaren att kunna lösa ekvationssystem arbeta med skalärprodukt och vektorprodukt för geometriska vektorer räkna med matriser och determinanter räkna med vektorer och koordinater i ett vektorrum bestämma matrisen för en linjär avbildning samt beräkna nollrum och värderum bestämma ON-baser i euklidiska rum projicera ortogonalt på underrum och använda minstakvadrat-metoden använda basbyte för att lösa problem bestämma och använda egenvärden och egenvektorer i olika problem använda spektralsatsen i olika situationer bestämma kanoniska baser till kvadratiska former och utnyttja detta för att lösa geometriska problem lösa system av linjära ordinära differentialekvationer utvärdera resultat och delresultat, för att verifiera att dessa är korrekta eller rimliga",
                                "course_content": "Linjära ekvationssystem.Vektorgeometri. Räta linjer och plan. Matriser. Determinanter. Vektorrum och underrum. Euklidiska rum. Bas och dimension. Gram-schmidts ortogonaliserigsprocess. Avstånd och approximation. Linjära avbildningar. Matrisframställning. Basbyte. Bas- och koordinatsamband. Samband mellan avbildningsmatriser. Egenvärden och egenvektorer. Spektralsatsen. Diagonalisering av matriser med tillämpningar på kvadratiska former. System av linjära ordinära differentialekvationer.",
                                "teaching_methods": "Undervisningen ges i form av föreläsningar och lektioner.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "6 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "KTR1",
                                    "name": "Kontrollskrivning, bonuspoäng",
                                    "credits": "0 hp",
                                    "grading": "D"
                                },
                                {
                                    "code": "UPG2",
                                    "name": "Frivilligt nätbaserat kursmoment, bonuspoäng",
                                    "credits": "0 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "KTR2",
                                    "name": "Kontrollskrivning, bonuspoäng",
                                    "credits": "0 hp",
                                    "grading": "D"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Kompendier",
                                    "title": "Kompendium utgivet vid ITN."
                                }
                            ]
                        },
                        {
                            "name": "Geografiska informationssystem",
                            "course_code": "TNK046",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK046/ht-2022",
                            "overview": {
                                "main_subject": "Datateknik,, Transportsystem",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Carl Henrik Häll",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "52 h",
                                "self_study_hours": "108 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Det övergripande syftet med kursen är att ge grundläggande kunskaper om geografiska databaser och ingenjörsverktyget GIS. Dessutom ges en introduktion till generell databasteknik. Efter kursen skall studenten förstå relationsmodellen och frågespråket SQL känna till  grunderna inom geografisk informationsteknik känna till ett flertal analysmetoder inom GIS kunna välja och tillämpa rätt analymetod för olika problemtyper kunna arbeta självständigt med GIS-programvara och kunna redovisa resultat av GIS-analyser i en tydlig och väl strukturerad rapport",
                                "course_content": "Datastrukturer och datamodellering. Relationsdatabaser och frågespråket SQL. Rumsliga datastrukturer. Geografiska databaser. Kartografisk presentation. Datainsamling till GIS via fjärranalys och geodetisk mätning. Geografisk analys. Tillämpningar inom kommunikations- och transportområdet.",
                                "teaching_methods": "Undervisningen består av föreläsningar, lektioner och laborationer med inlämningsuppgifter. Laborationerna har obligatoriskt deltagande.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laboration",
                                    "credits": "3 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Harrie, Lars,  (2013)",
                                    "title": "Geografisk informationsbehandling : teori, metoder och tillämpningar",
                                    "edition": "Geografisk informationsbehandling : teori, metoder och tillämpningar ISBN: 9789144088778 Lund : Studentlitteratur, 2013"
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Termin 2 VT 2023",
                    "courses": [
                        {
                            "name": "Industriell ekonomi",
                            "course_code": "TEIE53",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TEIE53/vt-2023",
                            "overview": {
                                "main_subject": "Industriell, ekonomi",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Martin Larsson",
                                "study_director": "Daniel Ellström",
                                "scheduled_hours": "48 h",
                                "self_study_hours": "112 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursens syfte är att ge studenterna kunskap och förståelse om hur företag fungerar och fattar beslut, med speciellt fokus på industriella företag (företag som ofta tillverkar produkter och säljer till andra företag). Kursen ger studenterna en orientering i de sammanhang företag verkar, hur företag sätter priser, hur företag bokför och redovisar, och hur företag kan analyseras från perspektiv såsom nyckeltal eller hållbarhet. Efter kursen ska deltagarna kunna: beskriva och förklara den verksamhet ett företag bedriver, hur marknaden fungerar, branschtillhörighet och vilka konkurrensstrategier som kan användas, beskriva, förklara, tillämpa enklare produkt- och investeringskalkyler, beskriva och förklara bokföringens grundläggande principer, förklara och analysera årsredovisningar samt beräkna nyckeltal för att analysera räkenskaperna. beskriva och analysera ett företags ekonomiska och marknadsmässiga position. kommunicera företagsekonomisk information och relaterade analyser, följa med i och bidra i diskussioner gällande grundläggande industriell ekonomi i relation till exempelvis hållbarhet eller automatiseringen och digitaliseringens effekter på företaget.",
                                "course_content": "Den aktuella situationen för företag i Sverige och omvärlden. Samhällstrender såsom hållbarhet, digitalisering, och automatisering. Marknader och prisbildning. Branschstruktur, konkurrensförhållanden och företagsstrategier. Redovisning och räkenskapsanalys. Produkt- och investeringskalkylering. Organisation och marknadsföring.",
                                "teaching_methods": "Föreläsningarna ger bakgrund till ekonomiska villkor för både företag och samhälle. Lektioner och seminarium ägnas åt problemlösning och praktikfallsdiskussioner. I kursen ingår ett projektarbete som utgör en analys av ett existerande företag alt. analys ur ett samhällsekonomiskt perspektiv.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för ekonomisk och industriell utveckling"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "4 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "PRA1",
                                    "name": "Projektuppgift som genomförs i grupp",
                                    "credits": "2 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Analys I",
                            "course_code": "TNA003",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNA003/vt-2023",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "George Baravdish",
                                "study_director": "George Baravdish",
                                "scheduled_hours": "84 h",
                                "self_study_hours": "76 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Att du som student skall tillägna dig den förtrogenhet med matematiska begrepp, resonemang och samband som ryms inom envariabelanalys samt den färdighet i kalkyl och problemlösning som behövs för de fortsatta studierna. Efter fullgjord kurs skall du kunna läsa och tolka matematisk text citera och förklara definitioner av begrepp såsom lokalt extremvärde, gränsvärde, kontinuitet, derivata, primitiv funktion och integral citera, förklara och använda centrala satser såsom huvudsatsen, insättningsformeln, medelvärdessatserna, satsen om mellanliggande värde samt satsen om största och minsta värde använda räknelagar för gränsvärden, derivator, primitiva funktioner och integraler genomföra funktionsundersökningar, t ex med hjälp av derivator, gränsvärden och egenskaper hos elementära funktioner, och därigenom kunna dra slutsatser om funktioners egenskaper använda standardtekniker för att bestämma primitiva funktioner och bestämda integraler göra undersökning av generaliserade integraler med hjälp av primitiv funktion göra jämförelser mellan summor och integraler utföra kontroller av resultat och delresultat, för att verifiera att dessa är korrekta eller rimliga",
                                "course_content": "Funktioner av en reell variabel. Gränsvärde och kontinuitet. Derivator. Deriveringsregler. De elementära funktionernas derivator. Egenskaper hos deriverbara funktioner. Derivatans betydelse för monotonicitet. Kurvritning, tangent och normal, asymptoter. Lokala och globala maxima och minima. Derivator av högre ordning. Bestämning av primitiva funktioner. Partiell integration, variabelbyte. Primitiver till rationella funktioner, funktioner innehållande vissa rotuttryck och trigonometriska funktioner. Riemannintegralen: definition och egenskaper. Integration av kontinuerliga funktioner. Samband mellan bestämd integral och primitiv funktion. Integrationsmetoder. Generaliserade integraler. Jämförelser mellan summor och integraler.",
                                "teaching_methods": "Undervisningen ges i form av föreläsningar och lektioner eller enbart lektioner.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "En skriftlig tentamen",
                                    "credits": "6 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "KTR1",
                                    "name": "Frivilliga kontrollskrivningar",
                                    "credits": "0 hp",
                                    "grading": "D"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Tillämpad matematik i teknik och naturvetenskap",
                            "course_code": "TNA005",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNA005/vt-2023",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Berkant Savas",
                                "study_director": "George Baravdish",
                                "scheduled_hours": "37 h",
                                "self_study_hours": "123 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen avser att utgöra en brygga mellan de grundläggande matematikkurserna och kurser inom teknik och naturvetenskap. Studenterna skall vänja sig vid att använda matematiska resultat och beräkningsprogram, som MATLAB, för att studera, analysera, och till viss del lösa realistiska problem från tillämpningar. Efter avslutad kurs skall studenten kunna: matematiskt modellera vissa problemställningar inom informationsteknologiska och fysikaliska tillämpningar; reflektera över en matematisk modells förtjänster och begränsningar; använda MATLAB som ett naturligt redskap för att lösa beräkningsproblem, däribland: behandla matriser och linjära ekvationssystem, teckna och lösa minstakvadratproblem, lösa ordinära differentialekvationer, utföra numerisk integrering; välja lämpliga metoder för att studera matematiska frågeställningar som uppstår i olika sammanhang inom teknik och naturvetenskap; strukturera och presentera en bärande matematisk idé såväl muntligt som skriftligt; hålla en kort presentation och ge återkoppling på annan presentation, båda momenten på engelska; kritiskt konstruktivt granska andras skriftliga framställan och föra en diskussion om innehållet.",
                                "course_content": "Introduktion till MATLAB och enklare programmering. Matematisk modellering. Numeriska beräkningar: linjär algebra, avbildningar, ekvationssystem, minsta kvadratproblem, beräkningar med matriser, matrisfaktorisering, kvadratur och ordinära differentialekvationer. Behandling av tillämpningsproblem inom datorgrafik, informationsteknologi, och fysik. Rapportskrivning på svenska. Muntliga redovisningar och återkoppling (på svenska och engelska). Repetition av engelsk grammatik och meningsuppbyggnad.",
                                "teaching_methods": "Undervisningen förmedlas i form av föreläsningar, datorlaborationer, språkseminarier, redovisningar med återkoppling, och resurstillfällen. Ett antal miniprojekt utgör kärnan i kursen. Dessa skall utföras med hjälp av MATLAB, och en rapport skall lämnas in för varje uppgift samt redovisas muntligt. Miniprojekten görs i grupper om två till tre studenter, förutom den sista uppgiften som görs individuellt. Till grupparbetena skall även en skriftlig och muntlig opposition genomföras. Aktiv medverkan förutsätts på språkseminarier. Kursen pågår hela vårterminen och i kursen ingår en del av kommunikationsstrimman i engelska för ED, KTS och MT.",
                                "grade_scale": "Tvågradig skala, U, G",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "UPGB",
                                    "name": "Muntlig presentation och återkoppling på engelska",
                                    "credits": "0.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPGA",
                                    "name": "Aktiv medverkan med inlämning på språkseminarier",
                                    "credits": "0.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG9",
                                    "name": "Individuell datordugga som introduktion till Matlab",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG5",
                                    "name": "Miniprojekt i grupp, skriftlig o muntlig redovisning",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG7",
                                    "name": "Miniprojekt i grupp; skriftlig och muntlig redovisning och opponering",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG6",
                                    "name": "Individuellt miniprojekt, skriftlig och muntlig redovisning",
                                    "credits": "2 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Forsling, Göran, Neymark, Mats,  (2011)",
                                    "title": "Matematisk analys : en variabel.",
                                    "edition": "Matematisk analys : en variabel. 2., [utök. och rev.] uppl. Stockholm : Liber, 2011 ISBN: 9789147100231 Godtycklig utgåva"
                                },
                                {
                                    "type": "Böcker",
                                    "authors": "Jönsson, Per,  (2020)",
                                    "title": "MATLAB-beräkningar inom teknik och naturvetenskap : med symbolisk matematik.",
                                    "edition": "MATLAB-beräkningar inom teknik och naturvetenskap : med symbolisk matematik. Fjärde upplagan Lund : Studentlitteratur, [2020] ISBN: 9789144134246"
                                },
                                {
                                    "type": "Kompendier",
                                    "title": "Baravdish, George, Linjär algebra TNA002 Kompendium utgivet av institutionen, godtycklig utgåva."
                                },
                                {
                                    "type": "Övrigt",
                                    "title": "Kompletterande materiel tillgängligt från kurshemsidan"
                                }
                            ]
                        },
                        {
                            "name": "Analys II",
                            "course_code": "TNA004",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNA004/vt-2023",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "George Baravdish",
                                "study_director": "George Baravdish",
                                "scheduled_hours": "70 h",
                                "self_study_hours": "90 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Att du som student skall tillägna dig den förtrogenhet med matematiska begrepp, resonemang och samband som ryms inom envariabelsanalys samt den färdighet i kalkyl och problemlösning som behövs för de fortsatta studierna. Efter fullgjord kurs skall du kunna läsa och tolka matematisk text förklara Taylors formel och begreppen numerisk serie, potensserie och konvergens av serie teckna uttryck för, och beräkna, geometriska storheter såsom plan area, kurvlängd, rotationsvolym och rotationsarea hantera differentialekvationer (1:a ordingens linjära, separabla och högre ordningens linjära med konstanta koefficienter) samt integralekvationer och serielösningar använda Taylorutvecklingar för att approximera funktioner med polynom, undersöka gränsvärden, beräkna närmevärden och avgöra lokala egenskaper genomföra konvergensundersökningar av generaliserade integraler, numeriska serier och potensserier utföra kontroller av resultat och delresultat, för att verifiera att dessa är korrekta eller rimliga",
                                "course_content": "Tillämpningar av integraler - Generaliserade integraler: definition och beräkningar, uppskattning av summor, area av plana ytor, kurvlängd, volym av rotationskroppar, area av rotationsytor, massa och tyngdpunkt. Taylors och Maclaurins formler. Maclaurinutveckling av elementära funktioner. Olika former på resttermen: Lagrange och ordo. Tillämpningar bl a på feluppskattning vid approximationer och beräkning av gränsvärden. Ordinära differentialekvationer. Första ordningens linjära och separabla ekvationer. Integralekvationer. Linjära ekvationer av högre ordning med konstanta koefficienter. Generaliserade integraler: konvergensundersökning, absolutkonvergens. Numeriska serier: konvergensundersökning, absolutkonvergens, Leibniz kriterium. Potensserier, serielösning till differentialekvationer.",
                                "teaching_methods": "Undervisningen ges i form av föreläsningar och lektioner.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "KTR1",
                                    "name": "Frivilliga duggor",
                                    "credits": "0 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "TEN1",
                                    "name": "En skriftlig tentamen",
                                    "credits": "6 hp",
                                    "grading": "U, 3, 4, 5"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Telekommunikationssystem",
                            "course_code": "TNK040",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK040/vt-2023",
                            "overview": {
                                "main_subject": "Elektroteknik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Erik Bergfeldt",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "48 h",
                                "self_study_hours": "112 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Deltagarna ska efter avslutad kurs kunna: Identifiera de vanligaste komponenterna och funktionerna i ett kommunikationssystem Förklara grundläggande funktioner och begrepp inom digital kommunikation Redogöra för skillnader i egenskaper för olika kommunikationssystem Jämföra och förklara användningsområden för olika typer av kommunikationssystem Härleda beteckningar, komponenter, tekniker och funktioner till rätt nivå i OSI- samt TCP/IP-modellen",
                                "course_content": "Kursen fokuserar på grundläggande funktioner, principer och begrepp inom tele- och datakommunikation, prestandaegenskaper hos system/nätverk, tekniska lösningar för att hantera olika kommunikationsutmaningar m.m.",
                                "teaching_methods": "Kursen består av föreläsningar, gruppövningar, handledningsmöten och laborationer/projekt. Inspelade moment och/eller användning av digitala verktyg kan förekomma av pedagogiska eller praktiska skäl.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "MUN1",
                                    "name": "En muntlig tentamen",
                                    "credits": "4.5 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "En laborationskurs",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Stallings, William, Manna, Moumita Mitra,  (2014)",
                                    "title": "Data and computer communications",
                                    "edition": "Data and computer communications 10. ed. Harlow : Pearson, cop. 2014 ISBN: 1292014385, 9781292014388"
                                },
                                {
                                    "type": "Övrigt",
                                    "title": "Kompletterande material som tillgängliggörs via kurshemsidan"
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Termin 3 HT 2023",
                    "courses": [
                        {
                            "name": "Analys III",
                            "course_code": "TNA006",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNA006/ht-2023",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Olof Svensson",
                                "study_director": "George Baravdish",
                                "scheduled_hours": "50 h",
                                "self_study_hours": "110 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen bygger på kursen i Analys I-II. Följaktligen är målen likartade: att ge de studerande förståelse för matematiska begrepp och förtrogenhet med matematiska metoder för funktioner av flera variabler som uppstår i alla grenar av fysik och teknik. Studenten ska efter genomgången kurs kunna: hantera funktioner av flera variabler, t.ex. att kunna bestämma gränsvärden, avgöra om funktioner är kontinuerliga och differentierbara, bestämma partiella derivator, samt använda kedjeregeln för att transformera och lösa partiella differentialekvationer lösa globala och lokala maximi- och minimiproblem, med och utan bivillkor. citera och förklara definitioner av begrepp såsom lokalt extremvärde, gränsvärde, kontinuitet, partiell derivata, differntierbarhet, gradient, tangentplan, dubbel- och trippelintegraler. förklara och använda centrala satser såsom implicita funktionssatsen. beräkna dubbel- och trippelintegraler och  teckna uttryck för area och volymer med hjälp av dubbel- och trippelintegraler.",
                                "course_content": "Funktioner av flera variabler. Gränsvärden och kontinuitet. Partiell derivata, gradient, riktingsderivata och differential. Tangentplan och linearisering. Kedjeregeln. Taylors formel. Vektorvärda funktioner, Jacobis matris och Jacobian. Implicit derivering och implicita funktioner. Lokala och globala maxima och minima. Maximi- och minimiproblem med och utan bivillkor. Dubbel- och trippelintegraler. Itererad integration. Variabelbyte. Rymdkurvor.",
                                "teaching_methods": "Kursen ges i form av föreläsningar, lektioner, kontrollskrivningar och sluttentamen.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "6 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "KTR1",
                                    "name": "Frivillig dugga",
                                    "credits": "0 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Neymark, Mats,  (2017)",
                                    "title": "Matematisk analys : flera variabler",
                                    "edition": "Matematisk analys : flera variabler Upplaga 2 Stockholm : Liber, [2017] ISBN: 9789147125852"
                                },
                                {
                                    "type": "Kompendier",
                                    "title": "Problemsamling för kursen TNA006."
                                }
                            ]
                        },
                        {
                            "name": "Mekanik och vågfysik",
                            "course_code": "TNE043",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNE043/ht-2023",
                            "overview": {
                                "main_subject": "Teknisk, fysik,, Fysik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Ulf Sannemo",
                                "study_director": "Kjell Karlsson",
                                "scheduled_hours": "58 h",
                                "self_study_hours": "102 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen skall ge grundläggande kunskaper inom några centrala delar av den klassiska fysiken samt kännedom om viktiga tillämpningar. Laborationsdelen skall ge erfarenhet av att planera, utföra och redovisa experiment. Efter genomgången kurs skall studenten kunna tillämpa grundläggande kinematiksamband, Newtons lagar formulerade både för translations- och rotationsrörelse, energisamband, bevaringslagar vid modellformulering och problemlösning samt kunna redogöra för under vilka förutsättningar respektive lagar och samband kan användas använda grundläggande dynamik för att modellera enkla harmoniska svängningar samt utvidgningen av teorin till att omfatta mekaniska vågor formulera vågekvationen och ge exempel på lösningar, beräkna egenskaper som utbredningshastighet och ge exempel på tillämpningar beskriva och vid modellformulering och problemlösning tillämpa grundläggande begrepp inom akustik som exempelvis stående vågor, resonans och Dopplereffekt beskriva och tillämpa grundläggande begrepp inom den geometriska optiken inom fysikalisk optik kunna beskriva och tillämpa begrepp som polarisation, koherens, diffraktion, interferens och superposition vid problemlösning ge exempel på tillämpningar av mekanik och vågfysik inom såväl naturvetenskap som tekniska användningsområden ha utvecklat sin begreppsförståelse, sin problemlösningsförmåga och sitt modelltänkande inom fysik redogöra för innebörden av experimentell problemlösning samt den arbetsgång som används bedöma om beräknade och uppmätta resultat är rimliga och utföra dimensionsanalys av fysikaliska formler skriva en vetenskaplig rapport med ett akademiskt språk samt muntligt presentera resultat och opponera på andra studenters resultat",
                                "course_content": "Introduktion till experimentell problemlösning, dimensionsanalys, mätvärdesbehandling. Mekanik: Kinematik, kraft, Newtons lagar, energi och arbete, svängningar, stöt, rotation kring fix axel. Vågrörelselära och optik: allmän vågrörelse, superposition, vågekvationen, mekaniska vågor, akustik, elektromagnetiska vågor, geometrisk optik, interfererens, diffraktion. Individuell rapportskrivning med ökade krav på akademiskt språk samt muntlig presentation och opposition.",
                                "teaching_methods": "Kursen består av föreläsningar, lektioner och laborationer. En skriftlig tentamen ges efter kursens slut. I laborationskursen ingår en individuellt skriven rapport på svenska, presentation samt opposition.I kursen ingår en del av kommunikationsstrimman i svenska för ED, KTS och MT.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN2",
                                    "name": "En skriftlig tentamen",
                                    "credits": "4 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB2",
                                    "name": "En obligatorisk laborationskurs",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "KTR1",
                                    "name": "Frivillig dugga",
                                    "credits": "0 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG3",
                                    "name": "Rapportskrivn. på svenska, muntlig presentation o opposition",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Halliday, Resnick, Walker,  (2020)",
                                    "title": "Halliday & Resnick´s Principles of Physics,",
                                    "edition": "Halliday & Resnick´s Principles of Physics, 11:th Edition, Global Edition, Wiley ISBN: 978111945549-3 (e-book) , 978111945401-4 (paperback)"
                                },
                                {
                                    "type": "Kompendier",
                                    "title": "B Sandell (reviderad av P Andersson och M Eriksson 2019), Experimentell problemlösning, utgivet av LiU"
                                }
                            ]
                        },
                        {
                            "name": "Logistik och produktionsplanering",
                            "course_code": "TNK122",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK122/ht-2023",
                            "overview": {
                                "main_subject": "Logistik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Martin Waldemarsson",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "40 h",
                                "self_study_hours": "120 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Efter fullgjord kurs skall studenten: Kunna beskriva logistiksystem med vilka aktörer som finns och deras roller. Kunna visa på förståelse för grunderna i logistik och produktion. Kunna visa på förståelse för kopplingen mellan logistik och produktion. Ha insikt om relevanta frågeställningar rörande industriell produktion. Förstå principerna bakom hierarkisk (produktions)planering, och principerna för produktstrukturer. Kunna använda de vanligaste metoderna för prognostisering och hur dessa kopplar till en produkts livscykel. Kunna använda de vanliga metoderna för lagerstyrning och flaskhalsstyrning.",
                                "course_content": "Grunder i logistik och dess koppling till produktion: Aktörer i logistiksystemet, order- till leveransprocessen. Grunderna i prognostisering: Prognostisering, glidande medelvärde, exponentiell utjämning, dekomposition med trend, säsong och nivå, prognosfel och –uppföljning. Hierarkisk produktionsplanering: MRP II med sälj- och verksamhetsplanering, huvudplanering, materialbehovsplanering, detaljplanering, grov kapacitetsplanering, kapacitetsbehovsplanering. Grunder i lagerstyrning: partiformningsmetoder, beställningsmetoder, kundorderpunkt Produktionsprocess och –val: produkt/processmatris, produktionsstrukturer/-layout, linjebalansering, nätverksplanering, flaskhalsstyrning, produktlivscykel.",
                                "teaching_methods": "Kursen ges i form av föreläsningar, lektioner, seminarier och laborationer. På föreläsningar gås huvuddelen av teorin igenom. Lektionerna ägnas åt räkneövningar som relaterar till kursinnehållet. Laborationerna ägnas åt datorbaserade övningar. Seminarierna är till för att arbeta och diskutera obligatoriskt praktikfall och litteratur.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "DIK2",
                                    "name": "Frivillig digital kontrollskrivning",
                                    "credits": "0 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laborationsserie",
                                    "credits": "2 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "TEN2",
                                    "name": "Skriftlig tentamen",
                                    "credits": "4 hp",
                                    "grading": "U, 3, 4, 5"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Jonsson, Patrik, Mattsson, Stig-Arne,  (2016)",
                                    "title": "Logistik : läran om effektiva materialflöden",
                                    "edition": "Logistik : läran om effektiva materialflöden 3., [rev.] uppl. Lund : Studentlitteratur, 2016 ISBN: 9789144110776 Referenslitteratur"
                                },
                                {
                                    "type": "Böcker",
                                    "authors": "Olhager, Jan,  (2013)",
                                    "title": "Produktionsekonomi : principer och metoder för utformning, styrning och utveckling av industriell produktion",
                                    "edition": "Produktionsekonomi : principer och metoder för utformning, styrning och utveckling av industriell produktion 2., [rev.] uppl. Lund : Studentlitteratur, 2013 ISBN: 9789144067667 Primär"
                                }
                            ]
                        },
                        {
                            "name": "Objektorienterad programmering",
                            "course_code": "TND002",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TND002/ht-2023",
                            "overview": {
                                "main_subject": "Datateknik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Mark E Dieckmann",
                                "study_director": "Camilla Forsell",
                                "scheduled_hours": "70 h",
                                "self_study_hours": "90 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen ska ge kunskaper om objektorienterad programutveckling \noch programmering i ett objektorienterat programspråk, Java. Efter kursen ska deltagaren kunna: skriva enkla program för in- och utmatning av tal och text dels för kommandofönster och dels med dialogrutor. förklara skillnaden mellan inbyggda typer och klasstyper/objekt  samt skillanden mellan enkla variabler och referensvariabler. förklara skillnaden mellan instansvariabler och klassvariabler samt skillnaden mellan instansmetoder och klassmetoder. designa och implementera egna klasser samt använda dem. använda vanliga standardklasser från Java API. skriva program för filhantering, särskilt för textfiler. förklara begreppen arv, polymorfism och dynamisk bindning samt begreppen abstrakt klass och interface. designa och implementera egna klasshierarkier samt använda dem. skriva program med enkla grafiska gränssnitt. förklara begreppet händelsestyrda program. för ett givet problem utveckla ett objektorienterat program bestående av ett antal klasser samt dokumentera detta i UML.",
                                "course_content": "Programspråket Java, variabler och datatyper,  in- och utmatning, styrsatser.Klasser och objekt,  instansvariabler och instansmetoder, klassvariabler och klassmetoder. Objektorienterad programutveckling, klassdiagram och UML.Standardklasser och Java API.  Ärvning, subklasser och superklasser, polymorfism och dynamisk bindning, abstrakta klasser och interface.Strömmar och filer, felhantering. Program med grafiska användargränssnitt, grafiska komponenter och layouthanterare, händelsestyrda program.",
                                "teaching_methods": "Föreläsningar, lektioner och laborationer.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "DAT1",
                                    "name": "Tentamen med datorstöd",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laborationskurs",
                                    "credits": "3 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Övrigt",
                                    "title": "Endast föreläsningsanteckningar."
                                }
                            ]
                        },
                        {
                            "name": "Optimeringslära",
                            "course_code": "TNK049",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK049/ht-2023",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Stefan Engevall",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "48 h",
                                "self_study_hours": "112 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen skall ge kunskaper i optimeringslära, och speciellt optimering av linjära och icke-linjära (kontinuerliga) problem, samt problem med nätverksstruktur. Studenten ska efter avslutad kurs kunna: analysera och formulera linjära optimeringsmodeller inom olika ekonomiska och tekniska tillämpningsområden. analysera och formulera optimeringsmodeller för problem med underliggande nätverksstruktur. hantera den grundläggande matematiska teorin på vilken modeller och algoritmer bygger. använda och dra slutsatser från optimeringsmetoder för optimeringsproblem i kontinuerliga variabler, så som simplexmetoden, anpassningar av simplexmetoden för nätverksproblem, descent-metoder för problem utan bivillkor, samt Frank Wolfe-algoritmen. analysera optimeringsmodeller med avseende på konvexitet och formulera optimalitetsvillkor för problem i kontinuerliga variabler. lösa optimeringsproblem såväl manuellt som med hjälp av dator.",
                                "course_content": "Linjärprogrammering: Modellering, grundläggande matematisk teori och geometri, simplexmetoden, känslighetsanalys, dualitet, optimalitetsvillkor. Ickelinjär optimering: Modellering, konvexitet, obegränsad optimering, optimering med linjära bivillkor, optimalitetsvillkor. Nätverksoptimering: Modellering, trädproblem, vägproblem, minkostnadsflödesproblem med varianter och simplexmetoden för nätverksproblem",
                                "teaching_methods": "Kursen består av inspelade föreläsningar, seminarier med teorigenomgång, lektioner, samt en laborationskurs.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "4.5 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laborationskurs",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Henningsson, M., Lundgren, J., Rönnqvist, M. och Värbrand P.,  (2010)",
                                    "title": "Optimeringslära: Övningsbok",
                                    "edition": "Optimeringslära: Övningsbok 2 Studentlitteratur ISBN: 9789144067605"
                                },
                                {
                                    "type": "Böcker",
                                    "authors": "Lundgren, Jan, Rönnqvist, Mikael, Värbrand, Peter,  (2008)",
                                    "title": "Optimeringslära",
                                    "edition": "Optimeringslära 3 Studentlitteratur ISBN: 9789144053141"
                                }
                            ]
                        },
                        {
                            "name": "Transportekonomi",
                            "course_code": "TNK113",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK113/ht-2023",
                            "overview": {
                                "main_subject": "Logistik,, Transportsystem",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Martin Kylinger",
                                "study_director": "Helene Lidestam",
                                "scheduled_hours": "46 h",
                                "self_study_hours": "114 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen syftar till att belysa betydelsen av transportkostnader och andra ekonomiska förutsättningar för transportsystemets funktion, samt att tydliggöra transportsystemets betydelse för övriga samhället. Efter genomgången kurs skall studenten kunna: redogöra för grundläggande mikroekonomi inklusive marknadsformerna fullständig konkurrens och monopol, kunna använda de vanligaste begreppen och modellerna för hur ekonomiska beslut bör fattas på grundval av given information och med sikte på olika ekonomiska mål, kunna formulera, strukturera och analysera väsentliga delar av den ekonomiska verkligheten och dess samband, hur det ekonomiska systemets aktörer växelverkar med varandra och hur prisbildningen sker under olika konkurrensantaganden, ha kännedom om hur olika transportslags kostnadsstruktur påverkar den optimala utformningen av transportsystemet, redogöra för principerna för prissättning samt hur detta kan tillämpas på olika transportslag, redogöra för principerna för samhällsekonomiskt baserad investeringsbedömning samt att kunna tillämpa dessa i proaktisk kostnads-nettoanalys av transportsystemförändringar.",
                                "course_content": "Kursen introducerar skillnader mellan företagsekonomisk och samhällsekonomisk ansats samt utgår ifrån ett ekonomiskt hållbart perspektiv. Kursen behandlar ett antal delvis överlappande områden: Grundläggande mikroekonomiHär studeras hur resursfördelningen via prisbildningen fungerar i en marknadsekonomi under marknadsformerna fullständig konkurrens och monopol. Matematiskt modellbyggande: Formulering och lösande av matematiska modeller med ekonomisk tillämpning, optimering med bivillkor Efterfrågan: Konsumentens problem, efterfrågan och utbud Producentteori: Teorier kring produktionsfunktionen, isokostnadskurvor, expansionskurvor och prisdiskriminering Marknadsteori: Teorin för fullständig konkurrens, monopol och olika former av oligopollösningar. Investeringar i transportinfrastrukturEtt effektivt transportsystem kräver en välfungerande infrastruktur. Kursen behandlar principer för investeringsbedömning via kostnads-nyttoanalys som syftar till effektiv användande av samhällets resurser genom att identifiera samhällsekonomiskt lönsamma projekt samt prioritera mellan dem. PrissättningTransportkostnader, inklusive användarkostnader i form av tid och miljökostnader, påverkar individers och företags agerande och strategival. Prissättning utgör en nödvändig del av ett effektivt transportsystem. Här undersöks generella prissättningsprinciper samt tillämpningar för olika trafikslag under olika förutsättningar. Planering och reglering av transportsystemKursen kommer även att behandla viss planering av transportsystem och effekten av olika typer av regleringar. Exempelvis kommer samhällsekonomiskt effektiv utformning av kollektivtrafiksystem i termer av linjeläggning, trafikutbud och prissättning diskuteras.",
                                "teaching_methods": "Undervisningen sker i form av föreläsningar, lektioner och seminarier. Föreläsningarna behandlar i huvudsak teoriavsnitt, praktikfall och tillämpningar. Lektioner ägnas åt räkneövningar och diskussioner. Seminarier används för muntlig redovisning av uppgifter samt diskussion.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för ekonomisk och industriell utveckling"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "4 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "UPG1",
                                    "name": "Inlämningsuppgifter",
                                    "credits": "2 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Lundmark, Robert,  (2018)",
                                    "title": "Utdrag ur Mikroekonomi: Produktion och marknad",
                                    "edition": "Utdrag ur Mikroekonomi: Produktion och marknad Studentlitteratur ISBN: 9789144126753"
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Termin 4 VT 2024",
                    "courses": [
                        {
                            "name": "Tillämpad transformteori",
                            "course_code": "TNG032",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNG032/vt-2024",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Lukás Malý",
                                "study_director": "George Baravdish",
                                "scheduled_hours": "58 h",
                                "self_study_hours": "102 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen skall ge de matematiska grunderna för de transformmetoder som används i kretsteori, reglerteori, signaler och system, bildbehandling och produktionsekonomi. Studenten ska efter genomgången kurs: kunna använda och bestämma Fourierserier, tillämpa Parsevals formel, känna till konvergensresultat transformera funktioner och talföljder, med Fourier-, Laplace- och Z-transformen ha kunskap om vilka funktioner och serier som kan transformeras använda transformer och Fourierserier för att lösa t.ex. ordinära differentialekvationer, partiella differentialekvationer, differensekvationer, integralekvationer ha förmåga att på engelska skriva en teknisk rapport.",
                                "course_content": "Några viktiga linjära transformationer studeras, med hjälp av vilka linjära problem, givna av differential-, integral-, differensekvationer kan översättas till mer hanterbara linjära algebraiska problem. Följande moment kommer att studeras: Fourierserier, Parsevals relation, Fouriertransformer, Inversionsformeln, Faltningsformeln, Laplacetransformen, z-transformen.I laborationskursen ingår en skriftlig rapport på engelska. Fördjupning av språkfärdighet utifrån strimman åk 1.",
                                "teaching_methods": "Undervisningen sker i form av föreläsningar, lektioner, laborationer och språkseminarier. På språkseminarier förutsätts aktiv medverkan. I kursen ingår en del av kommunikationsstrimman i engelska för ED, KTS och MT.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "UPGB",
                                    "name": "Rapportskrivning på engelska",
                                    "credits": "0.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPGA",
                                    "name": "Aktiv medverkan med inlämning på språkseminarier",
                                    "credits": "0.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "TEN3",
                                    "name": "En skriftlig tentamen",
                                    "credits": "4 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB3",
                                    "name": "En laborationskurs",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "KTR1",
                                    "name": "Frivillig dugga",
                                    "credits": "0 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Beerends, R. J., 1958-,  (2003)",
                                    "title": "Fourier and Laplace transforms",
                                    "edition": "Fourier and Laplace transforms ISBN: 9780521806893, 9780521534413, 0521806895, 0521534410"
                                },
                                {
                                    "type": "Övrigt",
                                    "title": "Problemsamling"
                                }
                            ]
                        },
                        {
                            "name": "Transportekonomi",
                            "course_code": "TNK113",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK113/vt-2024",
                            "overview": {
                                "main_subject": "Logistik,, Transportsystem",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Martin Kylinger",
                                "study_director": "Helene Lidestam",
                                "scheduled_hours": "46 h",
                                "self_study_hours": "114 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen syftar till att belysa betydelsen av transportkostnader och andra ekonomiska förutsättningar för transportsystemets funktion, samt att tydliggöra transportsystemets betydelse för övriga samhället. Efter genomgången kurs skall studenten kunna: redogöra för grundläggande mikroekonomi inklusive marknadsformerna fullständig konkurrens och monopol, kunna använda de vanligaste begreppen och modellerna för hur ekonomiska beslut bör fattas på grundval av given information och med sikte på olika ekonomiska mål, kunna formulera, strukturera och analysera väsentliga delar av den ekonomiska verkligheten och dess samband, hur det ekonomiska systemets aktörer växelverkar med varandra och hur prisbildningen sker under olika konkurrensantaganden, ha kännedom om hur olika transportslags kostnadsstruktur påverkar den optimala utformningen av transportsystemet, redogöra för principerna för prissättning samt hur detta kan tillämpas på olika transportslag, redogöra för principerna för samhällsekonomiskt baserad investeringsbedömning samt att kunna tillämpa dessa i proaktisk kostnads-nettoanalys av transportsystemförändringar.",
                                "course_content": "Kursen introducerar skillnader mellan företagsekonomisk och samhällsekonomisk ansats samt utgår ifrån ett ekonomiskt hållbart perspektiv. Kursen behandlar ett antal delvis överlappande områden: Grundläggande mikroekonomiHär studeras hur resursfördelningen via prisbildningen fungerar i en marknadsekonomi under marknadsformerna fullständig konkurrens och monopol. Matematiskt modellbyggande: Formulering och lösande av matematiska modeller med ekonomisk tillämpning, optimering med bivillkor Efterfrågan: Konsumentens problem, efterfrågan och utbud Producentteori: Teorier kring produktionsfunktionen, isokostnadskurvor, expansionskurvor och prisdiskriminering Marknadsteori: Teorin för fullständig konkurrens, monopol och olika former av oligopollösningar. Investeringar i transportinfrastrukturEtt effektivt transportsystem kräver en välfungerande infrastruktur. Kursen behandlar principer för investeringsbedömning via kostnads-nyttoanalys som syftar till effektiv användande av samhällets resurser genom att identifiera samhällsekonomiskt lönsamma projekt samt prioritera mellan dem. PrissättningTransportkostnader, inklusive användarkostnader i form av tid och miljökostnader, påverkar individers och företags agerande och strategival. Prissättning utgör en nödvändig del av ett effektivt transportsystem. Här undersöks generella prissättningsprinciper samt tillämpningar för olika trafikslag under olika förutsättningar. Planering och reglering av transportsystemKursen kommer även att behandla viss planering av transportsystem och effekten av olika typer av regleringar. Exempelvis kommer samhällsekonomiskt effektiv utformning av kollektivtrafiksystem i termer av linjeläggning, trafikutbud och prissättning diskuteras.",
                                "teaching_methods": "Undervisningen sker i form av föreläsningar, lektioner och seminarier. Föreläsningarna behandlar i huvudsak teoriavsnitt, praktikfall och tillämpningar. Lektioner ägnas åt räkneövningar och diskussioner. Seminarier används för muntlig redovisning av uppgifter samt diskussion.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för ekonomisk och industriell utveckling"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "4 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "UPG1",
                                    "name": "Inlämningsuppgifter",
                                    "credits": "2 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Lundmark, Robert,  (2018)",
                                    "title": "Utdrag ur Mikroekonomi: Produktion och marknad",
                                    "edition": "Utdrag ur Mikroekonomi: Produktion och marknad Studentlitteratur ISBN: 9789144126753"
                                }
                            ]
                        },
                        {
                            "name": "Trafikens infrastruktur",
                            "course_code": "TNK126",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK126/vt-2024",
                            "overview": {
                                "main_subject": "Transportsystem",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Anders Peterson",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "30 h",
                                "self_study_hours": "130 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen syftar till att ge grundläggande kunskaper om trafiksystemets infrastruktur, dess uppbyggnad och funktioner, samt koppling till övrig stadsplanering. Efter kursen ska studenterna känna till viktiga förutsättningar och metoder för planering av biltrafik, kollektivtrafik samt gång- och cykeltrafik i städer känna till grundläggande begrepp och tillvägagångssätt inom trafikplanering och stadsplanering kunna beskriva egenskaper, funktioner och begränsningar hos de viktigaste typerna av modeller som används vid strategisk trafikplanering kunna använda ett på marknaden vanligt förekommande planeringsverktyg för att göra trafikanalyser känna till grundläggande begrepp och kunna analysera trafiksäkerhet identifiera viktiga teorier, modeller, begränsningar och åtgärder inom trafiksäkerhet utvärdera påverkan av väginfrastruktur och smarta lösningar på trafiksäkerhet kunna tillämpa de förvärvade kunskaper för att göra en helhetsbedömning av ett trafikinfrastrukturprojekt",
                                "course_content": "Översiktlig fysisk planering och trafikplanering. Utvärdering av trafiksystem. Orientering om planeringsmetoder och planeringsverktyg. Fyrstegsmodellen för trafikprognoser. En introduktion till trafiksäkerhet med övningar.",
                                "teaching_methods": "Undervisningen ges främst i form av föreläsningar där externa gäster kan medverka. Kursen är indelad i tre delar: Trafikplanering och stadsplanering Trafikprognosmodeller Trafiksäkerhet Till varje del hör ett antal inlämningsuppgifter som löses individuellt, samt en deluppgift till ett projekt som löses i grupp. Kursen pågår hela vårterminen.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "UPG1",
                                    "name": "Projektuppgifter",
                                    "credits": "4 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "UPG2",
                                    "name": "Inlämningsuppgifter",
                                    "credits": "2 hp",
                                    "grading": "U, 3, 4, 5"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Matematisk statistik",
                            "course_code": "TNG006",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNG006/vt-2024",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Tomas Johansson",
                                "study_director": "George Baravdish",
                                "scheduled_hours": "52 h",
                                "self_study_hours": "108 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen avser att lära den studerande förstå och utnyttja grundläggande sannolikhetslära och statistik, dvs teorin för försök som påverkas av slumpmässiga faktorer. Kursen inriktas speciellt på sådana grundläggande kunskaper som krävs för tillämpningar inom teknik, ekonomi och naturvetenskap. Efter fullgjord kurs skall studenten  kunna: Teckna och använda händelser samt stokastiska variabler i olika problemformuleringar Använda betingad sannolikhet Använda multiplikationsprincipen samt kombinatorik Ha god förståelse för härledning och användning av de olika fördelningsfunktionerna, se kursinnehåll nedan Avgöra om det föreligger oberoende för givna variabler Vid behov räkna ut väntevärde och varians för stokastiska variabler, summor och andra funktioner av dessa Använda centrala gränsvärdessatsen Punktskatta t.ex. med metoder såsom maximum-likelihood, momentskattningar och minsta kvadratskattningar Bestämma konfidensintervall för väntevärde och varians Ställa upp en nollhypotes och en mothypotes och bestämma ett förkastelseområde Använda regressionsanalys",
                                "course_content": "Sannolikhetslära: Händelser och sannolikheter i utfallsrum. Stokastiska variabler, sannolikhetsfördelningar, väntevärden och standardavvikelser. Bl a behandlas likformig, exponential-, normal-, binomial-, Poission- och hypergeometrisk fördelning. Kombinatorik. Beroende och oberoende variabler, något om beroendemått. Summor och andra funktioner av stokastiska variabler. Centrala gränsvärdessatsen och stora talens lag. Betingning. Statistik: Punktskattningar och deras osäkerhet, maximum-likelihood -skattningar, momentskattningar och minsta kvadratskattningar. Chi-två- och t-fördelning. Intervallskattning. Hypotestestning med och utan parametriska förutsättningar.  Regressionsanalys. Problemlösning inriktad på problemställningar från teknik, naturvetenskap, kvalitetskontroll mm.",
                                "teaching_methods": "Föreläsningar och lektionsundervisning.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "En skriftlig tentamen",
                                    "credits": "6 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "KTR1",
                                    "name": "Frivillig dugga",
                                    "credits": "0 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Signaler och system",
                            "course_code": "TNG015",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNG015/vt-2024",
                            "overview": {
                                "main_subject": "Elektroteknik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Naveen Kumar Dasanadoddi Venkategowda",
                                "study_director": "Kjell Karlsson",
                                "scheduled_hours": "50 h",
                                "self_study_hours": "110 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Efter avslutad kurs ska studenten kunna: Hantera tidskontinuerliga signaler och system i tids- och frekvensdomänen (TEN6) Hantera tidsdiskreta signaler och system i tids- och frekvensdomänen (TEN7) Tillämpa Fourier-, Laplace- och Z-transformen för beräkningar och analys (LAB2)",
                                "course_content": "Grundläggande signaler och deras egenskaper LTI-system Fouriertransformen och frekvensanalys Samplingsvillkor och tidsdiskreta signaler Laplacetransformen och systemanalys Z-transformen för samplade signaler och system Digitala filter (FIR och IIR) Adaptiva filter Individuell rapportskrivning (för högre betyg)",
                                "teaching_methods": "Föreläsningar, lektioner och laborationer.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "LAB2",
                                    "name": "En obligatorisk laborationskurs",
                                    "credits": "2 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "TEN6",
                                    "name": "Skriftlig tentamen",
                                    "credits": "2 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "TEN7",
                                    "name": "Skriftlig tentamen",
                                    "credits": "2 hp",
                                    "grading": "U, 3, 4, 5"
                                }
                            ],
                            "literature": []
                        }
                    ]
                },
                {
                    "name": "Termin 5 HT 2024",
                    "courses": [
                        {
                            "name": "Projektledning",
                            "course_code": "TEIO87",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TEIO87/ht-2024",
                            "overview": {
                                "main_subject": "Industriell, ekonomi",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Dzamila Bienkowska",
                                "study_director": "Dzamila Bienkowska",
                                "scheduled_hours": "48 h",
                                "self_study_hours": "112 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Efter genomgången kurs ska studenten: kunna redogöra för och förklara begrepp, modeller och teorier relaterade till planering och utvärdering av projekt kunna redogöra för och förklara begrepp, modeller och teorier relaterade till ledarskap och grupputveckling i projekt​ uppvisa förmåga att analysera beteende och ledarskap i projekt genom att tillämpa teorier och modeller uppvisa förmåga att reflektera över beteende och ledarskap i projekt",
                                "course_content": "grundläggande verktyg för projektplanering och analys organisation och roller i projekt grupputveckling och gruppsykologi ledarskap med beteendefokus - teorier och praktiska verktyg coachande ledarskap hantering av svåra samtal och konflikter utvärdering och uppföljning av projekt",
                                "teaching_methods": "Kursen är organiserad i: föreläsningar, projektarbete i grupp, samt handledningsmöten.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för ekonomisk och industriell utveckling"
                            },
                            "examinations": [
                                {
                                    "code": "KTR1",
                                    "name": "Kontrollskrivning",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "UPG1",
                                    "name": "Uppgift",
                                    "credits": "3 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Andersson, Leif E.,  (2015)",
                                    "title": "Psykologi för projektledare",
                                    "edition": "Psykologi för projektledare 1. uppl. Stockholm : Sanoma Utbildning, 2015 ISBN: 9789152327814"
                                },
                                {
                                    "type": "Artiklar",
                                    "title": "Vetenskapliga artiklar kan tillkomma i samband med projektarbete."
                                }
                            ]
                        },
                        {
                            "name": "Reglerteknik",
                            "course_code": "TNG028",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNG028/ht-2024",
                            "overview": {
                                "main_subject": "Elektroteknik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Anna Lombardi",
                                "study_director": "Kjell Karlsson",
                                "scheduled_hours": "60 h",
                                "self_study_hours": "100 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen skall ge förståelse för dynamiska system och kunskaper om grundläggande metoder för att analysera och dimensionera återkopplade reglersystem. Efter genomförd kurs skall studenten kunna Analysera modeller av dynamiska system på in-utsignalform samt konstruera och analysera reglersystem baserade på PID-regulatorer.  Beskriva de grundläggande förutsättningarna, möjligheterna och begränsningarna för återkopplad reglering. Analysera reglersystem utgående från modeller av dynamiska system givna på frekvensfunktionsform samt dimensionera regulatorer i frekvensdomän för att erhålla önskad systemprestanda. Genomföra systemanalys och konstruera reglersystem baserat på tillståndsmodeller. Modellera, konstruera och verifiera ett reglersystem för en labprocess.",
                                "course_content": "Del I:Differentialekvationer, överföringsfunktioner, poler och nollställenStabilitet, specifikationer, samband mellan dynamiska egenskaper och polerÅterkopplingsprincipen, blockschema, framkopplingPID-regulatorn, uppbyggnad och funktionTolkning av systemegenskaper m h a rotort Del II:Bodediagram, Nyquistdiagram, fas- och amplitudmarginalRegulatorer i frekvensdomän i form av högpass- och lågpass- filter för att erhålla önskad systemprestandaSamband mellan frekvens- och tidssvarTidsfördröjningarFundamentala begränsningar vid återkoppling, robusthetskriteriet Del III:Tillståndsmodeller, stabilitet, styr- och observerbarhetTillståndsåterkoppling, tillståndsskattning, återkoppling från skattade tillstånd",
                                "teaching_methods": "Kursen består av föreläsningar, lektioner, MATLAB-övningar och laborationer.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "4.5 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laboration",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "T. Glad och L. Ljung,  (2006)",
                                    "title": "Reglerteknik - Grundläggande teori",
                                    "edition": "Reglerteknik - Grundläggande teori Studentlitteratur"
                                },
                                {
                                    "type": "Kompendier",
                                    "title": "Övningsexempel"
                                }
                            ]
                        },
                        {
                            "name": "Optimering och systemanalys",
                            "course_code": "TNK047",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK047/ht-2024",
                            "overview": {
                                "main_subject": "Matematik,, Tillämpad, matematik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Carl Henrik Häll",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "48 h",
                                "self_study_hours": "112 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen ska ge vidare insikt i matematiska modeller och metoder för beslutsproblem. Områden som behandlas är beslutsproblem formulerade som optimeringsproblem med kontinuerliga och diskreta variabler och beslutsproblem formulerade som spelteoretiska problem. \nKursdeltagarna skall efter avslutad kurs kunna formulera och lösa modeller inom beslutsanalys. Efter kursens genomgång ska studenten kunna Tillämpa kunskaper och metoder från tidigare kurser i matematik och optimeringslära på modeller inom beslutsanalys. Känna till, anpassa och implementera grundläggande metoder för diskreta optimeringsproblem. Analysera och använda optimeringsmetoder för att lösa beslutsproblem som är formulerade som optimeringsmodeller. Beskriva och analysera spel mot naturen där sannolikheter och risker värderas i form av beslutsträd. Analysera enklare spelteoretiska problem, dels för spel med två spelare, dels för spel med flera spelare.",
                                "course_content": "Innehållet i kursen omfattar matematisk modellering av problem inom området beslutsanalys, samt spelteoretiska problem. Innehållet omfattar både modellering av utvalda problemtyper inom beslutsanalys, samt metoder för att kunna lösa de problem som är formulerade som optimeringsproblem med diskreta variabler. Lösningsmetoder för dessa problemtyper vidareutvecklas baserat på de metoder och algoritmer som grundlades i kursen Optimeringslära. \n\nMer specifikt innehåller kursen Modellering av beslutsproblem med diskreta variabler, exempelvis lokaliserings- och tillordningsproblem. Analys av beslutsproblem med diskreta variabler genom implementering och lösning med kommersiellt tillgänglig programvara. Implementering av problemspecifika metoder för beslutsproblem med diskreta variabler genom programmering. Metoder för beslutsanalys formulerade som spelteoretiska problem.",
                                "teaching_methods": "Föreläsningar, seminarier och laborationer.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laboration",
                                    "credits": "3 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "H.A.  Eiselt och C.-L.Sandblom, Springer",
                                    "title": "Decision Analysis, Location Models, and Sceduling Problems",
                                    "edition": "Decision Analysis, Location Models, and Sceduling Problems ISBN: 3-540-40338-8"
                                },
                                {
                                    "type": "Böcker",
                                    "authors": "Black, Ken,  (1994)",
                                    "title": "Business statistics : contemporary decision making",
                                    "edition": "Business statistics : contemporary decision making ISBN: 0314027882 Minneapolis/Saint Paul : West, 1994"
                                },
                                {
                                    "type": "Böcker",
                                    "authors": "Lundgren, Jan, Rönnqvist, Mikael, Värbrand, Peter,  (2008)",
                                    "title": "Optimeringslära",
                                    "edition": "Optimeringslära ISBN: 9789144053141 Lund : Studentlitteratur, 2008"
                                }
                            ]
                        },
                        {
                            "name": "Modellbygge och simulering",
                            "course_code": "TNG022",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNG022/ht-2024",
                            "overview": {
                                "main_subject": "Elektroteknik,, Medieteknik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Anna Lombardi",
                                "study_director": "Kjell Karlsson",
                                "scheduled_hours": "48 h",
                                "self_study_hours": "112 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen skall ge kunskaper om metoder och principer att bygga matematiska modeller för dynamiska system (dvs system som beskrivs med hjälp av differential och/eller differensekvationer). Kursen skall också ge kunskaper om hur modellernas egenskaper studeras genom simulering. Efter avslutad kurs förväntas studenten kunna: definiera, beskriva och tillämpa grundläggande begrepp relaterade till modeller, identifiering och simulering förenkla en given modell genom användande av statiska samband, ersättning av variabler med konstanter, försummande av små effekter/idealiseringar och aggregering av tillstånd utifrån balans- och jämviktsekvationer och andra fysikaliska samband modellera mekaniska (i en dimension), elektriska och flödessystem, och kombinationer av dessa, på DAE- och (om möjligt) tillståndsform ställa upp bindningsgrafer för tillämpliga system ur ovan nämnda klass, förenkla och analysera bindningsgrafen m a p kausalitetskonflikter, samt ur en given konfliktfri bindningsgraf ta fram en tillståndsmodell beräkna index för en given DAE modellera och simulera mekaniska (i en dimension) och elektriska system med hjälp av datorverktygen Simulink och OpenModelica identifiera en modell för ett verkligt system genom lämpligt val av experimentdesign, efterbehandling av data, modellstruktur och validering beräkna asymptotiska bias- och variansegenskaper för ett givet linjärt identifieringsproblem avgöra om en given simuleringsmetod är implicit eller explicit och vilket antal steg den har, samt beräkna lokala och globala felet och stabilitetsområdet för enkla simuleringsmetoder ha förmåga att på engelska skriva en analyserande teknisk rapport.",
                                "course_content": "Modeller och modellbegreppet. Differentialekvationer, differensekvationer. Att beskriva statiska och dynamiska förlopp. Fysikaliska grundekvationer för modellbygget: energibalans, flödesbalans, Newtons rörelselagar, strömningslagar och dylikt. Principer för modellbygget. Bindninggrafer. Modellförenkling. Differentialalgebraiska ekvationer. Identifiering av dynamiska system: metoder att konstruera modeller baserat på mätdata från processer. Blackboxmodeller. Parameterskattning i linjära dynamiska modeller. Systemidentifiering som modellbyggesverktyg. Modellvalidering. Simulering: numerisk noggrannhet och stabilitet. Simuleringsspråket: Simulink. Rapportskrivning på engelska av analyserande text knuten till kursinnehållet. Ytterligare fördjupning av språkfärdighet utifrån strimman åk 2.",
                                "teaching_methods": "Undervisningen förmedlas i form av föreläsningar, lektioner, laborationer samt språkseminarier med aktiv medverkan.I kursen ingår en del av kommunikationsstrimman i engelska för ED, KTS och MT.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "UPGB",
                                    "name": "Rapportskrivning på engelska",
                                    "credits": "0.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPGA",
                                    "name": "Aktiv medverkan med inlämning på språkseminarier",
                                    "credits": "0.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "TEN2",
                                    "name": "Skriftlig tentamen",
                                    "credits": "4 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB2",
                                    "name": "Laboration",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Datornät",
                            "course_code": "TNK108",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK108/ht-2024",
                            "overview": {
                                "main_subject": "Datateknik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Marian Codreanu",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "48 h",
                                "self_study_hours": "112 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Målet med kursen är att deltagarna efter avslutad kurs ska kunna: Identifiera de komponenter som bygger upp Internet Beskriva principen för klient-server- och peer-to-peer-kommunikation Redogöra för skillnader i egenskaper för olika funktioner och protokoll som används på Internet Jämföra och förklara användningsområden för olika typer av protokoll Härleda beteckningar, komponenter, tekniker och funktioner till rätt nivå i TCP/IP-modellen Beskriva nätverkslagrets funktion och implementering i TCP/IP Beskriva bakomliggande funktioner och befintliga tekniker för att åstadkomma IT-säkerhet Förklara möjligheter och begränsningar för realtidskommunikation via Internet Implementera enklare kommunikationslösningar Kvantitativt modellera utvalda funktioner i ett TCP/IP-nät Definiera och beräkna de viktigaste prestandamåtten i paketförmedlade nät Förklara principerna för fleranvändarsystem",
                                "course_content": "Syftet med kursen är att ge grundläggande kunskaper inom datornät, med fokus på TCP/IP.",
                                "teaching_methods": "Kursen består av föreläsningar och laborationer",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laborationer",
                                    "credits": "3 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Kurose, James F., Verfasser, Ross, Keith W., Sonstige,  (2021)",
                                    "title": "Computer networking : a top-down approach",
                                    "edition": "Computer networking : a top-down approach ISBN: 9780136681557, 0136681557"
                                }
                            ]
                        }
                    ]
                },
                {
                    "name": "Termin 6 VT 2025",
                    "courses": [
                        {
                            "name": "Vetenskaplig metodik inom logistik",
                            "course_code": "TNG042",
                            "credits": "2 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNG042/vt-2025",
                            "overview": {
                                "main_subject": "Logistik",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Anders Peterson",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "16 h",
                                "self_study_hours": "37 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Efter avslutad kurs ska studenten kunna: redogöra för de huvudsakliga begreppen och arbetsmetoderna för vetenskapligt arbete ha kunskap om kvalitativ och kvantitativ metod kunna kritisera vetenskapliga arbeten kunna söka och kritiskt granska informationskällor kunna utvärdera kontexten i vilken logistiksystemet studeras",
                                "course_content": "Föreläsningarna kommer att bland annat behandla:",
                                "teaching_methods": "Undervisning sker i föreläsningsform. Kursen bör läsas i anslutning till kandidatuppsatsen - gärna som en inledning till projektet, tanken är att den inlämningsuppgift enligt vilken kursen examineras är ett utkast på metodkapitel till kandidatuppsatsen, därför ska man helst försöka ha klart med exjobbet så tidigt som möjligt under kursens gång.",
                                "grade_scale": "Tvågradig skala, U, G",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "UPG2",
                                    "name": "Inlämningsuppgifter",
                                    "credits": "2 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Diskret simulering",
                            "course_code": "TNK089",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK089/vt-2025",
                            "overview": {
                                "main_subject": "Transportsystem",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Krisjanis Steins",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "58 h",
                                "self_study_hours": "102 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen syftar till att ge grundläggande kunskaper i diskret simulering och insikt i hur det kan användas för att analysera system inom bl a kommunikations- och transportområdet. Inom kursen ges också möjlighet att träna praktisk modellering. Efter avslutad kurs skall studenten kunna: Redogöra för grundläggande begrepp inom diskret händelsestyrd simulering Lista och förklara för- och nackdelar med simulering som analysverktyg Kunna modellera stokastisk indata med sannolikhetsfördelningar och bedöma kvalitet på indatamodellerna. Bygga enklare simuleringsmodeller av produktions-, tjänste- och transportsystem mha speciell simuleringsmjukvara. Utföra analyser mha simuleringsmodeller, dra slutsatser utifrån en stokastisk simulering.",
                                "course_content": "Grundläggande begrepp inom diskret simulering. Kunskap om hur man bygger upp en simuleringsstudie. Indatamodellering. Verifiering och validering av simuleringsmodeller. Experimentering och utdataanalys. Simuleringsverktyg. Modellering med hjälp av ARENA. Simuleringstillämpningar inom den tillverkande industrin. Simulering av kommunikations- och transportsystem.",
                                "teaching_methods": "Kursen består av föreläsningar och datorövningar/laborationer.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "En laborationsserie",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Kelton, W. David, Zupick, Nancy B., Ivey, Nate,  (2024)",
                                    "title": "Simulation with arena.",
                                    "edition": "Simulation with arena. Seventh edition. New York, NY : McGraw Hill, [2024] ISBN: 126627572X, 9781266275722 finns även som eBook på angiven länk (ISBN10: 1266432957, ISBN13: 9781266432958) https://www.mheducation.co.uk/simulation-with-arena-ise-9781266275722-emea-group"
                                }
                            ]
                        },
                        {
                            "name": "Mobil kommunikation",
                            "course_code": "TNK093",
                            "credits": "6 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK093/vt-2025",
                            "overview": {
                                "main_subject": "Elektroteknik,, Transportsystem",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Marian Codreanu",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "48 h",
                                "self_study_hours": "112 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Deltagarna ska efter avslutad kurs kunna: Identifiera de vanligaste komponenterna och funktionerna i ett mobilt kommunikationssystem Förklara vilka skillnader i egenskaper som finns för olika mobila kommunikationssystem och motivera varför de uppstår Jämföra och förklara användningsområden för olika typer av mobila kommunikationssystem Härleda beteckningar, komponenter, tekniker och funktioner till rätt nivå i OSI- samt Internetmodellen Utvärdera de kompromisser som görs mellan olika mobila kommunikationstekniker Definiera och beräkna de viktigaste prestandamåtten för mobila kommunikationssystem Bedöma prestanda för ett mobilt kommunikationssystem givet en uppsättning applikationsegenskaper Använda modeller och metoder för planering av cellulära nätverk",
                                "course_content": "Kursen syftar till att ge grundläggande kunskaper i mobil kommunikation och trådlösa nätverk, med fokus på olika kommunikationssystems egenskaper och prestanda.Kursen behandlar exempelvis modulation, medium access control, mobility management, radio resource management samt nätverksplanering och dimensionering. De kommunikationssystem som i huvudsak behandlas är GSM, GPRS, UMTS, LTE och WLAN.",
                                "teaching_methods": "Föreläsningar, lektioner, laborationer och mindre projektarbete.Kursen pågår hela vårterminen.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "TEN1",
                                    "name": "Skriftlig tentamen",
                                    "credits": "3 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "LAB1",
                                    "name": "Laborationer",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG2",
                                    "name": "Mindre projektuppgift",
                                    "credits": "2 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Böcker",
                                    "authors": "Miao, Guowang, Zander, Jens, Sung, Ki Won, Slimane, Slimane Ben,  (2016)",
                                    "title": "Fundamentals of mobile data networks.",
                                    "edition": "Fundamentals of mobile data networks. Cambridge Cambridge University Press, 2016 ISBN: 9781107143210"
                                },
                                {
                                    "type": "Böcker",
                                    "authors": "Schwartz, Mischa,  (2005)",
                                    "title": "Mobile wireless communications.",
                                    "edition": "Mobile wireless communications. New York : Cambridge University Press, 2005 ISBN: 0521843472"
                                }
                            ]
                        },
                        {
                            "name": "Kandidatprojekt kommunikation och transport",
                            "course_code": "TNK132",
                            "credits": "16 hp",
                            "VOF": "O",
                            "url": "https://studieinfo.liu.se/kurs/TNK132/vt-2025",
                            "overview": {
                                "main_subject": "Transportsystem",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Johan M Karlsson",
                                "study_director": "Erik Bergfeldt",
                                "scheduled_hours": "128 h",
                                "self_study_hours": "299 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Kursen avser att befästa kunskaper inom datakommunikation, transport och logistik genom tillämpning på en teknisk frågeställning. Efter avslutad kurs ska studenten kunna: planera, genomföra och redovisa ett tekniskt projekt formulera frågeställningar samt avgränsa inom givna tidsramar systematiskt integrera de kunskaper som förvärvats under studietiden för att lösa ett tekniskt problem tillämpa metod- och ämnesmässiga förkunskaper skapa, analysera och utvärdera tekniska lösningar beskriva och förklara etiska utmaningar kopplade till ingenjörsyrket och till teknisk utveckling professionellt uttrycka sig skriftligt och muntligt tillgodogöra sig innehållet i relevant facklitteratur och relatera sitt arbete till den kritiskt granska och diskutera ett tekniskt projekt",
                                "course_content": "Kursen utgörs av ett aktuellt projekt av lämplig omfattning. Projektet avslutas med en skriftlig rapport och muntliga presentationer. Modell för projekthantering (LIPS) samt projektdokument.Vidare bestäms kursinnehållet individuellt för varje projektgrupp och student i samråd med examinator och handledare.",
                                "teaching_methods": "Undervisningen sker i huvudsak i form av ett handlett projektarbete som utförs i grupper.Kursen inleds med ett antal föreläsningar som definierar projektuppgiften och projektets ramar. Under kursens gång arbetar studenterna i projektgrupper där stor vikt initialt läggs på att skapa relevant projektdokumentation enligt LIPS-modellen och att säkerställa projektets status löpande. Regelbundna projektmöten mellan projektgrupp och beställare planeras och genomförs med fokus på avverkade och kommande aktiviteter. Studenterna förutsätts ta stort eget ansvar för att projektarbetet genomförs och slutrapporteras. I kursen ingår en del av kommunikationsstrimman i svenska för KTS.",
                                "grade_scale": "Tvågradig skala, U, G",
                                "institution": "Institutionen för teknik och naturvetenskap"
                            },
                            "examinations": [
                                {
                                    "code": "UPG2",
                                    "name": "Projekt och individuell skriftlig rapport",
                                    "credits": "14.5 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG1",
                                    "name": "Etik",
                                    "credits": "1.5 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": []
                        },
                        {
                            "name": "Introduktionskurs i interkulturell kompetens",
                            "course_code": "TINT01",
                            "credits": "2 hp",
                            "VOF": "V",
                            "url": "https://studieinfo.liu.se/kurs/TINT01/vt-2025",
                            "overview": {
                                "main_subject": "Inget, huvudområde",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Christoph Röcklinsberg",
                                "study_director": "Daniel Ellström",
                                "scheduled_hours": "14 h",
                                "self_study_hours": "39 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Efter kursen skall studenterna kunna: Redogöra för grundläggande begrepp och teorier inom interkulturell kommunikation och det antropologiska kulturbegreppet Identifiera och beskriva specifika kulturella och kommunikativa mönster i Sverige Övergripande beskriva och kontrastera dessa kulturella mönster och prioriteringar med andra kultur- och språkområden i världen",
                                "course_content": "Grundläggande koncept inom interkulturell kommunikation, etnocentrism och stereotyper samt olika faser i det interkulturella mötet Introducera och reflektera över konceptet av ”Cultural Embeddedness” i människors sociala agerande Introducera och reflektera över konceptet av ”Doing Culture” i interaktiva kommunikationssituationer Introducera och reflektera över konceptet av ”Swedishness” och dess särdrag ur ett kontrastivt perspektiv Reflektera över det individuella beteendet vs. de kollektiva och kulturella förväntningarna",
                                "teaching_methods": "Undervisning sker genom föreläsningar och seminarier. Stor vikt läggs på reflektioner och diskussion i grupp över kulturens inverkan generellt men även specifikt över de kulturella mönstren i Sverige för att kunna relatera till och vara förberedd på möten med andra kulturer. I dessa delar är undervisningsspråket svenska. Föreläsningar ger vid sidan om introduktioner i kultur och interkulturella modeller även grundläggande inblick om olika kulturella värderingar i olika regioner i världen. Kursen ges vid flera tillfällen under året, varav kurstillfället under sommaren är på distans.",
                                "grade_scale": "Fyrgradig skala, LiU, U, 3, 4, 5",
                                "institution": "Institutionen för ekonomisk och industriell utveckling"
                            },
                            "examinations": [
                                {
                                    "code": "MOM1",
                                    "name": "Aktivt deltagande i seminarier och gruppdiskussioner",
                                    "credits": "1 hp",
                                    "grading": "U, G"
                                },
                                {
                                    "code": "UPG2",
                                    "name": "Digital inlämningsuppgift",
                                    "credits": "0.5 hp",
                                    "grading": "U, 3, 4, 5"
                                },
                                {
                                    "code": "UPG1",
                                    "name": "Digital inlämningsuppgift",
                                    "credits": "0.5 hp",
                                    "grading": "U, 3, 4, 5"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Kompendier",
                                    "title": "Kompendium (distribueras digitalt via kursrummet i Lisam)"
                                }
                            ]
                        },
                        {
                            "name": "Praktik",
                            "course_code": "TPTE06",
                            "credits": "6 hp",
                            "VOF": "F",
                            "url": "https://studieinfo.liu.se/kurs/TPTE06/vt-2025",
                            "overview": {
                                "main_subject": "Inget, huvudområde",
                                "education_level": "Grundnivå",
                                "course_type": "Programkurs",
                                "examiner": "Nämndspecifikt",
                                "study_director": "",
                                "scheduled_hours": "0 h",
                                "self_study_hours": "160 h"
                            },
                            "course_plan": {
                                "learning_objectives": "Målet med praktiken är att studenten skall få praktisk erfarenhet av arbete på en arbetsplats som bedöms som relevant för en individ med utbildning inom det tekniska eller naturvetenskapliga området. Efter praktikperiodens slut skall studenten vara förtrogen med arbetsmiljön i en verksamhet som utbildningen syftar till samt erhållit erfarenhet från samverkan på en arbetsplats. Vidare skall praktiken öka studentens förmåga att ta personligt ansvar och även ge erfarenhet av andra kompetenser som värdesätts utöver den tekniska/naturvetenskapliga ämneskunskapen. Efter genomgången kurs ska studenten kunna: redogöra för de krav som yrkeslivet ställer på ämneskunskaper reflektera över de generiska färdigheter som yrkesrollen kräver reflektera över på vilket sätt arbetsplatsens verksamhet påverkar samhället utifrån relevanta hållbarhetsperspektiv skriva en sammanfattande praktikrapport i enlighet med instruktion",
                                "course_content": "Kursen genomförs som en individuell praktik i en från universitets- och högskolesektorn extern organisation. Studenten ansvarar för att finna en praktikplats inom ett område som har anknytning till teknik/naturvetenskap. Praktikuppgifterna skall vara av relevant och teknisk/natur-vetenskaplig karaktär och på förhand definierade i en praktikplan. För att godkännas på kursen skall studenten vistas minst 3 veckor sammanhängande heltid på arbetsplatsen och därefter skriva en praktikrapport. För att studenten ska kunna redogöra för och reflektera över det som krävs enligt lärandemålen behöver arbetsplatsen erbjuda kontinuerlig kontakt med kollegor, dvs enbart ensamarbete är inte lämpligt.",
                                "teaching_methods": "När studenten funnit en lämplig praktikplats och en namngiven handledare vid den organisation där praktiken ska genomföras, kontaktas studievägledningen samt programnämndens ordförande (som fungerar som examinator alternativt delegerar uppdraget). Studievägledningen kontrollerar behörigheten och examinator godkänner praktikplanen. Praktikplanen ska vara formulerad enligt fastställd mall och undertecknad av handledaren och studenten. Studenten antas på praktikkursen via studievägledningen, som även kontrollerar behörigheten. Efter genomförd praktikperiod ska studenten dokumentera uppgiften i en skriftlig praktikrapport. Rapporten ska vara utförlig och professionellt skriven och väl spegla kursens mål. Det ska finnas en presentation av arbetsplatsen, en frågeställning i en yrkeslivskontext och en redogörelse för hur uppgifterna i praktikplanen angripits. Diskussionen ska vara omfattande och visa på den studerandes erhållna insikter av de krav som yrkesrollen kräver på såväl ämnesmässiga som generiska färdigheter. Rapporten ska innehålla god källhantering. Efter genomförd praktikperiod ska handledaren på arbetsplatsen styrka studentens närvaro samt aktiva medverkan i tilldelade praktikuppgifter i ett handledarintyg enligt fastställd mall. Ytterligare instruktioner samt mall för praktikplan och handledarintyg finns i bilaga, se fliken \"Övriga dokument\".",
                                "grade_scale": "Tvågradig skala, äldre version, U, G",
                                "institution": "Tekniska fakultetens kansli"
                            },
                            "examinations": [
                                {
                                    "code": "UPG1",
                                    "name": "Projektuppgift",
                                    "credits": "6 hp",
                                    "grading": "U, G"
                                }
                            ],
                            "literature": [
                                {
                                    "type": "Övrigt",
                                    "title": "Ingen obligatorisk litteratur. I förekommande fall bestäms litteratur i samråd med handledaren och anges i praktikplanen."
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}